-DATASET CSV empty
-BUFFER_POOL_SIZE 1073741824
--

-DEFINE_STATEMENT_BLOCK CREATE_LDBC [
-STATEMENT create node table Comment (id int64, creationDate INT64, locationIP STRING, browserUsed STRING, content STRING, length INT32, PRIMARY KEY (id));
---- ok
-STATEMENT create node table Forum (id INT64, title STRING, creationDate INT64, PRIMARY KEY (id));
---- ok
-STATEMENT create node table Organisation (id INT64, label STRING, name STRING, url STRING, PRIMARY KEY (id));
---- ok
-STATEMENT create node table Person (id INT64, firstName STRING, lastName STRING, gender STRING, birthday INT64, creationDate INT64, locationIP STRING, browserUsed STRING, PRIMARY KEY (id));
---- ok
-STATEMENT create node table Place (id INT64, name STRING, url STRING, label STRING, PRIMARY KEY (id));
---- ok
-STATEMENT create node table Post (id INT64, imageFile STRING, creationDate INT64, locationIP STRING, browserUsed STRING, language STRING, content STRING, length INT32, PRIMARY KEY (id));
---- ok
-STATEMENT create node table Tag (id INT64, name STRING, url STRING, PRIMARY KEY (id));
---- ok
-STATEMENT create node table TagClass (id INT64, name STRING, url STRING, PRIMARY KEY (id));
---- ok
-STATEMENT create rel table Comment_hasCreator (FROM Comment TO Person, MANY_MANY);
---- ok
-STATEMENT create rel table Comment_hasTag (FROM Comment TO Tag, MANY_MANY);
---- ok
-STATEMENT create rel table Comment_isLocatedIn (FROM Comment TO Place, MANY_ONE);
---- ok
-STATEMENT create rel table replyOf_Comment (FROM Comment TO Comment, MANY_ONE);
---- ok
-STATEMENT create rel table replyOf_Post (FROM Comment TO Post, MANY_ONE);
---- ok
-STATEMENT create rel table containerOf (FROM Forum TO Post, ONE_MANY);
---- ok
-STATEMENT create rel table hasMember (FROM Forum TO Person, joinDate INT64, MANY_MANY);
---- ok
-STATEMENT create rel table hasModerator (FROM Forum TO Person, MANY_MANY);
---- ok
-STATEMENT create rel table Forum_hasTag (FROM Forum TO Tag, MANY_MANY);
---- ok
-STATEMENT create rel table Organisation_isLocatedIn (FROM Organisation TO Place, MANY_ONE);
---- ok
-STATEMENT create rel table hasInterest (FROM Person TO Tag, MANY_MANY);
---- ok
-STATEMENT create rel table Person_isLocatedIn (FROM Person TO Place, MANY_ONE);
---- ok
-STATEMENT create rel table knows (FROM Person TO Person, creationDate INT64, MANY_MANY);
---- ok
-STATEMENT create rel table likes_Comment (FROM Person TO Comment, creationDate INT64, MANY_MANY);
---- ok
-STATEMENT create rel table likes_Post (FROM Person TO Post, creationDate INT64, MANY_MANY);
---- ok
-STATEMENT create rel table studyAt (FROM Person TO Organisation, classYear INT32, MANY_ONE);
---- ok
-STATEMENT create rel table workAt (FROM Person TO Organisation, workFrom INT32, MANY_MANY);
---- ok
-STATEMENT create rel table isPartOf (FROM Place TO Place, MANY_ONE);
---- ok
-STATEMENT create rel table Post_hasCreator (FROM Post TO Person, MANY_ONE);
---- ok
-STATEMENT create rel table Post_hasTag (FROM Post TO Tag, MANY_MANY);
---- ok
-STATEMENT create rel table Post_isLocatedIn (FROM Post TO Place, MANY_ONE);
---- ok
-STATEMENT create rel table hasType (FROM Tag TO TagClass, MANY_ONE);
---- ok
-STATEMENT create rel table isSubclassOf (FROM TagClass TO TagClass, MANY_ONE);
---- ok
]

-DEFINE_STATEMENT_BLOCK COPY_LDBC [
-STATEMENT COPY Comment FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Forum FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Forum.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Organisation FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Organisation.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Person FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Place FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Place.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Post FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Post.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Tag FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Tag.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY TagClass FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/TagClass.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Comment_hasCreator FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_hasCreator_Person.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Comment_hasCreator FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_hasCreator_Person_1.csv" (HEADER=false, DELIM='|');
---- ok
-STATEMENT COPY Comment_hasTag FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_hasTag_Tag.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Comment_hasTag FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_hasTag_Tag_1.csv" (HEADER=false, DELIM='|');
---- ok
-STATEMENT COPY Comment_isLocatedIn FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_isLocatedIn_Place.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Comment_isLocatedIn FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_isLocatedIn_Place_1.csv" (HEADER=false, DELIM='|');
---- ok
-STATEMENT COPY replyOf_Comment FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_replyOf_Comment.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY replyOf_Post FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment_replyOf_Post.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY containerOf FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Forum_containerOf_Post.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY hasMember FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Forum_hasMember_Person.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY hasModerator FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Forum_hasModerator_Person.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Forum_hasTag FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Forum_hasTag_Tag.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Organisation_isLocatedIn FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Organisation_isLocatedIn_Place.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY hasInterest FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_hasInterest_Tag.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Person_isLocatedIn FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_isLocatedIn_Place.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_knows_Person.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_knows_Person_1.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY likes_Comment FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_likes_Comment.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY likes_Comment FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_likes_Comment_1.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY likes_Post FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_likes_Post.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY likes_Post FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_likes_Post_1.csv" (HEADER=false, DELIM='|');
---- ok
-STATEMENT COPY studyAt FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_studyAt_Organisation.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY workAt FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Person_workAt_Organisation.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY isPartOf FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Place_isPartOf_Place.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Post_hasCreator FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Post_hasCreator_Person.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Post_hasTag FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Post_hasTag_Tag.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY Post_isLocatedIn FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Post_isLocatedIn_Place.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY hasType FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Tag_hasType_TagClass.csv" (HEADER=true, DELIM='|');
---- ok
-STATEMENT COPY isSubclassOf FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/TagClass_isSubclassOf_TagClass.csv" (HEADER=true, DELIM='|');
---- ok
]

-CASE InsertLargeCommit
-INSERT_STATEMENT_BLOCK CREATE_LDBC
-STATEMENT BEGIN TRANSACTION;
---- ok
-INSERT_STATEMENT_BLOCK COPY_LDBC
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (t) RETURN count(*);
---- 1
327588

-CASE InsertLargeCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-INSERT_STATEMENT_BLOCK CREATE_LDBC
-STATEMENT BEGIN TRANSACTION;
---- ok
-INSERT_STATEMENT_BLOCK COPY_LDBC
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (t) RETURN count(*);
---- 1
327588

-CASE InsertLargeRollback
-INSERT_STATEMENT_BLOCK CREATE_LDBC
-STATEMENT BEGIN TRANSACTION;
---- ok
-INSERT_STATEMENT_BLOCK COPY_LDBC
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (t) RETURN count(*);
---- 1
0

-CASE InsertLargeRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-INSERT_STATEMENT_BLOCK CREATE_LDBC
-STATEMENT BEGIN TRANSACTION;
---- ok
-INSERT_STATEMENT_BLOCK COPY_LDBC
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (t) RETURN count(*);
---- 1
0
