-DATASET CSV ldbc-sf01

--

-CASE LargeMultiLabelScanWithFilter
-STATEMENT MATCH (a)-[e:likes_Comment|:likes_Post]->(b) WHERE e.creationDate > 20120723183906139 RETURN a.ID, b.ID
---- 1
7|8
