-DATASET CSV ldbc-sf01
# This test is intended for testing with smaller node group size
# Which can cause the BM to run out of memory
# Since we need to store metadata for each node group
-SKIP_IN_MEM
--

-CASE LargeMultiLabelScanWithFilter
-STATEMENT MATCH (a)-[e:likes_Comment|:likes_Post]->(b) WHERE e.creationDate > 20200723183906139 RETURN a.ID, b.ID
---- 0
