-DATASET CSV tinysnb

--

-CASE MatchOneHop

-LOG OneHopKnowsTest
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) RETURN COUNT(*)
---- 1
14

-LOG OneHopStudyAtTest
-STATEMENT MATCH (a:person)-[e1:studyAt]->(b:organisation) RETURN COUNT(*)
---- 1
3

-LOG OneHopWorkAtTest
-STATEMENT MATCH (a:person)-[e1:workAt]->(b:organisation) RETURN COUNT(*)
---- 1
3

-LOG OneHopCrossProductTest
-STATEMENT MATCH (a:person)-[:knows]->(b:person), (c:person)-[:knows]->(d:person) RETURN COUNT(*)
---- 1
196

-LOG OneHopStudyAtTest1
-STATEMENT MATCH (a:person)-[e1:studyAt]->(b:organisation) RETURN e1.code;
---- 3
9223372036854775808
6689
23

-LOG OneHopUndirectedEdgeProjection
-STATEMENT MATCH (a)-[e:knows]-(b) WHERE a.ID = 0 AND b.ID = 2 WITH e RETURN e;
---- 2
(0:0)-{_LABEL: knows, _ID: 3:0, date: 2021-06-30, meetTime: 1986-10-21 21:08:31.521, validInterval: 10 years 5 months 13:00:00.000024, comments: [rnme,m8sihsdnf2990nfiwf], summary: {locations: ['toronto','waterloo'], transfer: {day: 2021-01-02, amount: [100,200]}}, notes: 1, someMap: {a=b}}->(0:1)
(0:1)-{_LABEL: knows, _ID: 3:3, date: 2021-06-30, meetTime: 1946-08-25 19:07:22, validInterval: 10 years 5 months 13:00:00.000024, comments: [2huh9y89fsfw23,23nsihufhw723], summary: {locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}, notes: 4}->(0:0)
