-NAME q11
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) RETURN MIN(comment.length % 111)
---- 1
0