-NAME q12
-QUERY MATCH (comment:Comment) RETURN MIN(abs(comment.length))
---- 1
2