-NAME q13
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) RETURN MIN(gamma(comment.length % 2 + 2))
---- 1
1.000000