-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE Unwind

-LOG unwindArrayOfInt
-STATEMENT MATCH (a:person) UNWIND a.grades as x RETURN x
---- 32
96
54
86
92
98
42
93
88
91
75
21
95
76
88
99
89
96
59
65
88
80
78
34
83
43
83
67
43
77
64
100
54

-LOG unwindNestedArray
-STATEMENT UNWIND CAST([[5,2,1],[2,3],[15,64,74]], 'INT64[][3]') AS x RETURN x;
---- 3
[5,2,1]
[2,3]
[15,64,74]
