-DATASET CSV tinysnb copy-fault-tests/duplicate-ids
--

-CASE DropAndCreateTables
-STATEMENT DROP TABLE studyAt
---- ok
-STATEMENT MATCH ()-[e:studyAt]->() RETURN count(*)
---- error
Binder exception: Table studyAt does not exist.
-STATEMENT DROP TABLE workAt
---- ok
-STATEMENT MATCH ()-[e:workAt]->() RETURN count(*)
---- error
Binder exception: Table workAt does not exist.
-STATEMENT DROP TABLE organisation
---- ok
-STATEMENT MATCH (n:organisation) RETURN count(*)
---- error
Binder exception: Table organisation does not exist.
-STATEMENT DROP TABLE movies
---- ok
-STATEMENT MATCH (n:movies) RETURN count(*)
---- error
Binder exception: Table movies does not exist.
-STATEMENT create node table organisation (ID INT64, name STRING, orgCode INT64, mark DOUBLE, score INT64, history STRING, licenseValidInterval INTERVAL, rating DOUBLE, PRIMARY KEY (ID))
---- ok
-STATEMENT create rel table studyAt (FROM person TO organisation, year INT64, places STRING[], MANY_ONE) WITH (storage_direction = 'both');
---- ok
-STATEMENT create rel table workAt (FROM person TO organisation, year INT64, grading DOUBLE[2], rating float, MANY_ONE) WITH (storage_direction = 'invalid');
---- error
Runtime exception: Cannot parse invalid as ExtendDirection.
-STATEMENT create rel table workAt (FROM person TO organisation, year INT64, grading DOUBLE[2], rating float, MANY_ONE) WITH (storage_direction = 'fwd');
---- ok
-STATEMENT match (o:organisation) return o.name
---- ok
-STATEMENT match (:person)-[s:studyAt]->(:organisation) return s.year
---- ok
-STATEMENT match (:person)-[w:workAt]->(:organisation) return w.year
---- ok
-STATEMENT CREATE NODE TABLE books (ID INT64, rating DOUBLE DEFAULT 0, PRIMARY KEY (ID));
---- ok
-STATEMENT CREATE (b:books {ID: 0});
---- ok
-STATEMENT MATCH (b:books) RETURN b.*;
---- 1
0|0.000000

-CASE DDLOutputMessages
-STATEMENT CREATE NODE TABLE university(ID INT64, PRIMARY KEY(ID))
---- 1
Table university has been created.
-STATEMENT CREATE REL TABLE nearTo(FROM university TO university, MANY_MANY)
---- 1
Table nearTo has been created.
-STATEMENT DROP TABLE nearTo;
---- 1
Table nearTo has been dropped.
-STATEMENT DROP TABLE university
---- 1
Table university has been dropped.
-STATEMENT ALTER TABLE person DROP fName
---- 1
Table person altered.
-STATEMENT ALTER TABLE person DROP if exists fName
---- ok
-STATEMENT ALTER TABLE knows DROP date
---- 1
Table knows altered.
-STATEMENT ALTER TABLE knows DROP if exists date
---- ok

-CASE CreateRelGroup
-STATEMENT CREATE REL TABLE likes (FROM person TO person, FROM person TO organisation, since INT64);
---- 1
Table likes has been created.
-STATEMENT CREATE REL TABLE likes (FROM person TO person, FROM person TO organisation);
---- error
Binder exception: likes already exists in catalog.
-STATEMENT CREATE REL TABLE knows (FROM person TO person, FROM person TO organisation);
---- error
Binder exception: knows already exists in catalog.
-STATEMENT CREATE REL TABLE test_person_person (FROM person TO person);
---- ok
-STATEMENT CREATE REL TABLE test (FROM person TO person, FROM person TO organisation);
---- ok
-STATEMENT CREATE REL TABLE test2 (FROM person TO person, FROM person TO person);
---- error
Binder exception: Found duplicate FROM-TO person-person pairs.

-CASE CreateNodeTableCommitNormalExecution
-STATEMENT CREATE NODE TABLE EXAM_PAPER(STUDENT_ID INT64, MARK DOUBLE, PRIMARY KEY(STUDENT_ID))
---- ok
-STATEMENT MATCH (e:EXAM_PAPER) RETURN *
---- 0

-CASE CreateRelTableCommitNormalExecution
-STATEMENT CREATE REL TABLE likes(FROM person TO organisation, RATING INT64, MANY_ONE)
---- ok
-STATEMENT MATCH (:person)-[e:likes]->(:organisation) RETURN *
---- 0

-CASE DropNodeTableCommitNormalExecution
-STATEMENT DROP TABLE movies
---- ok
-STATEMENT MATCH (m:movies) RETURN count(*)
---- error
Binder exception: Table movies does not exist.

-CASE DropRelTableCommitNormalExecution
-STATEMENT DROP TABLE knows
---- ok
-STATEMENT MATCH ()-[k:knows]->() RETURN count(*)
---- error
Binder exception: Table knows does not exist.

-CASE AddNodeProperty
-STATEMENT CALL enable_zone_map=true;
---- ok
-STATEMENT create node table Comment (id int64, PRIMARY KEY (id));
---- ok
-STATEMENT copy Comment from '${KUZU_ROOT_DIRECTORY}/dataset/lsqb-sf01/Comment.csv' (HEADER=true);
---- ok
-STATEMENT alter table Comment add propx int64;
---- ok
-STATEMENT MATCH (c:Comment) RETURN SUM(c.propx);
---- 1

-STATEMENT alter table Comment add propi float default 5.4;
---- ok
-STATEMENT alter table Comment add propj int32 default 5 + 5;
---- ok
-STATEMENT MATCH (c:Comment) RETURN DISTINCT c.propi
---- 1
5.400000
-STATEMENT MATCH (c:Comment) RETURN DISTINCT c.propj
---- 1
10
-STATEMENT MATCH (c:Comment) WHERE c.propx <> 1 RETURN COUNT(*);
---- 1
0
-STATEMENT alter table Comment add propy int64 default 1;
---- ok
-STATEMENT MATCH (c:Comment) RETURN SUM(c.propy);
---- 1
215488
-STATEMENT MATCH (c:Comment) WHERE c.propy = 1 RETURN COUNT(*);
---- 1
215488
-STATEMENT create (c:Comment {id: 12345});
---- ok
-STATEMENT MATCH (c:Comment) RETURN SUM(c.propy);
---- 1
215489

-LOG AddNodePropertyIfNotExists
-STATEMENT alter table Comment add IF NOT EXISTS id int64 default 1;
---- ok

-STATEMENT CALL TABLE_INFO('Comment') RETURN *;
---- 5
0|id|INT64|NULL|True
1|propx|INT64|NULL|False
2|propi|FLOAT|5.4|False
3|propj|INT32|5 + 5|False
4|propy|INT64|1|False

-CASE AddRelProperty
-STATEMENT create node table Comment (id int64, PRIMARY KEY (id));
---- ok
-STATEMENT create rel table replyOf (FROM Comment TO Comment, MANY_ONE);
---- ok
-STATEMENT copy Comment from '${KUZU_ROOT_DIRECTORY}/dataset/lsqb-sf01/Comment.csv' (HEADER=true);
---- ok
-STATEMENT copy replyOf from '${KUZU_ROOT_DIRECTORY}/dataset/lsqb-sf01/Comment_replyOf_Comment.csv' (HEADER=true);
---- ok
-STATEMENT alter table replyOf add propx int64;
---- ok
-STATEMENT MATCH (c:Comment)-[r:replyOf]->(c2:Comment) RETURN SUM(r.propx);
---- 1

-STATEMENT alter table replyOf add propy int64 default 1;
---- ok
-STATEMENT MATCH (c:Comment)-[r:replyOf]->(c2:Comment) RETURN SUM(r.propy);
---- 1
108027

-LOG AddRelPropertyIfNotExists
-STATEMENT alter table replyOf add if not exists propy int64 default 1;
---- ok

-STATEMENT CALL TABLE_INFO('replyOf') RETURN *;
---- 2
1|propx|INT64|NULL|both
2|propy|INT64|1|both

-CASE DropNodeTablePropertyNormalExecution
-STATEMENT ALTER TABLE person DROP gender
---- ok
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE DropRelTablePropertyNormalExecution
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 5:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-DEFINE_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK [
-STATEMENT MATCH (p:person) return p.random
---- 8








]

-CASE AddInt64PropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random INT64
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddFixListPropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random INT64[3]
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddStringPropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRING
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddListOfInt64PropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random INT64[]
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddListOfStringPropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRING[]
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddListOfStructPropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[]
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddMapPropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random MAP(INT64, INT32)
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddStructPropertyToPersonTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int16, location string[])
---- ok
-INSERT_STATEMENT_BLOCK PERSON_TABLE_NULL_CHECK

-CASE AddInt64PropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random INT64 DEFAULT 8
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
8
8
8
8
8
8
8
8

-CASE AddStringPropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRING DEFAULT 'long long string'
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
long long string
long long string
long long string
long long string
long long string
long long string
long long string
long long string

-CASE AddListOfInt64PropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random INT64[] DEFAULT [142,123,789]
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]
[142,123,789]

-CASE AddListOfStringPropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRING[] DEFAULT ['142','short','long long long string']
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]
[142,short,long long long string]

-CASE AddListOfListOfStringPropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRING[][]
            DEFAULT [['142','51'],['short','long','123'],
            ['long long long string','short short short short short']]
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]
[[142,51],[short,long,123],[long long long string,short short short short short]]

-CASE AddListOfStructPropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[]
            DEFAULT [{revenue: 23, ages: [1.300000,2.500000]},
            {revenue: 33, ages: [2.700000]},
            {revenue: -4, ages: [22.500000,11.300000,33.200000]}]
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]
[{revenue: 23, ages: [1.300000,2.500000]},{revenue: 33, ages: [2.700000]},{revenue: -4, ages: [22.500000,11.300000,33.200000]}]

-CASE AddMapPropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64) DEFAULT map(['key1','key2'],[400,250])
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}
{key1=400, key2=250}

-CASE AddStructPropertyToPersonTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])
            DEFAULT {revenue: 123, ages: [1.200000,3.400000,5.600000]}
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}
{revenue: 123, ages: [1.200000,3.400000,5.600000]}

-DEFINE_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK [
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3



]

-CASE AddInt64PropertyToStudyAtTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random INT64
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-CASE AddStringPropertyToStudyAtTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random STRING
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-CASE AddListOfInt64PropertyToStudyAtTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random INT64[]
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-CASE AddListOfStringPropertyToStudyAtTableWithoutDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random STRING[]
---- ok
-INSERT_STATEMENT_BLOCK STUDY_AT_TABLE_NULL_CHECK

-CASE AddInt64PropertyToStudyAtTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random INT64 DEFAULT 42
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
42
42
42

-CASE AddStringPropertyToStudyAtTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random STRING DEFAULT 'VERY LONG STRING!!'
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
VERY LONG STRING!!
VERY LONG STRING!!
VERY LONG STRING!!

-CASE AddListOfINT64PropertyToStudyAtTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random INT64[] DEFAULT [11,15,20]
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
[11,15,20]
[11,15,20]
[11,15,20]

-CASE AddListOfStringPropertyToStudyAtTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random STRING[] DEFAULT ['13','15','long string!!']
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
[13,15,long string!!]
[13,15,long string!!]
[13,15,long string!!]

-CASE AddListOfListOfStringPropertyToStudyAtTableWithDefaultValueNormalExecution
-STATEMENT ALTER TABLE studyAt ADD random STRING[][]
            DEFAULT [['hello','good','long long string test'],
            ['6'],['very very long string']]
---- ok
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) return e.random
---- 3
[[hello,good,long long string test],[6],[very very long string]]
[[hello,good,long long string test],[6],[very very long string]]
[[hello,good,long long string test],[6],[very very long string]]

-CASE AddPropertyWithComplexExpression
-STATEMENT ALTER TABLE person ADD random INT64 DEFAULT  2 * abs(-2)
---- ok
-STATEMENT MATCH (p:person) return p.random
---- 8
4
4
4
4
4
4
4
4

-CASE RenameTableNormalExecution
-STATEMENT ALTER TABLE person RENAME TO student
---- ok
-STATEMENT MATCH (s:student) return s.age order by s.age
---- 8
20
20
25
30
35
40
45
83

-CASE RenamePropertyNormalExecution
-STATEMENT ALTER TABLE person RENAME fName TO name
---- ok
-STATEMENT MATCH (p:person) return p.name order by p.name
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-CASE CreateTableIfNotExists
-STATEMENT CREATE NODE TABLE IF NOT EXISTS UW(ID INT64, PRIMARY KEY(ID))
---- 1
Table UW has been created.
-STATEMENT CREATE NODE TABLE IF NOT EXISTS UW (ID INT64, PRIMARY KEY(ID))
---- 1
Table UW already exists.
-STATEMENT CREATE REL TABLE finds (FROM UW TO UW);
---- 1
Table finds has been created.
-STATEMENT CREATE REL TABLE IF NOT EXISTS finds (FROM UW TO UW);
---- 1
Table finds already exists.
-STATEMENT CREATE NODE TABLE student (ID INT64, PRIMARY KEY(ID));
---- 1
Table student has been created.
-STATEMENT CREATE REL TABLE interests(FROM UW to student, From student to student);
---- 1
Table interests has been created.
-STATEMENT CREATE REL TABLE IF NOT EXISTS interests(FROM UW to student, From student to student);
---- 1
Table interests already exists.
-STATEMENT CREATE NODE TABLE IF NOT EXISTS UW1 (ID INT64, PRIMARY KEY(ID))
---- 1
Table UW1 has been created.
-STATEMENT DROP TABLE IF EXISTS UW5
---- 1
Table UW5 does not exist.

-CASE CaseInsensitiveProperty
-STATEMENT CREATE NODE TABLE Wrong(id INT64, NAME STRING, name INT64, PRIMARY KEY(id));
---- error
Binder exception: Duplicated column name: name, column name must be unique.
-STATEMENT CREATE NODE TABLE A(id INT64, NAME STRING, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (:A {id:0, name:'a'});
---- ok
-STATEMENT MATCH (a:A) RETURN a.ID, a.name;
---- 1
0|a
-STATEMENT ALTER TABLE A ADD name STRING;
---- error
Runtime exception: A table already has property name.
-STATEMENT ALTER TABLE A DROP name;
---- 1
Table A altered.
-STATEMENT ALTER TABLE A ADD name STRING;
---- ok
-STATEMENT MATCH (a:A) RETURN a.ID, a.NAME;
---- 1
0|

-STATEMENT CREATE NODE TABLE TEST_KEYWORD(YIELD STRING, PRIMARY KEY(YIELD))
---- ok

-STATEMENT CREATE NODE TABLE default_val_type(val INT64 default 'wrong type', PRIMARY KEY(val))
---- error
Binder exception: Expression wrong type has data type STRING but expected INT64. Implicit cast is not supported.
-STATEMENT CREATE NODE TABLE default_val_type(val INT64 default upper('abc'), PRIMARY KEY(val))
---- error
Binder exception: Expression UPPER(abc) has data type STRING but expected INT64. Implicit cast is not supported.
-STATEMENT CREATE NODE TABLE default_val_type(val INT64, val1 INT64[3] default 'ABC', PRIMARY KEY(val))
---- error
Binder exception: Expression ABC has data type STRING but expected INT64[3]. Implicit cast is not supported.

-CASE CreateNodeTableAs
-STATEMENT CREATE NODE TABLE Test AS LOAD FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" WHERE ISStudent = True RETURN id, Gender, fname;
---- ok
-STATEMENT MATCH (a:Test) RETURN a.*;
---- 2
0|1|Alice
2|2|Bob
-STATEMENT CREATE NODE TABLE IF NOT EXISTS Test AS LOAD FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" WHERE ISStudent = True RETURN id, Gender, fname;
---- ok
-STATEMENT CREATE NODE TABLE IF NOT EXISTS Test2 AS MATCH (a:TEST) RETURN a.id, a.fname;
---- ok
-STATEMENT MATCH (a:Test2) RETURN a.*;
---- 2
0|Alice
2|Bob

-CASE CreateNodeTableAsDuplicateIntIDs
-STATEMENT CREATE NODE TABLE Foo AS LOAD FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/duplicate-ids/vPerson.csv" RETURN *;
---- error
Copy exception: Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.

-CASE CreateNodeTableAsEmptyReturn
-STATEMENT CREATE NODE TABLE Bar AS RETURN *;
---- error
Binder exception: RETURN or WITH * is not allowed when there are no variables in scope.
-STATEMENT CREATE NODE TABLE FooBar AS MATCH () RETURN *;
---- error
Binder exception: RETURN or WITH * is not allowed when there are no variables in scope.

-CASE CreateRelTableAs
-STATEMENT CREATE NODE TABLE Person2 AS LOAD FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" RETURN *;
---- ok
-STATEMENT COPY Person2 FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson2.csv";
---- ok
-STATEMENT CREATE REL TABLE Knows2 (FROM Person2 TO Person2) AS LOAD FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv" RETURN *;
---- ok
-STATEMENT CREATE REL TABLE IF NOT EXISTS Knows2 (FROM Person2 TO Person2) AS LOAD FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv" RETURN *;
---- ok
-STATEMENT MATCH (a:Person2)-[k:Knows2]->(b:Person2) RETURN a.fname, b.fname;
---- 6
Alice|Dan
Alice|Carol
Alice|Bob
Bob|Dan
Bob|Carol
Bob|Alice
-STATEMENT CREATE REL TABLE Knows2 (FROM Person2 TO Person2) AS LOAD FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv" RETURN *;
---- error
Binder exception: Knows2 already exists in catalog.
-STATEMENT CREATE REL TABLE Failure (FROM Person2 TO Person2, FROM Person TO Test2) AS MATCH (:Person2)-[e:Knows2]->(:Person2) RETURN *;
---- error
Binder exception: Multiple FROM/TO pairs are not supported for CREATE REL TABLE AS.
-STATEMENT CREATE REL TABLE IF NOT EXISTS Knows3 (FROM Person2 TO Person2) AS MATCH (a:Person2)-[e:Knows2]->(b:Person2) WHERE a.Gender = b.Gender RETURN a.id, b.id;
---- ok
-STATEMENT MATCH (a:Person2)-[e:Knows3]->(b:Person2) RETURN a.fname, b.fname;
---- 2
Alice|Carol
Bob|Dan

-CASE DropTablesReloadWithoutForceCheckpoint
-STATEMENT CALL force_checkpoint_on_close=false;
---- ok
-STATEMENT DROP TABLE studyAt
---- ok
-STATEMENT DROP TABLE workAt
---- ok
-RELOADDB
-STATEMENT DROP TABLE knows
---- ok
