-NAME q37
-COMPARE_RESULT 1
-QUERY MATCH (a:Person)-[r:knows* SHORTEST 1..3]->(b:Person) WHERE a.ID = 94 RETURN COUNT(*)
---- 1
66396
