-NAME q37
-QUERY MATCH (a:Person)-[r:knows* SHORTEST 1..10]->(b:Person) WHERE a.ID = 933 RETURN COUNT(*)
---- 1
356867
