-NAME q38
-COMPARE_RESULT 1
-QUERY MATCH (a:Person)-[r:knows* SHORTEST 1..2]->(b:Person) WHERE a.ID < 10000 RETURN COUNT(*)
---- 1
573677
