-NAME q38
-QUERY MATCH (a:Person)-[r:knows* SHORTEST 1..2]->(b:Person) WHERE a.ID < 1000 RETURN COUNT(*)
---- 1
573677
