-NAME NodeP0
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
5001

-NAME NodeP1
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 1 RETURN b.ID
---- 1
5000

-NAME NodeP5500
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 5500 RETURN b.ID
---- 0

-NAME NodeP43500
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 5500 RETURN COUNT(*)
---- 1
0

-NAME EdgeID
-QUERY MATCH (a:person)-[r:knows]->(b:person) RETURN COUNT(DISTINCT r._id)
---- 1
10001
