-NAME NodeP0
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.id = 0 RETURN COUNT(*)
---- 1
5001

-NAME NodeP1
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.id = 1 RETURN b.id
---- 1
5000

-NAME NodeP5500
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.id = 5500 RETURN b.id
---- 0

-NAME NodeP43500
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.id = 5500 RETURN COUNT(*)
---- 1
0
