-NAME q23
-QUERY MATCH (comment:Comment) RETURN MIN(comment.length)
---- 1
2