-NAME q23
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) RETURN MIN(comment.length)
---- 1
2