-DATASET CSV empty
--

# all created rels have bound node at node group idx 1 so csr node group 0 should be empty
-CASE CopyRelEmptyNodeGroupsReloadDB
-STATEMENT create node table Comment (id int64, creationDate INT64, locationIP STRING, browserUsed STRING, content STRING, length INT32, PRIMARY KEY (id));
---- ok
-STATEMENT create rel table replyOf_Comment (FROM Comment TO Comment, MANY_ONE);
---- ok
# copy single-threaded so we have better control over node offsets
-STATEMENT COPY Comment FROM "${KUZU_ROOT_DIRECTORY}/dataset/ldbc-sf01/Comment.csv"(parallel=false);
---- ok
-STATEMENT MATCH (a:Comment), (b:Comment) WHERE a.id = 1030792523059 AND b.id = 962073046352 CREATE (a)-[:replyOf_Comment]->(b)
---- ok
-RELOADDB
-RELOADDB
-STATEMENT MATCH (a:Comment)-[:replyOf_Comment]->(b:Comment) RETURN a.id, b.id
---- 1
1030792523059|962073046352
