-DATASET CSV tinysnb

--

-CASE InsertMultipleRelsAutoCheckpoint
-STATEMENT CALL checkpoint_threshold=0
---- ok
-STATEMENT CALL auto_checkpoint=true
---- ok
-STATEMENT MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 7 CREATE (a)<-[:knows]-(b)
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID > 6 HINT a JOIN (e JOIN b) RETURN a.ID, b.ID, ID(e)
---- 4
7|8|3:12
7|9|3:13
8|7|3:14
9|7|3:15
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID > 6 HINT (a JOIN e) JOIN b RETURN a.ID, b.ID, ID(e)
---- 4
7|8|3:12
7|9|3:13
8|7|3:14
9|7|3:15

-CASE ViolateRelMultiplicityConstraintInTransaction
-LOG Fwd
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 9 AND b.ID = 10 CREATE (a)-[:marries]->(b)
---- ok
-STATEMENT CREATE (p:person{ID:11})
---- ok
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 11 AND b.ID = 10 CREATE (a)-[:marries]->(b)
---- error
Runtime exception: Node(nodeOffset: 7) has more than one neighbour in table marries in the bwd direction, which violates the rel multiplicity constraint.

# Retry
-STATEMENT MATCH (a:person)-[m:marries]->(b:person) RETURN a.ID, b.ID
---- 3
0|2
3|5
7|8
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 9 AND b.ID = 10 CREATE (a)-[:marries]->(b)
---- ok
-STATEMENT MATCH (a:person)-[m:marries]->(b:person) RETURN a.ID, b.ID
---- 4
0|2
3|5
7|8
9|10

-LOG Bwd
-STATEMENT BEGIN TRANSACTION
---- ok
# shouldn't have rel multiplicity error in fwd direction for MANY_ONE relationship
-STATEMENT MATCH (a:person), (b:organisation) WHERE a.ID = 0 AND b.ID = 4 CREATE (a)-[:workAt]->(b)
---- ok
# there should be an error in the bwd direction for MANY_ONE relationship
-STATEMENT MATCH (a:person), (b:organisation) WHERE a.ID = 0 AND b.ID = 1 CREATE (a)-[:workAt]->(b)
---- error
Runtime exception: Node(nodeOffset: 0) has more than one neighbour in table workAt in the fwd direction, which violates the rel multiplicity constraint.

-STATEMENT MATCH (a:person)-[w:workAt]->(b:organisation) WHERE a.ID = 0 AND b.ID = 4 RETURN *
---- 0
