-DATASET CSV rel-update-tests
-TEST_FWD_ONLY_REL
--

-DEFINE_STATEMENT_BLOCK INSERT_RELS_TO_SMALL_LIST [
-STATEMENT MATCH (a:person),(b:person) WHERE a.ID=1 and b.ID=300 CREATE (a)-[e:knows{length: 300, place: 'this is a long str', tag: ['123', 'good']}]->(b)
---- ok
-STATEMENT MATCH (a:person),(b:person) WHERE a.ID=1 and b.ID=700 CREATE (a)-[e:knows{length: 45, tag: ['123', 'good']}]->(b)
---- ok
-STATEMENT MATCH (a:person),(b:person) WHERE a.ID=1 and b.ID=400 CREATE (a)-[e:knows{length: 34, place: 'short'}]->(b)
---- ok
-STATEMENT MATCH (a:person),(b:person) WHERE a.ID=1 and b.ID=600 CREATE (a)-[e:knows{}]->(b)
---- ok
]

-CASE insertRelsToSmallListCommitNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK INSERT_RELS_TO_SMALL_LIST
-STATEMENT COMMIT
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) where b.ID > 200 AND a.ID = 1 RETURN e.length, e.place, e.tag
---- 4
300|this is a long str|[123,good]
34|short|
45||[123,good]
||
-STATEMENT COMMIT;
---- ok


-CASE insertRelsToSmallListCommitRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK INSERT_RELS_TO_SMALL_LIST
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) where b.ID > 200 AND a.ID = 1 RETURN e.length, e.place, e.tag
---- 4
300|this is a long str|[123,good]
34|short|
45||[123,good]
||
-STATEMENT COMMIT;
---- ok


-CASE insertRelsToSmallListRollbackNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK INSERT_RELS_TO_SMALL_LIST
-STATEMENT Rollback
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) where b.ID > 200 AND a.ID = 1 RETURN e.length, e.place, e.tag
---- 0
-STATEMENT COMMIT;
---- ok


-CASE insertRelsToSmallListRollbackRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK INSERT_RELS_TO_SMALL_LIST
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) where b.ID > 200 AND a.ID = 1 RETURN e.length, e.place, e.tag
---- 0
-STATEMENT COMMIT;
---- ok
