-GROUP CreateRelTest
-DATASET CSV rel-update-tests
--

-CASE smallListBecomesLargeListAfterInsertionCommitNormalExecution
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>small_list_becomes_large_list_after_insertion.cypher
---- ok
-STATEMENT COMMIT
---- ok 
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID = 1 RETURN e.length, e.place, e.tag
---- 1500
<FILE>:small_list_becomes_large_list_after_insertion_commit.txt

-CASE smallListBecomesLargeListAfterInsertionCommitRecovery
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>small_list_becomes_large_list_after_insertion.cypher
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID = 1 RETURN e.length, e.place, e.tag
---- 1500
<FILE>:small_list_becomes_large_list_after_insertion_commit.txt

-CASE smallListBecomesLargeListAfterInsertionRollbackNormalExecution
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>small_list_becomes_large_list_after_insertion.cypher
---- ok
-STATEMENT Rollback
---- ok 
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID = 1 RETURN e.length, e.place, e.tag
---- 51
<FILE>:small_list_becomes_large_list_after_insertion_rollback.txt

-CASE smallListBecomesLargeListAfterInsertionRollbackRecovery
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>small_list_becomes_large_list_after_insertion.cypher
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN WRITE TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID = 1 RETURN e.length, e.place, e.tag
---- 51
<FILE>:small_list_becomes_large_list_after_insertion_rollback.txt
