-GROUP TinySnbDeleteNodeTest
-DATASET CSV tinysnb

--

-CASE DeleteNodeAfterInsertTest
-STATEMENT CREATE (a:person {ID:100, fName:'Xiyang', age:26})
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 100 DELETE a
---- ok
-STATEMENT CREATE (a:person {ID:101})
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 101 RETURN a.ID, a.fName, a.age
---- 1
101||

-CASE MixedDeleteInsertTest
-STATEMENT CREATE (a:organisation {ID:30, mark:3.3})
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 1
|3.300000

-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 DELETE a
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 0

-STATEMENT CREATE (a:organisation {ID:30, orgCode:33})
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 1
33|

-CASE DeleteNodeMultiLabel1
-STATEMENT MATCH (a:person)-[e]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
5
-STATEMENT MATCH (a)-[e]->(b) DELETE e
---- ok
-STATEMENT MATCH (a:person:organisation) WHERE a.ID > 1 AND a.ID < 10 DELETE a
---- ok
-STATEMENT MATCH (a:person:organisation) RETURN a.ID
---- 3
0
1
10
-STATEMENT MATCH (a:person:organisation) DELETE a
---- ok
-STATEMENT MATCH (a:person:organisation) RETURN COUNT(*)
---- 1
0

-CASE RedundantNodeDeletions
-STATEMENT MATCH (a:person {ID: 3})-[e]->() DELETE e
---- ok
-STATEMENT MATCH (a:person {ID: 3})<-[e]-() DELETE e
---- ok
-STATEMENT MATCH (a:person {ID: 3}), (b:person {ID: 3}) DELETE a, b
---- ok
-STATEMENT MATCH (a:person) RETURN a.ID
---- 7
0
2
5
7
8
9
10


-CASE OptionalDelete
-STATEMENT OPTIONAL MATCH (a:person) WHERE a.ID > 100 DELETE a;
---- ok
-STATEMENT MATCH (a:person) RETURN COUNT(*)
---- 1
8
-STATEMENT OPTIONAL MATCH (a) WHERE a.ID > 100 DELETE a;
---- ok
-STATEMENT MATCH (a) RETURN COUNT(*)
---- 1
14

-CASE DeleteNodeWithConnectedRels
-STATEMENT MATCH (a:person {ID: 0}) DELETE a
---- error
Runtime exception: Deleted nodes has connected edges in the forward direction.
-STATEMENT MATCH (o:organisation {ID: 6}) DELETE o
---- error
Runtime exception: Deleted nodes has connected edges in the backward direction.

-CASE SingleLabelDetachDeleteNode
-STATEMENT MATCH (a:person)-[e]->() RETURN COUNT(*)
---- 1
30
-STATEMENT MATCH (a:person {ID: 0}) DETACH DELETE a
---- ok
-STATEMENT MATCH (a:person {ID: 0}) RETURN a
---- 0
-STATEMENT MATCH (a:person)-[e]->() RETURN COUNT(*)
---- 1
21

-CASE MultiLabelDetachDeleteNode
-STATEMENT MATCH (a)-[e]->(b) RETURN COUNT(*)
---- 1
30
-STATEMENT MATCH (a) DETACH DELETE a;
---- ok
-STATEMENT MATCH (a) RETURN COUNT(*)
---- 1
0
-STATEMENT MATCH (a)-[e]->(b) RETURN COUNT(*)
---- 1
0

-CASE OptionalDetachDeleteNode
-STATEMENT OPTIONAL MATCH (a:person) WHERE a.ID > 100 DETACH DELETE a;
---- ok
-STATEMENT MATCH (a:person) RETURN COUNT(*)
---- 1
8
