-DATASET CSV tinysnb

--

-CASE Merge1
-STATEMENT MERGE (:person {ID:0})
---- ok
-STATEMENT MATCH (a:person) RETURN COUNT(*)
---- 1
8
-STATEMENT MATCH (a:person) WHERE a.ID = 0 RETURN a.fName, a.age
---- 1
Alice|35
-STATEMENT MERGE (a:person {ID:0}) ON MATCH SET a.fName = 'a', a.age = 1
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID < 3 RETURN a.ID, a.fName, a.age
---- 2
0|a|1
2|Bob|30


-CASE Merge2
-STATEMENT MERGE (:person {ID:1})
---- ok
-STATEMENT MATCH (a:person) RETURN COUNT(*)
---- 1
9
-STATEMENT MATCH (a:person) WHERE a.ID < 2 RETURN a.ID, a.fName, a.age
---- 2
0|Alice|35
1||
-STATEMENT MERGE (:person {ID:1, age:10})
---- error
Runtime exception: Found duplicated primary key value 1, which violates the uniqueness constraint of the primary key column.
-STATEMENT MERGE (a:person {ID:11, fName:'bb', age:10})
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 11 RETURN a.ID, a.fName, a.age
---- 1
11|bb|10
-STATEMENT MERGE (a:person {ID:11, fName:'bb', age:10}) ON MATCH SET a.age = 20, a.fName = 'aaaa'
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 11 RETURN a.ID, a.fName, a.age
---- 1
11|aaaa|20
-STATEMENT MERGE (a:person {ID:12, fName:'bb', age:10}) ON CREATE SET a.age = 20, a.fName = 'aaaa'
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 12 RETURN a.ID, a.fName, a.age
---- 1
12|aaaa|20


-CASE Merge3
-STATEMENT MATCH (a:person) WHERE a.ID < 6 MERGE (b:person {ID: a.ID + 1}) RETURN b.ID;
---- 4
1
3
4
6
-STATEMENT MATCH (a:person) RETURN COUNT(*);
---- 1
11

-CASE MergeDuplicatedKey
-STATEMENT CREATE NODE TABLE user (ID int64, primary key(ID))
---- ok
-STATEMENT MATCH (a:person) with a.ID % 4 as result, a.age as age MERGE (u:user {ID: result}) RETURN u.ID, age
---- 8
0|35
2|30
3|45
1|20
3|20
0|25
1|40
2|83
-STATEMENT MATCH (a:user) RETURN a.ID
---- 4
0
1
2
3
-STATEMENT MATCH (a:person) with a.ID as id MERGE (u:user {ID: 10}) RETURN u.ID, id
---- error
Runtime exception: Empty key in merge clause is not supported yet.
-STATEMENT CREATE NODE TABLE user1 (ID int64, name string, primary key(ID))
---- ok
-STATEMENT MATCH (a:person) with a.ID % 7 as result, a.fName as name MERGE (u:user1 {ID: result}) ON MATCH SET u.name = 'match: ' + name ON CREATE SET u.name = 'create: ' + name RETURN u.ID, u.name
---- 8
0|create: Alice
0|match: Elizabeth
1|create: Farooq
2|create: Bob
2|match: Greg
3|create: Carol
3|match: Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
5|create: Dan
-STATEMENT MATCH (a:user1) RETURN COUNT(*);
---- 1
5
-STATEMENT CREATE REL TABLE knows2 (FROM person TO person, comment STRING)
---- ok
-STATEMENT MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 0 UNWIND [1,2] AS x MERGE (a)-[e:knows2 {comment: 'h'}]->(b) RETURN e.comment
---- 6
h
h
h
h
h
h
-STATEMENT MATCH (a:person)-[:knows2]->(b:person) RETURN COUNT(*);
---- 1
3
