-DATASET CSV rel-update-tests
-TEST_FWD_ONLY_REL
--

-CASE updateEachElementOfSmallListCommitNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE>:update_each_element_of_small_list.cypher
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e:knows]->(p1:person) WHERE p0.ID = 1 RETURN e.length
---- 51
<FILE>:update_each_element_of_small_list_commit.txt
-STATEMENT COMMIT;
---- ok


-CASE updateEachElementOfSmallListCommitRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE>:update_each_element_of_small_list.cypher
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e:knows]->(p1:person) WHERE p0.ID = 1 RETURN e.length
---- 51
<FILE>:update_each_element_of_small_list_commit.txt
-STATEMENT COMMIT;
---- ok


-CASE updateEachElementOfSmallListRollbackNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE>:update_each_element_of_small_list.cypher
---- ok
-STATEMENT Rollback
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e:knows]->(p1:person) WHERE p0.ID = 1 RETURN e.length
---- 51
<FILE>:update_each_element_of_small_list_rollback.txt
-STATEMENT COMMIT;
---- ok


-CASE updateEachElementOfSmallListRollbackRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE>:update_each_element_of_small_list.cypher
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e:knows]->(p1:person) WHERE p0.ID = 1 RETURN e.length
---- 51
<FILE>:update_each_element_of_small_list_rollback.txt
-STATEMENT COMMIT;
---- ok
