-DATASET CSV rel-update-tests
-TEST_FWD_ONLY_REL
--

-CASE updateRelsTwoHopCommitNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
300|
-STATEMENT COMMIT;
---- ok


-CASE updateRelsTwoHopCommitRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
300|
-STATEMENT COMMIT;
---- ok


-CASE updateRelsTwoHopRollbackNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT Rollback
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
0|1145
-STATEMENT COMMIT;
---- ok


-CASE updateRelsTwoHopRollbackRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
0|1145
-STATEMENT COMMIT;
---- ok
