-DATASET CSV rel-update-tests
-TEST_FWD_ONLY_REL
--

-DEFINE_STATEMENT_BLOCK UPDATE_ONE_TO_ONE_REL_TABLE [
-STATEMENT MATCH (p1:animal)-[e:hasOwner]->(p2:person) WHERE p1.ID = 2 AND p2.ID = 52 SET e.place='kuzu'
---- ok
-STATEMENT MATCH (p1:animal)-[e:hasOwner]->(p2:person) WHERE p1.ID = 4 AND p2.ID = 54 SET e.place='db'
---- ok
-STATEMENT MATCH (p1:animal)-[e:hasOwner]->(p2:person) WHERE p1.ID = 8 AND p2.ID = 58 SET e.place=null
---- ok
]

-CASE updateOneToOneRelTableCommitNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK UPDATE_ONE_TO_ONE_REL_TABLE
-STATEMENT COMMIT
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:animal)-[e:hasOwner]->(:person) RETURN e.place
---- 10

1989
1991
1993
199419941994
1995
1997
1999
db
kuzu
-STATEMENT COMMIT;
---- ok

-CASE updateOneToOneRelTableCommitRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK UPDATE_ONE_TO_ONE_REL_TABLE
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:animal)-[e:hasOwner]->(:person) RETURN e.place
---- 10

1989
1991
1993
199419941994
1995
1997
1999
db
kuzu
-STATEMENT COMMIT;
---- ok

-CASE updateOneToOneRelTableRollbackNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK UPDATE_ONE_TO_ONE_REL_TABLE
-STATEMENT Rollback
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:animal)-[e:hasOwner]->(:person) RETURN e.place
---- 10
1989
1991
199219921992
1993
199419941994
1995
199619961996
1997
199819981998
1999
-STATEMENT COMMIT;
---- ok


-CASE updateOneToOneRelTableRollbackRecovery
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-INSERT_STATEMENT_BLOCK UPDATE_ONE_TO_ONE_REL_TABLE
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:animal)-[e:hasOwner]->(:person) RETURN e.place
---- 10
1989
1991
199219921992
1993
199419941994
1995
199619961996
1997
199819981998
1999
-STATEMENT COMMIT;
---- ok
