-DATASET CSV empty
--

-CASE Simple
-STATEMENT CREATE NODE TABLE tab(intkey INT64 PRIMARY KEY, value UINT128);
---- ok

-STATEMENT CREATE (n1:tab {intkey: 1, value: 42}) RETURN n1.*;
---- 1
1|42
-STATEMENT CREATE (n2:tab {intkey: 98764, value: 157782}) RETURN n2.*;
---- 1
98764|157782

-STATEMENT MATCH (z:tab) WHERE z.intkey = 98764 SET z.value = 170141183460469231731687303715884105727 RETURN z.value + CAST(1 AS UINT128);
---- 1
170141183460469231731687303715884105728

-STATEMENT MATCH (z:tab) SET z.value = z.value / CAST(2 AS UINT128) RETURN z.*;
---- 2
1|21
98764|85070591730234615865843651857942052863

-STATEMENT CREATE(n3:tab {intkey: 2, value: CAST(170141183460469231731687303715884105727 AS UINT128) * CAST(2 AS UINT128) + CAST(1 AS UINT128)});
---- ok
-STATEMENT CREATE(n4:tab {intkey: 3, value: 340282366920938463463374607431768211455});
---- ok
-STATEMENT MATCH (z:tab) WHERE z.value = 340282366920938463463374607431768211455 RETURN z.*;
---- 2
2|340282366920938463463374607431768211455
3|340282366920938463463374607431768211455

-CASE Overflow
-STATEMENT CREATE NODE TABLE tab(intkey INT64 PRIMARY KEY, value UINT128);
---- ok
-STATEMENT CREATE(n1:tab {intkey: 1, value: 340282366920938463463374607431768211455});
---- ok
-STATEMENT CREATE(n2:tab {intkey: 2, value: 340282366920938463463374607431768211455});
---- ok
-STATEMENT CREATE(n3:tab {intkey: 3, value: 340282366920938463463374607431768211456});
---- error
Conversion exception: Cast failed. Could not convert "340282366920938463463374607431768211456" to UINT128.
-STATEMENT MATCH (z:tab) WHERE z.value = 340282366920938463463374607431768211455 RETURN z.value + CAST(1 AS UINT128);
---- error
Overflow exception: UINT128 is out of range: cannot add.
-STATEMENT MATCH (z:tab) WHERE z.value = 340282366920938463463374607431768211455 RETURN z.value - CAST(1 as uint128);
---- 2
340282366920938463463374607431768211454
340282366920938463463374607431768211454
-STATEMENT CREATE(n4:tab {intkey: -1, value: 0}) RETURN n4.*;
---- 1
-1|0
-STATEMENT MATCH (z:tab) WHERE z.value = 0 RETURN z.value - CAST(1 AS UINT128);
---- error
Overflow exception: UINT128 is out of range: cannot subtract.
-STATEMENT CREATE (n5:tab {intkey: -2, value: -3});
---- error
Overflow exception: Cannot cast negative value to UINT128.

-CASE Comparisons
-STATEMENT CREATE NODE TABLE tab(intkey INT64 PRIMARY KEY, value UINT128);
---- ok
-STATEMENT CREATE(n1:tab {intkey: 1, value: 42}) RETURN n1.*;
---- 1
1|42
-STATEMENT CREATE(n2:tab {intkey: 172804, value: 170141183460469231731687303715884105727}) RETURN n2.*;
---- 1
172804|170141183460469231731687303715884105727
-STATEMENT CREATE(n3:tab {intkey: 2, value: 190079603397242969825244409620089274368}) RETURN n3.*;
---- 1
2|190079603397242969825244409620089274368
-STATEMENT CREATE(n4:tab {intkey: 3, value: 340282366920938463463374607431768211455}) RETURN n4.*;
---- 1
3|340282366920938463463374607431768211455
-STATEMENT CREATE(n5:tab {intkey: -92, value: 0}) RETURN n5.*;
---- 1
-92|0

-STATEMENT MATCH (z:tab) WHERE z.value > 0 RETURN z.value;
---- 4
42
170141183460469231731687303715884105727
190079603397242969825244409620089274368
340282366920938463463374607431768211455
-STATEMENT MATCH (z:tab) WHERE z.value >= 340282366920938463463374607431768211455 RETURN z.value;
---- 1
340282366920938463463374607431768211455
-STATEMENT CREATE(n6:tab {intkey: 5, value: 340282366920938463463374607431768211455});
---- ok
-STATEMENT MATCH (z:tab) WHERE z.value >= 340282366920938463463374607431768211455 RETURN z.intkey;
---- 2
3
5
-STATEMENT MATCH (z:tab) WHERE z.value < 340282366920938463463374607431768211455 RETURN z.value;
---- 4
42
170141183460469231731687303715884105727
190079603397242969825244409620089274368
0

-CASE OrderBy
-STATEMENT CREATE NODE TABLE tab(intkey INT64 PRIMARY KEY, value UINT128);
---- ok
-STATEMENT CREATE(n1:tab {intkey: 1, value: 42}) RETURN n1.*;
---- 1
1|42
-STATEMENT CREATE(n2:tab {intkey: 172804, value: 170141183460469231731687303715884105727}) RETURN n2.*;
---- 1
172804|170141183460469231731687303715884105727
-STATEMENT CREATE(n3:tab {intkey: 2, value: 190079603397242969825244409620089274368}) RETURN n3.*;
---- 1
2|190079603397242969825244409620089274368
-STATEMENT CREATE(n4:tab {intkey: 3, value: 340282366920938463463374607431768211455}) RETURN n4.*;
---- 1
3|340282366920938463463374607431768211455
-STATEMENT CREATE(n5:tab {intkey: -92, value: 0}) RETURN n5.*;
---- 1
-92|0
-STATEMENT CREATE(n6:tab {intkey: 5, value: 340282366920938463463374607431768211455}) RETURN n6.*;
---- 1
5|340282366920938463463374607431768211455

-STATEMENT MATCH (z:tab) RETURN z.* ORDER BY z.value, z.intkey;
---- 6
-92|0
1|42
172804|170141183460469231731687303715884105727
2|190079603397242969825244409620089274368
3|340282366920938463463374607431768211455
5|340282366920938463463374607431768211455
-STATEMENT MATCH (z:tab) RETURN z.* ORDER BY z.value DESC, z.intkey ASC;
---- 6
3|340282366920938463463374607431768211455
5|340282366920938463463374607431768211455
2|190079603397242969825244409620089274368
172804|170141183460469231731687303715884105727
1|42
-92|0

-CASE AggregateFunctions
-STATEMENT CREATE NODE TABLE tab(intkey INT64 PRIMARY KEY, value UINT128);
---- ok
-STATEMENT CREATE (x:tab {intkey: 0, value: 5});
---- ok
-STATEMENT CREATE (x:tab {intkey: 1, value: 190});
---- ok
-STATEMENT CREATE (x:tab {intkey: 2, value: 170141183460469231731687303715884105727});
---- ok

-STATEMENT MATCH (z:tab) RETURN z.*;
---- 3
0|5
1|190
2|170141183460469231731687303715884105727
-STATEMENT MATCH (z:tab) RETURN sum(z.value);
---- 1
170141183460469231731687303715884105922
-STATEMENT MATCH (z:tab) RETURN avg(z.value);
---- 1
56713727820156407428984779325531226112.000000
-STATEMENT MATCH (z:tab) RETURN abs(z.value);
---- 3
5
190
170141183460469231731687303715884105727
-STATEMENT MATCH (z:tab) RETURN min(z.value);
---- 1
5
-STATEMENT MATCH (z:tab) RETURN max(z.value);
---- 1
170141183460469231731687303715884105727
-STATEMENT MATCH (z:tab) RETURN floor(z.value);
---- 3
5
190
170141183460469231731687303715884105727
-STATEMENT MATCH (z:tab) RETURN ceil(z.value);
---- 3
5
190
170141183460469231731687303715884105727
-STATEMENT MATCH (z:tab) RETURN collect(z.value);
---- 1
[5,190,170141183460469231731687303715884105727]
-STATEMENT MATCH (z:tab) RETURN count(z.value);
---- 1
3
-STATEMENT MATCH (z:tab) WHERE z.value < 200 RETURN count(z.value);
---- 1
2
-STATEMENT MATCH (z:tab) RETURN z.value / CAST(16 AS UINT128);
---- 3
0
11
10633823966279326983230456482242756607
-STATEMENT MATCH (z:tab) RETURN z.value % CAST(2 AS UINT128);
---- 3
1
0
1
-STATEMENT MATCH (z:tab) WHERE z.value % CAST(2 AS UINT128) = 1 AND z.value < 1000 RETURN z.value;
---- 1
5
