-DATASET CSV tinysnb
# We currently don't support list lambda functions if the list size if larger than the vector capacity
-SKIP_VECTOR_CAPACITY_TESTS
--

-CASE ListReduce

-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN a.ID, LIST_REDUCE([1,2,3], (x, y) -> x + y + a.ID)
---- 4
0|6
2|10
3|12
5|16
-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN a.ID, a.workedHours, LIST_REDUCE(a.workedHours, (x, y) -> x + y + a.ID)
---- 4
0|[10,5]|15
2|[12,8]|22
3|[4,5]|12
5|[1,9]|15
-STATEMENT MATCH (a:person)-[:knows]->(b) WHERE a.ID = 0 RETURN a.ID, b.ID, LIST_REDUCE([1,2,3], (x, y) -> x + y + a.ID + b.ID)
---- 3
0|2|10
0|3|12
0|5|16

-STATEMENT RETURN LIST_REDUCE([5,28,92], (x, y) -> x + y)
---- 1
125
-STATEMENT RETURN LIST_REDUCE(['Kuzu ', 'is ', 'awesome:', 'long long string'], (x, y) -> upper(x) + upper(y))
---- 1
KUZU IS AWESOME:LONG LONG STRING
-STATEMENT MATCH (a:person) RETURN LIST_REDUCE(a.workedHours, (x, y) -> x - y)
---- 8
5
4
-1
-8
2
-19
1
-38
-STATEMENT MATCH (a:person) RETURN LIST_REDUCE([], (x, y) -> x - y)
---- error
Runtime exception: Cannot execute list_reduce on an empty list.
-STATEMENT RETURN LIST_REDUCE([null, 52, 223], (x, y) -> x + y)
---- 1

-STATEMENT RETURN LIST_REDUCE(['a:', 'b:', 'c:', 'd:'], (x, y) -> y+x)
---- 1
d:c:b:a:
-STATEMENT RETURN LIST_REDUCE(['a:', 'b:', 'c:', 'd:'], (x, y) -> x+y+x)
---- 1
a:b:a:c:a:b:a:d:a:b:a:c:a:b:a:
-STATEMENT RETURN LIST_REDUCE(['a:', 'b:', 'c:', 'd:'], (x, y) -> y+x+y)
---- 1
d:c:b:a:b:c:d:
-STATEMENT unwind range(1, 5000) as t with collect(t) as lst return list_reduce(lst, (x, y) -> y+x+y);
---- error(regex)
Runtime exception: Lists with size greater than: [0-9]+ is not supported in list lambda functions.
