-DATASET CSV tinysnb
# We currently don't support list lambda functions if the list size if larger than the vector capacity
-SKIP_VECTOR_CAPACITY_TESTS
--

-CASE ListFilter

-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN a.age, LIST_FILTER([1,2,3], x->x * 10 < a.age)
---- 4
20|[1]
30|[1,2]
35|[1,2,3]
45|[1,2,3]
-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN a.ID, a.workedHours, LIST_FILTER(a.workedHours, x->x > a.ID)
---- 4
0|[10,5]|[10,5]
2|[12,8]|[12,8]
3|[4,5]|[4,5]
5|[1,9]|[9]
-STATEMENT MATCH (a:person)-[:knows]->(b) WHERE a.ID = 0 RETURN a.ID, b.ID, LIST_FILTER([1,2,3], x->x = a.ID + b.ID)
---- 3
0|2|[2]
0|3|[3]
0|5|[]

-STATEMENT RETURN LIST_FILTER([5,28,92], x-> x + 4 >= 24)
---- 1
[28,92]
-STATEMENT RETURN LIST_FILTER(['Duckdb', 'Alice', 'kuzu', 'long long string'], x -> size(x) > 4)
---- 1
[Duckdb,Alice,long long string]
-STATEMENT MATCH (a:person) RETURN LIST_FILTER(a.workedHours, x->x > 5)
---- 8
[10]
[12,8]
[]
[9]
[]
[6,7]
[]
[10,11,12,6,7]
-STATEMENT MATCH (a:person) RETURN LIST_FILTER(a.courseScoresPerTerm, x->size(x))
---- error
Binder exception: LIST_FILTER requires the result type of lambda expression be BOOL.
-STATEMENT RETURN LIST_FILTER([], x->x>5)
---- 1
[]
-STATEMENT RETURN LIST_FILTER([null, 5, 7, 3, null, 10], x->x>=5)
---- 1
[5,7,10]
-STATEMENT RETURN list_filter(LIST_FILTER([1,2,3,4,5], x->x>=1), y->y<=2)
---- 1
[1,2]
-STATEMENT RETURN list_filter([5,2,3], x->true)
---- 1
[5,2,3]
-STATEMENT RETURN list_filter([1,0,3], x->false)
---- 1
[]
-STATEMENT RETURN list_filter([], x->false)
---- 1
[]
-STATEMENT MATCH (p:person) RETURN list_filter(p.usedNames, x->true)
---- 8
[Ad,De,Hi,Kye,Orlan]
[Aida]
[Bobby]
[Carmen,Fred]
[Ein]
[Fesdwe]
[Grad]
[Wolfeschlegelstein,Daniel]
-STATEMENT RETURN LIST_FILTER(['Duckdb', 'Alice', 'kuzu', 'long long string'], x -> size(x) > 4 and size(x) < 6)
---- 1
[Alice]
-STATEMENT MATCH (a:person) RETURN LIST_FILTER(a.workedHours, x->x > 5 and x<=10)
---- 8
[10]
[8]
[]
[9]
[]
[6,7]
[]
[10,6,7]
-STATEMENT unwind range(1, 5000) as t with collect(t) as lst return list_filter(lst, x->x > 3);
---- error(regex)
Runtime exception: Lists with size greater than: [0-9]+ is not supported in list lambda functions.
