-DATASET CSV tinysnb
# We currently don't support list lambda functions if the list size if larger than the vector capacity
-SKIP_VECTOR_CAPACITY_TESTS
--

-CASE ListTransform

-STATEMENT MATCH p = (a:person)-[:knows*1..2]->(b) WHERE a.ID = 0 AND b.ID=2 RETURN LIST_TRANSFORM(rels(p), x->label(x)), LIST_TRANSFORM(nodes(p), x->label(x))
---- 3
[knows,knows]|[person,person,person]
[knows,knows]|[person,person,person]
[knows]|[person,person]

-STATEMENT RETURN list_transform(list_transform([1,3,2], x->x+5), y->y+3)
---- 1
[9,11,10]
-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN a.age, LIST_TRANSFORM([1,2,3], x->x + a.age)
---- 4
20|[21,22,23]
30|[31,32,33]
35|[36,37,38]
45|[46,47,48]
-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN a.ID, a.workedHours, LIST_TRANSFORM(a.workedHours, x->x + a.ID)
---- 4
0|[10,5]|[10,5]
2|[12,8]|[14,10]
3|[4,5]|[7,8]
5|[1,9]|[6,14]
-STATEMENT MATCH (a:person)-[:knows]->(b) WHERE a.ID = 0 RETURN a.ID, b.ID, LIST_TRANSFORM([1,2,3], x->x + a.ID + b.ID)
---- 3
0|2|[3,4,5]
0|3|[4,5,6]
0|5|[6,7,8]

-LOG ListTransform
-STATEMENT RETURN LIST_TRANSFORM([5,28,92], x->(CASE WHEN x < 10 THEN 0 ELSE 1 END))
---- 1
[0,1,1]
-STATEMENT RETURN list_extract([5,28,92], x->x+ 10)
---- error
Binder exception: LIST_EXTRACT does not support lambda input.
-STATEMENT RETURN LIST_TRANSFORM([5,28,92], 1)
---- error
Binder exception: The second argument of LIST_TRANSFORM should be a lambda expression but got LITERAL.

-STATEMENT RETURN LIST_TRANSFORM([5,28,92], x->x+ 10)
---- 1
[15,38,102]
-STATEMENT MATCH (a:person) RETURN LIST_TRANSFORM(a.workedHours, x->x+ 2)
---- 8
[12,7]
[14,10]
[6,7]
[3,11]
[4]
[5,6,7,8,9]
[3]
[12,13,14,5,6,7,8,9]
-STATEMENT RETURN LIST_TRANSFORM([20,56], x->(x * 2 + 7) * 10)
---- 1
[470,1190]
-STATEMENT RETURN LIST_TRANSFORM(['KUZU', 'DUCKDB', 'NEO4J'], x-> concat(x, 'test'))
---- 1
[KUZUtest,DUCKDBtest,NEO4Jtest]
-STATEMENT RETURN LIST_TRANSFORM(['KUZU', 'DUCKDB', 'NEO4J'], x-> size(x))
---- 1
[4,6,5]
-STATEMENT RETURN LIST_TRANSFORM([], x->x+5)
---- 1
[]
-STATEMENT RETURN LIST_TRANSFORM([null, 5, 22, null, 17], x->x+5)
---- 1
[,10,27,,22]
-STATEMENT RETURN LIST_TRANSFORM([20, 50, 3], x->2)
---- 1
[2,2,2]
-STATEMENT MATCH (p:person) RETURN LIST_TRANSFORM(p.usedNames, x->500)
---- 8
[500]
[500]
[500]
[500]
[500]
[500]
[500]
[500]
-STATEMENT MATCH (a:person) RETURN LIST_TRANSFORM(a.workedHours, x->x+x+2)
---- 8
[22,12]
[26,18]
[10,12]
[4,20]
[6]
[8,10,12,14,16]
[4]
[22,24,26,8,10,12,14,16]
-STATEMENT RETURN LIST_TRANSFORM(['KUZU', 'DUCKDB', 'NEO4J'], x-> size(x)+size(x))
---- 1
[8,12,10]
-STATEMENT unwind range(1, 5000) as t with collect(t) as lst return list_transform(lst, x->x+1);
---- error(regex)
Runtime exception: Lists with size greater than: [0-9]+ is not supported in list lambda functions.
