-GROUP DeleteRelTest
-DATASET CSV rel-update-tests
--

-CASE deleteRelsFromLargeListCommitNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>delete_rels_from_large_list.cypher
---- ok
-STATEMENT COMMIT
---- ok 
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID  = 0 RETURN e.length
---- 2200
<FILE>:delete_rels_from_large_list_commit.txt


-CASE deleteRelsFromLargeListCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>delete_rels_from_large_list.cypher
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID  = 0 RETURN e.length
---- 2200
<FILE>:delete_rels_from_large_list_commit.txt

-CASE deleteRelsFromLargeListRollbackNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>delete_rels_from_large_list.cypher
---- ok
-STATEMENT Rollback
---- ok 
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID  = 0 RETURN e.length
---- 2300
<FILE>:delete_rels.txt

-CASE deleteRelsFromLargeListRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-BATCH_STATEMENTS <FILE:>delete_rels_from_large_list.cypher
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID  = 0 RETURN e.length
---- 2300
<FILE>:delete_rels.txt
