-DATASET CSV rel-update-tests
--

-CASE deleteAllRelsFromLargeListCommitNormalExecution
-TEST_FWD_ONLY_REL
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:person)-[e:knows]->(:person) DELETE e
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID = 0 RETURN e.length
---- 0
-STATEMENT COMMIT;
---- ok


-CASE deleteAllRelsFromLargeListCommitRecovery
-TEST_FWD_ONLY_REL
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:person)-[e:knows]->(:person) DELETE e
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID = 0 RETURN e.length
---- 0
-STATEMENT COMMIT;
---- ok


-CASE deleteAllRelsFromLargeListRollbackNormalExecution
-TEST_FWD_ONLY_REL
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:person)-[e:knows]->(:person) DELETE e
---- ok
-STATEMENT Rollback
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID = 0 RETURN e.length
---- 2300
<FILE>:delete_rels.txt
-STATEMENT COMMIT;
---- ok


-CASE deleteAllRelsFromLargeListRollbackRecovery
-TEST_FWD_ONLY_REL
-STATEMENT CALL auto_checkpoint=false
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (:person)-[e:knows]->(:person) DELETE e
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID = 0 RETURN e.length
---- 2300
<FILE>:delete_rels.txt
-STATEMENT COMMIT;
---- ok

-CASE detachDeleteNodeWithLargeList
-STATEMENT MATCH (p:person)-[e:knows]->(:person) RETURN COUNT(*);
---- 1
2351
-STATEMENT MATCH (p:person) WHERE p.ID = 0 DETACH DELETE p;
---- ok
-STATEMENT MATCH (p:person) WHERE p.ID = 0 RETURN p;
---- 0
-STATEMENT MATCH (p:person)-[e:knows]->(b:person) HINT (p JOIN e) JOIN b RETURN COUNT(*);
---- 1
50

-CASE detachDeleteMultiLabelNodeWithLargeList
-STATEMENT MATCH (p:person)-[e:knows]->(:person) RETURN COUNT(*);
---- 1
2351
-STATEMENT MATCH (p) WHERE p.ID = 0 OR p.ID = 1 DETACH DELETE p;
---- ok
-STATEMENT MATCH (p:person) WHERE p.ID = 0 RETURN p;
---- 0
-STATEMENT MATCH (a:animal) WHERE a.ID = 0 RETURN a;
---- 0
-STATEMENT MATCH (p:person)-[e:knows]->(b:person) HINT (p JOIN e) JOIN b RETURN COUNT(*);
---- 1
0
-STATEMENT MATCH (a:animal)-[e:hasOwner]->(b:person) HINT (a JOIN e) JOIN b RETURN COUNT(*);
---- 1
9
