-GROUP DeleteRelTest_deleteLargeNumRelsFromLargeList
-DATASET CSV rel-update-tests
--

-CASE deleteLargeNumRelsFromLargeListCommitNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p1:person)-[e:knows]->(p2:person) WHERE p1.ID = 0 AND p2.ID >= 10 delete e;
---- ok
-STATEMENT COMMIT
---- ok 
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p1:person)-[e:knows]->(p2:person) WHERE p1.ID = 0 return e.length
---- 9
1
2
3
4
5
6
7
8
9

-CASE deleteLargeNumRelsFromLargeListCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p1:person)-[e:knows]->(p2:person) WHERE p1.ID = 0 AND p2.ID >= 10 delete e;
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p1:person)-[e:knows]->(p2:person) WHERE p1.ID = 0 return e.length
---- 9
1
2
3
4
5
6
7
8
9

-CASE deleteLargeNumRelsFromLargeListRollbackNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p1:person)-[e:knows]->(p2:person) WHERE p1.ID = 0 AND p2.ID >= 10 delete e;
---- ok
-STATEMENT Rollback
---- ok 
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID = 0 RETURN e.length
---- 2300
<FILE>:delete_rels.txt


-CASE deleteLargeNumRelsFromLargeListRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p1:person)-[e:knows]->(p2:person) WHERE p1.ID = 0 AND p2.ID >= 10 delete e;
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p:person)-[e:knows]->(:person) WHERE p.ID = 0 RETURN e.length
---- 2300
<FILE>:delete_rels.txt
