# description: functions test

-NAME ListCreate1
-QUERY MATCH (a:person) RETURN [a.age + 1, a.age * 2], [a.eyeSight], [a.isStudent AND a.isWorker], [a.birthdate], [a.registerTime], [a.lastJobDuration]
---- 8
[21,40]|[4.700000]|[False]|[1980-10-26]|[1976-12-23 11:21:42]|[48:24:11]
[21,40]|[4.800000]|[False]|[1950-07-23]|[2031-11-30 12:25:30]|[10 years 5 months 13:00:00.000024]
[26,50]|[4.500000]|[False]|[1980-10-26]|[1972-07-31 13:22:30.678559]|[00:18:00.024]
[31,60]|[5.100000]|[False]|[1900-01-01]|[2008-11-03 13:25:30.000526]|[10 years 5 months 13:00:00.000024]
[36,70]|[5.000000]|[False]|[1900-01-01]|[2011-08-20 11:25:30]|[3 years 2 days 13:02:00]
[41,80]|[4.900000]|[False]|[1980-10-26]|[1976-12-23 11:21:42]|[10 years 5 months 13:00:00.000024]
[46,90]|[5.000000]|[False]|[1940-06-22]|[1911-08-20 02:32:21]|[48:24:11]
[84,166]|[4.900000]|[False]|[1990-11-27]|[2023-02-21 13:25:30]|[3 years 2 days 13:02:00]

-NAME ListCreate2
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN [a.age, b.age]
---- 14
[20,25]
[20,30]
[20,35]
[20,40]
[20,45]
[30,20]
[30,35]
[30,45]
[35,20]
[35,30]
[35,45]
[45,20]
[45,30]
[45,35]
