# description: limit

-NAME LimitTest1
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.fName LIMIT 2
---- 2
Alice
Bob

-NAME LimitTest2
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.fName LIMIT 10
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
