# description: limit

-NAME BasicLimitTest1
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.fName LIMIT 2
---- 2
Alice
Bob

-NAME BasicLimitTest2
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.fName LIMIT 10
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-NAME KnowsTwoHopLimitTest
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(:person)-[:knows]->(b:person) WHERE a.age=35 RETURN b.fName LIMIT 1
---- 1
Alice

-NAME KnowsOneHopWithLimitTest1
-COMPARE_RESULT 1
-QUERY MATCH (a:person) WHERE a.age>20 WITH a LIMIT 1 MATCH (a)-[e:knows]->(b:person) RETURN b.fName
---- 3
Bob
Carol
Dan

-NAME KnowsOneHopWithLimitTest2
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.age=35 WITH b LIMIT 1 RETURN b.fName
---- 1
Bob
