# description: projections

-NAME AbsFunctionTest1
-COMPARE_RESULT 1
-QUERY MATCH (a:organisation) RETURN abs(a.score)
---- 3
100
2
7

-NAME AbsFunctionTest2
-COMPARE_RESULT 1
-QUERY MATCH (a:organisation) RETURN abs(a.unstrNumericProp)
---- 3

12.500000
3.100000

-NAME PersonNodesTestUnstructuredProperty
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.id,a.unstrDateProp1
---- 8
0|1900-01-01
10|
2|1950-01-01
3|1950-01-01
5|
7|
8|
9|

-NAME PersonNodesTestString
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.fName
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-NAME PersonNodesTestInt
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.age
---- 8
35
30
45
20
20
25
40
83

-NAME PersonNodesTestBoolean
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.isStudent
---- 8
True
True
False
False
False
True
False
False

-NAME PersonNodesTestDouble
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.eyeSight
---- 8
5.000000
5.100000
5.000000
4.800000
4.700000
4.500000
4.900000
4.900000

-NAME PersonNodesTestDate
-COMPARE_RESULT 1
-QUERY MATCH (a:person) RETURN a.birthdate
---- 8
1900-01-01
1900-01-01
1940-06-22
1950-07-23
1980-10-26
1980-10-26
1980-10-26
1990-11-27

-NAME KnowsRelTestDate
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN e.date
---- 14
2021-06-30
2021-06-30
2021-06-30
2021-06-30
1950-05-14
1950-05-14
2021-06-30
1950-05-14
2000-01-01
2021-06-30
1950-05-14
2000-01-01
1905-12-12
1905-12-12

-NAME KnowsOneHopTest1
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE b.age=20 RETURN b.age
---- 3
20
20
20

-NAME KnowsOneHopTest2
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE b.age=20 RETURN b.age * 2
---- 3
40
40
40

-NAME KnowsOneHopTest2
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.age>20 RETURN b.fName
---- 9
Alice
Alice
Bob
Bob
Carol
Carol
Dan
Dan
Dan

-NAME KnowsTwoHopTest1
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(:person)-[:knows]->(b:person) WHERE b.age>40 RETURN b.age
---- 9
45
45
45
45
45
45
45
45
45

-NAME KnowsTwoHopTest2
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(:person)-[:knows]->(b:person) WHERE a.age>b.age+10 RETURN a.age, b.age
---- 6
35|20
35|20
45|20
45|20
45|30
45|30

-NAME KnowsTwoHopTest3
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) WHERE a.age>c.age+10 RETURN a.age, b.fName, c.age
---- 6
35|Bob|20
35|Carol|20
45|Alice|20
45|Alice|30
45|Bob|20
45|Dan|30

-NAME KnowsTwoHopTest4
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN a.fName, b.fName
---- 36
Alice|Bob
Alice|Bob
Alice|Bob
Alice|Carol
Alice|Carol
Alice|Carol
Alice|Dan
Alice|Dan
Alice|Dan
Bob|Alice
Bob|Alice
Bob|Alice
Bob|Carol
Bob|Carol
Bob|Carol
Bob|Dan
Bob|Dan
Bob|Dan
Carol|Alice
Carol|Alice
Carol|Alice
Carol|Bob
Carol|Bob
Carol|Bob
Carol|Dan
Carol|Dan
Carol|Dan
Dan|Alice
Dan|Alice
Dan|Alice
Dan|Bob
Dan|Bob
Dan|Bob
Dan|Carol
Dan|Carol
Dan|Carol
