# description: projections

-NAME AbsFunctionTest1
-QUERY MATCH (a:organisation) RETURN abs(a.score)
---- 3
100
2
7

-NAME AbsFunctionTest2
-QUERY MATCH (a:organisation) RETURN abs(a.unstrNumericProp)
---- 3

12.500000
3.100000

-NAME FloorFunctionTest1
-QUERY MATCH (a:organisation) RETURN floor(a.score)
---- 3
-2
-100
7

-NAME FloorFunctionTest2
-QUERY MATCH (a:organisation) RETURN floor(a.unstrNumericProp)
---- 3
-13.000000

-4.000000

-NAME CeilFunctionTest1
-QUERY MATCH (a:organisation) RETURN ceil(a.score)
---- 3
-2
-100
7

-NAME CeilFunctionTest2
-QUERY MATCH (a:organisation) RETURN ceil(a.unstrNumericProp)
---- 3
-12.000000

-3.000000

-NAME CeilFloorFunctionTest1
-QUERY MATCH (a:organisation) RETURN ceil(ceil(a.unstrNumericProp + abs(-0.5)) + floor(3.5))
---- 3

-9.000000
1.000000

-NAME OrgNodesReturnStarTest
-QUERY MATCH (a:organisation) RETURN *
---- 3
1|ABFsUni|325|3.700000|-2|10 years 5 months 13 hours 24 us|3 years 5 days|48 days 23:00:00|48 days 23:00:00|-12.500000
4|CsWork|934|4.100000|-100|2 years 4 days 10 hours|26 years 52 days 48:00:00|32 years 123 days 48:00:00|26 years 52 days 48:00:00|
6|DEsWork|824|4.100000|7|2 years 4 hours 22 us 34 minutes|82:00:00.1|||-3.100000

-NAME PersonNodesTestUnstructuredProperty
-QUERY MATCH (a:person) RETURN a.ID,a.unstrDateProp1
---- 8
0|1900-01-01
10|
2|1950-01-01
3|1950-01-01
5|
7|
8|
9|

-NAME PersonNodesTestString
-QUERY MATCH (a:person) RETURN a.fName
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-NAME PersonNodesTestInt
-QUERY MATCH (a:person) RETURN a.age
---- 8
35
30
45
20
20
25
40
83

-NAME PersonNodesTestBoolean
-QUERY MATCH (a:person) RETURN a.isStudent
---- 8
True
True
False
False
False
True
False
False

-NAME PersonNodesTestDouble
-QUERY MATCH (a:person) RETURN a.eyeSight
---- 8
5.000000
5.100000
5.000000
4.800000
4.700000
4.500000
4.900000
4.900000

-NAME PersonNodesTestDate
-QUERY MATCH (a:person) RETURN a.birthdate
---- 8
1900-01-01
1900-01-01
1940-06-22
1950-07-23
1980-10-26
1980-10-26
1980-10-26
1990-11-27

-NAME KnowsRelTestDate
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN e.date
---- 14
2021-06-30
2021-06-30
2021-06-30
2021-06-30
1950-05-14
1950-05-14
2021-06-30
1950-05-14
2000-01-01
2021-06-30
1950-05-14
2000-01-01
1905-12-12
1905-12-12

-NAME KnowsOneHopTest1
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE b.age=20 RETURN b.age
---- 3
20
20
20

-NAME KnowsOneHopTest2
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE b.age=20 RETURN b.age * 2
---- 3
40
40
40

-NAME KnowsOneHopTest3
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.age>20 RETURN b.fName
---- 9
Alice
Alice
Bob
Bob
Carol
Carol
Dan
Dan
Dan

-NAME KnowsTwoHopTest1
-QUERY MATCH (a:person)-[:knows]->(:person)-[:knows]->(b:person) WHERE b.age>40 RETURN b.age
---- 9
45
45
45
45
45
45
45
45
45

-NAME KnowsTwoHopTest2
-QUERY MATCH (a:person)-[:knows]->(:person)-[:knows]->(b:person) WHERE a.age>b.age+10 RETURN a.age, b.age
---- 6
35|20
35|20
45|20
45|20
45|30
45|30

-NAME KnowsTwoHopTest3
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) WHERE a.age>c.age+10 RETURN a.age, b.fName, c.age
---- 6
35|Bob|20
35|Carol|20
45|Alice|20
45|Alice|30
45|Bob|20
45|Dan|30

-NAME KnowsTwoHopTest4
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN a.fName, b.fName
---- 36
Alice|Bob
Alice|Bob
Alice|Bob
Alice|Carol
Alice|Carol
Alice|Carol
Alice|Dan
Alice|Dan
Alice|Dan
Bob|Alice
Bob|Alice
Bob|Alice
Bob|Carol
Bob|Carol
Bob|Carol
Bob|Dan
Bob|Dan
Bob|Dan
Carol|Alice
Carol|Alice
Carol|Alice
Carol|Bob
Carol|Bob
Carol|Bob
Carol|Dan
Carol|Dan
Carol|Dan
Dan|Alice
Dan|Alice
Dan|Alice
Dan|Bob
Dan|Bob
Dan|Bob
Dan|Carol
Dan|Carol
Dan|Carol

-NAME KnowsFourHopTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person)-[:knows]->(d:person)-[:knows]->(e:person) WITH e.ID as dummy RETURN COUNT(*)
---- 1
324
