# description: skip and limit tests

-NAME BasicSkipTest1
-QUERY MATCH (a:person) RETURN a.fName Skip 5
---- 3
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-NAME BasicSkipTest2
-QUERY MATCH (a:person) RETURN a.fName Skip 10
---- 0

-NAME BasicSkipTest3
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person)-[:knows]->(d:person) WITH d.ID as dummy SKIP 10 RETURN COUNT(*)
---- 1
98

-NAME BasicSkipTest4
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person)-[:knows]->(d:person)-[:knows]->(e:person) WITH e.ID as dummy SKIP 300 RETURN COUNT(*)
---- 1
24

-NAME BasicLimitTest1
-QUERY MATCH (a:person) RETURN a.fName LIMIT 2
---- 2
Alice
Bob

-NAME BasicLimitTest2
-QUERY MATCH (a:person) RETURN a.fName LIMIT 10
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-NAME BasicLimitTest3
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person)-[:knows]->(d:person) WITH d.fName AS k LIMIT 5 RETURN COUNT(*)
---- 1
5

-NAME BasicLimitTest4
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person)-[:knows]->(d:person)-[:knows]->(e:person) WITH d.fName AS k LIMIT 5 RETURN COUNT(*)
---- 1
5

-NAME BasicSkipLimitTest
-QUERY MATCH (a:person) RETURN a.fName SKIP 1 LIMIT 2
---- 2
Bob
Carol

-NAME KnowsTwoHopLimitTest
-QUERY MATCH (a:person)-[:knows]->(:person)-[:knows]->(b:person) WHERE a.age=35 RETURN b.fName LIMIT 1
---- 1
Alice

-NAME KnowsOneHopWithLimitTest1
-QUERY MATCH (a:person) WHERE a.age>20 WITH a LIMIT 1 MATCH (a)-[e:knows]->(b:person) RETURN b.fName
---- 3
Bob
Carol
Dan

-NAME KnowsOneHopWithSkipLimitTest1
-QUERY MATCH (a:person) WHERE a.age>20 WITH a SKIP 2 MATCH (a)-[e:knows]->(b:person) RETURN b.fName LIMIT 2
---- 2
Alice
Bob

-NAME KnowsOneHopWithSkipLimitTest2
-QUERY MATCH (a:person) WHERE a.age>20 WITH a SKIP 1 LIMIT 1 MATCH (a)-[e:knows]->(b:person) RETURN b.fName
---- 3
Alice
Carol
Dan

-NAME KnowsOneHopWithLimitTest3
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.age=35 WITH b LIMIT 1 RETURN b.fName
---- 1
Bob
