# description: projections

-NAME PersonNodesWithTest
-COMPARE_RESULT 1
-QUERY MATCH (a:person) WITH a RETURN a.age
---- 8
35
30
45
20
20
25
40
83

-NAME KnowsOneHopWithTest1
-COMPARE_RESULT 1
-QUERY MATCH (a:person) WHERE a.age>20 WITH a MATCH (a)-[e:knows]->(b:person) RETURN b.fName
---- 9
Alice
Alice
Bob
Bob
Carol
Carol
Dan
Dan
Dan
