-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE SubqueryMultiLabel

-NAME MultiLabelSubqueryTest
-QUERY MATCH (a:person:organisation) WHERE EXISTS { MATCH (a)-[:knows|:studyAt]->(b:organisation:person) } RETURN COUNT(*)
---- 1
6
