-DATASET CSV tinysnb

--

#TODO(Guodong): Issue #3730
-CASE SubqueryMultiLabel
-SKIP
-LOG MultiLabelSubqueryTest
-STATEMENT MATCH (a:person:organisation) WHERE EXISTS { MATCH (a)-[:knows|:studyAt]->(b:organisation:person) } RETURN COUNT(*)
---- 1
6
