-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE SubqueryMultiLabel

-LOG MultiLabelSubqueryTest
-STATEMENT MATCH (a:person:organisation) WHERE EXISTS { MATCH (a)-[:knows|:studyAt]->(b:organisation:person) } RETURN COUNT(*)
---- 1
6
