-DATASET CSV empty
--

-CASE DDLRecovery

-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE NODE TABLE N(id INT PRIMARY KEY);
---- ok
-RELOADDB
-STATEMENT MATCH () RETURN COUNT(*);
---- 1
0
