-NAME q25
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) RETURN comment.length ORDER BY comment.length LIMIT 5
---- 5
2
2
2
2
2