-DATASET CSV empty
-BUFFER_POOL_SIZE 512000000

--

-CASE FlatSelect
-STATEMENT create node table person (name string, id string, primary key(name));
---- ok
-STATEMENT create (p:person {name: 'Alice', id: 'cf5083c1-730c-4dad-be97-18f65d657420'});
---- ok
-STATEMENT create (p:person {name: 'bob', id: '7f72f9fb-a757-405b-98ca-da077d01beba'});
---- ok
-STATEMENT create rel table friend (from person to person);
---- ok
-STATEMENT MATCH (p1:person), (p2:person)
          WHERE p1.name = 'Alice' AND p2.name = 'bob'
          CREATE (p1)-[:friend]->(p2)
---- ok
-STATEMENT MATCH (p1:person)
           WITH COUNT { MATCH (p1)<-[:friend]-(p2:person) } as indegree, p1 as p1
           WHERE p1.id IN ["cf5083c1-730c-4dad-be97-18f65d657420", "7f72f9fb-a757-405b-98ca-da077d01beba"]
           RETURN p1.id as id, p1.name as name, indegree
---- 2
cf5083c1-730c-4dad-be97-18f65d657420|Alice|0
7f72f9fb-a757-405b-98ca-da077d01beba|bob|1

-CASE issue3607
-STATEMENT CREATE NODE TABLE as (id UUID, PRIMARY KEY (id));
---- ok

-CASE issue3692
-STATEMENT CREATE NODE TABLE V (id INT64, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE REL TABLE E(FROM V TO V);
---- ok
-STATEMENT MATCH (a:V)-[e* (r, n | WHERE n.id < 4 )]->(b:V {id: 4}) RETURN *;
---- 0

-CASE issue4716
-STATEMENT CREATE NODE TABLE L0 (k0 STRING, k1 STRING, k2 BOOLEAN, k3 INT64, k4 INT64, k5 BOOLEAN, k6 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L1 (k7 INT64, k8 STRING, k9 STRING, k10 BOOLEAN, k11 INT64, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L2 (k12 INT64, k13 BOOLEAN, k14 INT64, k15 BOOLEAN, k16 BOOLEAN, k17 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L3 (k18 STRING, k19 INT64, k20 INT64, k21 STRING, k22 STRING, k23 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L4 (k24 STRING, k25 BOOLEAN, k26 BOOLEAN, k27 INT64, k28 BOOLEAN, k29 INT64, k30 INT64, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L5 (k31 BOOLEAN, k32 INT64, k33 BOOLEAN, k34 STRING, k35 BOOLEAN, k36 INT64, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L6 (k37 STRING, k38 INT64, k39 BOOLEAN, k40 INT64, k41 BOOLEAN, k42 STRING, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L7 (k43 BOOLEAN, k44 STRING, k45 BOOLEAN, k46 INT64, k47 INT64, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE REL TABLE T0 (FROM L0 TO L6, k48 STRING, k49 STRING, k50 INT64, k51 STRING, k52 BOOLEAN, k53 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T1 (FROM L0 TO L4, k54 BOOLEAN, k55 BOOLEAN, k56 INT64, k57 STRING, k58 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T2 (FROM L3 TO L2, k59 STRING, k60 BOOLEAN, k61 BOOLEAN, k62 STRING, k63 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T3 (FROM L3 TO L6, k64 INT64, k65 BOOLEAN, k66 INT64, k67 STRING, k68 BOOLEAN, k69 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T4 (FROM L5 TO L6, k70 STRING, k71 BOOLEAN, k72 BOOLEAN, k73 INT64, k74 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T5 (FROM L4 TO L1, k75 BOOLEAN, k76 INT64, k77 INT64, k78 INT64, k79 STRING, k80 BOOLEAN, k81 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T6 (FROM L0 TO L2, k82 BOOLEAN, k83 INT64, k84 BOOLEAN, k85 BOOLEAN, k86 BOOLEAN, k87 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T7 (FROM L5 TO L4, k88 BOOLEAN, k89 INT64, k90 STRING, k91 INT64, k92 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T8 (FROM L5 TO L4, k93 BOOLEAN, k94 INT64, k95 INT64, k96 INT64, k97 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T9 (FROM L3 TO L1, k98 STRING, k99 INT64, k100 INT64, k101 STRING, k102 STRING, k103 STRING, k104 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T10 (FROM L0 TO L3, k105 INT64, k106 STRING, k107 BOOLEAN, k108 STRING, k109 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T11 (FROM L3 TO L1, k110 BOOLEAN, k111 INT64, k112 BOOLEAN, k113 BOOLEAN, k114 INT64, k115 BOOLEAN, k116 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T12 (FROM L1 TO L1, k117 STRING, k118 BOOLEAN, k119 BOOLEAN, k120 STRING, k121 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T13 (FROM L2 TO L4, k122 BOOLEAN, k123 INT64, k124 STRING, k125 STRING, k126 STRING, k127 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T14 (FROM L1 TO L3, k128 STRING, k129 BOOLEAN, k130 INT64, k131 BOOLEAN, k132 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T15 (FROM L3 TO L0, k133 INT64, k134 INT64, k135 INT64, k136 STRING, k137 STRING, k138 STRING, k139 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T16 (FROM L1 TO L5, k140 BOOLEAN, k141 BOOLEAN, k142 STRING, k143 BOOLEAN, k144 INT64, k145 STRING, k146 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T17 (FROM L2 TO L5, k147 BOOLEAN, k148 BOOLEAN, k149 BOOLEAN, k150 BOOLEAN, k151 BOOLEAN, k152 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T18 (FROM L4 TO L5, k153 BOOLEAN, k154 BOOLEAN, k155 STRING, k156 INT64, k157 STRING, k158 BOOLEAN, k159 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T19 (FROM L4 TO L6, k160 BOOLEAN, k161 BOOLEAN, k162 STRING, k163 STRING, k164 BOOLEAN, k165 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T20 (FROM L5 TO L3, k166 STRING, k167 BOOLEAN, k168 INT64, k169 STRING, k170 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T21 (FROM L1 TO L4, k171 STRING, k172 STRING, k173 STRING, k174 BOOLEAN, k175 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T22 (FROM L5 TO L0, k176 BOOLEAN, k177 INT64, k178 STRING, k179 INT64, k180 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T23 (FROM L3 TO L6, k181 BOOLEAN, k182 STRING, k183 BOOLEAN, k184 INT64, k185 INT64, k186 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T24 (FROM L3 TO L3, k187 BOOLEAN, k188 BOOLEAN, k189 INT64, k190 STRING, k191 STRING, k192 INT64, k193 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T25 (FROM L3 TO L5, k194 BOOLEAN, k195 INT64, k196 INT64, k197 STRING, k198 STRING, k199 STRING, k200 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T26 (FROM L3 TO L4, k201 STRING, k202 BOOLEAN, k203 INT64, k204 BOOLEAN, k205 INT64, k206 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T27 (FROM L2 TO L3, k207 INT64, k208 STRING, k209 INT64, k210 INT64, k211 INT64, k212 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T28 (FROM L2 TO L2, k213 INT64, k214 STRING, k215 BOOLEAN, k216 INT64, k217 BOOLEAN, k218 INT64, k219 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T29 (FROM L6 TO L5, k220 INT64, k221 INT64, k222 INT64, k223 BOOLEAN, k224 BOOLEAN, k225 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T30 (FROM L0 TO L0, k226 BOOLEAN, k227 BOOLEAN, k228 STRING, k229 BOOLEAN, k230 STRING, id INT64);
---- ok
-STATEMENT CREATE (n0 :L6{k39 : false, k38 : -4113470082403299178, k40 : -6068816160605443043, k42 : "m68jCl", k41 : true, id : 0, k37 : "s5fj9zTY0"});
---- ok
-STATEMENT CREATE (n0 :L0{k0 : "6DIEBd9", k1 : "kZYNS6f", k2 : true, k3 : -3002236845232900688, k4 : -9017766677436986206, k5 : true, k6 : true, id : 1});
---- ok
-STATEMENT CREATE (n0 :L1{k11 : -1304414193748854125, k10 : true, id : 2, k7 : -6078295915737455867, k8 : "IANiTeVTu", k9 : "LHhFupwZl"});
---- ok
-STATEMENT CREATE (n0 :L5{k31 : false, k33 : true, k32 : 1905998112509451819, id : 3, k35 : true, k34 : "L2XzulK9o", k36 : 3487060252057184409});
---- ok
-STATEMENT CREATE (n0 :L5{k31 : false, k33 : true, k32 : -609746112993269670, id : 4, k35 : false, k34 : "l0HWII2", k36 : 3336245918684372936});
---- ok
-STATEMENT CREATE (n0 :L6{k39 : false, k38 : -2356717711094391781, k40 : 960583289485226542, k42 : "2VOk7ZNUq", k41 : true, id : 5, k37 : "4Hcl8E6"});
---- ok
-STATEMENT CREATE (n0 :L1{k11 : -6113302254981707514, k10 : true, id : 6, k7 : -3812201220978385354, k8 : "f4ASz", k9 : "x363B"});
---- ok
-STATEMENT CREATE (n0 :L3{k19 : -4765855604282525597, k18 : "peY8u", k20 : 3282410403318157658, k22 : "rZq9c", k21 : "tGVFU5u", id : 7, k23 : false});
---- ok
-STATEMENT CREATE (n0 :L0{k0 : "F4Ji3hRN", k1 : "1u3V0g", k2 : false, k3 : -8995413594049600854, k4 : 7458953535878906945, k6 : false, id : 8});
---- ok
-STATEMENT MATCH (n0 {id : 8}), (n1 {id : 0}) CREATE(n0)-[r :T0{k49 : "gvKll", k51 : "ntV9Q", k50 : 1398527286434261433, k53 : -8724968450880799576, k52 : false, id : 9, k48 : "lhWb7"}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 2}), (n1 {id : 4}) CREATE(n0)-[r :T16{k141 : true, k140 : true, k143 : true, k142 : "qExHGllvE", k145 : "rqwbTEZ3", k144 : 4820712555086524182, id : 10}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 5}), (n1 {id : 3}) CREATE(n0)-[r :T29{k220 : 4143877186094010461, k222 : 8267880719597770095, k221 : 8500623340612532390, k224 : true, k223 : false, k225 : true, id : 11}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 7}), (n1 {id : 2}) CREATE(n0)-[r :T11{k110 : true, k112 : true, k111 : 3427583982438366729, k114 : -8437460272362939397, k113 : true, k116 : "ypRrKdEf", k115 : true, id : 12}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 3}), (n1 {id : 7}) CREATE(n0)-[r :T20{k167 : false, k166 : "tz4jO4ku", k169 : "T1KZDCF", k168 : -7936644163243621381, id : 13, k170 : true}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 8}), (n1 {id : 1}) CREATE(n0)-[r :T30{k230 : "bZqVgcD", k226 : false, id : 14, k228 : "wfvk98P", k227 : false, k229 : true}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 4}), (n1 {id : 7}) CREATE(n0)-[r :T20{k167 : true, k166 : "xpFqw", k168 : 6873511714324276725, id : 15, k170 : true}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 0}), (n1 {id : 4}) CREATE(n0)-[r :T29{k220 : -4311353219591575617, k222 : -3135326396698055449, k221 : -4560314409849779690, k224 : true, k223 : false, k225 : true, id : 16}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 6}), (n1 {id : 4}) CREATE(n0)-[r :T16{k141 : true, k140 : false, k143 : false, k142 : "pGeIzI8", k145 : "Y3BGQ", k144 : -7898518321111847146, k146 : false, id : 17}]->(n1);
---- ok
-STATEMENT MATCH (n0)-[r6]-(n1)<-[r7]-(n2)<-[r8]-(n3) WHERE true WITH n2 ORDER BY (n2.k33) LIMIT 1 WHERE (((((('Ir68oUyZr'+'kNiIX0WMt')+'SlFQWOKAV')+('L2idhdx9'+'s4ATzhAQU'))+'pV4a5Sz0') STARTS WITH 'Ir68oUyZrkNiIX0WMtSlFQWOKAVL2idhdx9s') AND ('dA524yw' CONTAINS (''+''))) MATCH (n0)<-[r9]-(n1)<-[r10]-(n2)-[r11]-(n3) WHERE true RETURN 1;
---- 0

-CASE issue4715
-STATEMENT CREATE NODE TABLE L0 (k0 STRING, k1 INT64, k2 BOOLEAN, k3 STRING, k4 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L1 (k5 STRING, k6 INT64, k7 BOOLEAN, k8 INT64, k9 STRING, k10 STRING, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L3 (k18 STRING, k19 STRING, k20 STRING, k21 BOOLEAN, k22 BOOLEAN, k23 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L4 (k24 INT64, k25 STRING, k26 STRING, k27 BOOLEAN, k28 INT64, k29 BOOLEAN, k30 INT64, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L5 (k31 STRING, k32 STRING, k33 INT64, k34 BOOLEAN, k35 BOOLEAN, k36 INT64, k37 STRING, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE REL TABLE T8 (FROM L0 TO L3, k95 INT64, k96 STRING, k97 BOOLEAN, k98 BOOLEAN, k99 STRING, k100 INT64, k101 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T9 (FROM L4 TO L0, k102 STRING, k103 BOOLEAN, k104 BOOLEAN, k105 STRING, k106 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T13 (FROM L0 TO L4, k122 INT64, k123 INT64, k124 BOOLEAN, k125 INT64, k126 INT64, k127 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T18 (FROM L1 TO L5, k153 INT64, k154 STRING, k155 INT64, k156 INT64, k157 BOOLEAN, k158 INT64, k159 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T19 (FROM L5 TO L3, k160 BOOLEAN, k161 INT64, k162 STRING, k163 STRING, k164 STRING, id INT64);
---- ok
-STATEMENT CREATE (n0 :L0{k0 : "PvEs5cp", k1 : 418248450570494167, k2 : true, k3 : "xiHFCCog", k4 : true, id : 0});
---- ok
-STATEMENT CREATE (n0 :L3{k19 : "Ebv3l6W", k18 : "7DOfidiL", k20 : "635ob", k22 : true, k21 : true, id : 1, k23 : true});
---- ok
-STATEMENT CREATE (n0 :L1{k5 : "QXx5rEE", k6 : 4674270799248930827, k10 : "N8nh4NPY", id : 2, k7 : false, k8 : -5442830614361197212, k9 : "Uzgva"});
---- ok
-STATEMENT CREATE (n0 :L4{k28 : -2374364110391562377, k27 : true, k29 : false, k30 : 3713208276441485491, id : 3, k24 : -314775095033494431, k26 : "TeyJrtCC", k25 : "XdiPY"});
---- ok
-STATEMENT CREATE (n0 :L5{k31 : "VAz5Lng0q", k32 : "wWoZwX", id : 6, k35 : false, k34 : false, k37 : "DhPHIoSG", k36 : -1753962058675529568});
---- ok
-STATEMENT MATCH (n0 {id : 2}), (n1 {id : 6}) CREATE(n0)-[r :T18{k154 : "TkBRmxYl", k153 : 2057272143585686843, k156 : -3117418658985207558, k155 : -4120878010011071534, k158 : 3557217279745451263, k157 : false, k159 : false, id : 9}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 3}), (n1 {id : 0}) CREATE(n0)-[r :T9{k103 : true, k102 : "WJYIqYrn", k105 : "JgdCjyn", k104 : true, id : 10, k106 : 2222826322181218614}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 0}), (n1 {id : 3}) CREATE(n0)-[r :T13{k123 : 8472993573652950746, k122 : -6365189707366701098, k125 : -3818611978116301262, k124 : true, k127 : true, k126 : 3072838625539467192, id : 11}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 3}), (n1 {id : 0}) CREATE(n0)-[r :T9{k103 : false, k102 : "d1k3uoZxE", k105 : "GaK5Q", k104 : false, id : 12}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 6}), (n1 {id : 1}) CREATE(n0)-[r :T19{k161 : 8219377200731510106, k160 : true, k163 : "yZ1OvyT", k162 : "SnjAWXz", k164 : "veVX5mp", id : 14}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 6}), (n1 {id : 1}) CREATE(n0)-[r :T19{k160 : false, k163 : "E3mV3li", k162 : "8O0fA", k164 : "N7VlG", id : 16}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 0}), (n1 {id : 3}) CREATE(n0)-[r :T13{k123 : -5829132821205922817, k122 : 922279295984129934, k125 : 9207035654880367167, k124 : false, k127 : true, k126 : -5290409662450442798, id : 17}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 0}), (n1 {id : 1}) CREATE(n0)-[r :T8{k95 : -1687463845770339735, k101 : true, k100 : -3797344478660095102, k97 : false, k96 : "vVUde0q", k99 : "6m9eT", k98 : true, id : 18}]->(n1);
---- ok
-STATEMENT MATCH (n3{id:2})-[r8]-(n0{id:0}) RETURN n3.id,r8.id,n0.id;
---- 0
-STATEMENT MATCH (n1)<-[r1]-(n2 :L5)<-[r2]-(n3)-[r3]-(n0), (n1)-[r4]-(n2) WHERE true WITH n2 ORDER BY (n2.k34), (n2.k36) DESC LIMIT 1 WHERE true MATCH (n0 :L0)-[r5]-(n1 :L3), (n1)<-[r6]-(n2)<-[r7]-(n3{id:2})-[r8]-(n0{id:0}) WHERE true RETURN n3.id,r8.id,n0.id;
---- 0

-CASE Issue4189
-STATEMENT CREATE NODE TABLE L0 (k0 STRING, k1 BOOLEAN, k2 BOOLEAN, k3 BOOLEAN, k4 STRING, k5 STRING, k6 STRING, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L1 (k7 STRING, k8 STRING, k9 BOOLEAN, k10 STRING, k11 INT64, k12 STRING, k13 INT64, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L2 (k14 STRING, k15 INT64, k16 STRING, k17 STRING, k18 STRING, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L3 (k19 STRING, k20 BOOLEAN, k21 INT64, k22 STRING, k23 STRING, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L4 (k24 BOOLEAN, k25 BOOLEAN, k26 BOOLEAN, k27 STRING, k28 BOOLEAN, k29 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L5 (k30 STRING, k31 INT64, k32 BOOLEAN, k33 STRING, k34 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L6 (k35 BOOLEAN, k36 BOOLEAN, k37 BOOLEAN, k38 INT64, k39 BOOLEAN, k40 STRING, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L7 (k41 BOOLEAN, k42 STRING, k43 STRING, k44 STRING, k45 STRING, k46 BOOLEAN, k47 BOOLEAN, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE L8 (k48 STRING, k49 INT64, k50 BOOLEAN, k51 STRING, k52 BOOLEAN, k53 INT64, id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE REL TABLE T1 (FROM L7 TO L0, k59 STRING, k60 STRING, k61 BOOLEAN, k62 BOOLEAN, k63 STRING, k64 INT64, k65 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T3 (FROM L2 TO L3, k72 BOOLEAN, k73 STRING, k74 STRING, k75 STRING, k76 BOOLEAN, k77 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T7 (FROM L1 TO L6, k97 INT64, k98 INT64, k99 INT64, k100 BOOLEAN, k101 STRING, k102 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T8 (FROM L3 TO L7, k103 STRING, k104 INT64, k105 BOOLEAN, k106 INT64, k107 STRING, k108 BOOLEAN, k109 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T9 (FROM L2 TO L3, k110 INT64, k111 BOOLEAN, k112 STRING, k113 BOOLEAN, k114 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T10 (FROM L1 TO L2, k115 STRING, k116 BOOLEAN, k117 STRING, k118 STRING, k119 BOOLEAN, k120 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T11 (FROM L0 TO L6, k121 STRING, k122 BOOLEAN, k123 STRING, k124 BOOLEAN, k125 BOOLEAN, k126 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T12 (FROM L1 TO L3, k127 INT64, k128 STRING, k129 INT64, k130 BOOLEAN, k131 BOOLEAN, k132 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T13 (FROM L6 TO L7, k133 INT64, k134 INT64, k135 INT64, k136 INT64, k137 STRING, k138 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T14 (FROM L2 TO L5, k139 INT64, k140 BOOLEAN, k141 STRING, k142 INT64, k143 STRING, k144 INT64, k145 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T15 (FROM L6 TO L5, k146 BOOLEAN, k147 STRING, k148 INT64, k149 INT64, k150 INT64, k151 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T17 (FROM L4 TO L7, k159 BOOLEAN, k160 BOOLEAN, k161 STRING, k162 STRING, k163 INT64, k164 STRING, k165 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T18 (FROM L3 TO L3, k166 BOOLEAN, k167 INT64, k168 BOOLEAN, k169 BOOLEAN, k170 STRING, k171 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T20 (FROM L3 TO L1, k178 STRING, k179 STRING, k180 BOOLEAN, k181 BOOLEAN, k182 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T21 (FROM L3 TO L3, k183 BOOLEAN, k184 BOOLEAN, k185 STRING, k186 INT64, k187 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T22 (FROM L3 TO L5, k188 BOOLEAN, k189 BOOLEAN, k190 STRING, k191 BOOLEAN, k192 INT64, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T23 (FROM L0 TO L3, k193 BOOLEAN, k194 INT64, k195 INT64, k196 BOOLEAN, k197 STRING, k198 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T27 (FROM L6 TO L5, k215 BOOLEAN, k216 BOOLEAN, k217 STRING, k218 INT64, k219 BOOLEAN, k220 BOOLEAN, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T28 (FROM L5 TO L4, k221 STRING, k222 BOOLEAN, k223 BOOLEAN, k224 BOOLEAN, k225 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T30 (FROM L0 TO L4, k232 BOOLEAN, k233 STRING, k234 BOOLEAN, k235 BOOLEAN, k236 STRING, k237 INT64, k238 STRING, id INT64);
---- ok
-STATEMENT CREATE REL TABLE T31 (FROM L7 TO L1, k239 BOOLEAN, k240 INT64, k241 BOOLEAN, k242 INT64, k243 INT64, id INT64);
---- ok
-STATEMENT CREATE (n0 :L6{k39 : false, k38 : 6451680089028944539, k40 : "OVdn5", id : 0, k35 : true, k37 : true, k36 : false});
---- ok
-STATEMENT CREATE (n0 :L5{k31 : -7110709925932883394, k30 : "Z2gyVk", k33 : "TGTnDFpo", k32 : true, id : 2, k34 : true});
---- ok
-STATEMENT CREATE (n0 :L3{k19 : "rScz1", k20 : true, k22 : "RhUJqF5PZ", k21 : -8225046834506062883, id : 3, k23 : "RLZ71JCCl"});
---- ok
-STATEMENT CREATE (n0 :L7{k42 : "zVl5W", k41 : false, k44 : "qmJsPU", k43 : "1cq3R", id : 5, k46 : false, k45 : "tddgZm7W", k47 : false});
---- ok
-STATEMENT CREATE (n0 :L6{k38 : -2868270034940498464, k40 : "iqijZpv", id : 8, k35 : false, k37 : false, k36 : false});
---- ok
-STATEMENT CREATE (n0 :L3{k20 : true, k22 : "IrooyglYm", k21 : -7996780931417323366, id : 9, k23 : "BQ4mdvLd"});
---- ok
-STATEMENT CREATE (n0 :L2{k17 : "Vn4TXyxN", k16 : "SMl7hM2Z", k18 : "GLcLPaqiz", id : 10, k15 : 8603278643824158927, k14 : "Tsjwkq"});
---- ok
-STATEMENT MATCH (n0 {id : 1}), (n1 {id : 2}) CREATE(n0)-[r :T25{k204 : true, id : 11, k206 : 3642269942505217845, k205 : 1552925254289060035, k208 : -440872372865862201}]->(n1);
---- error
Binder exception: Table T25 does not exist.
-STATEMENT MATCH (n0 {id : 9}), (n1 {id : 2}) CREATE(n0)-[r :T22{k189 : false, k188 : false, id : 12, k192 : -8231495005118831161, k191 : false}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 0}), (n1 {id : 5}) CREATE(n0)-[r :T13{k134 : 3233695358477561250, k133 : 1712312234490868124, k136 : 8139298401196686249, k135 : -2859283561225411564, k138 : "oTqohd", k137 : "g3tMeYB", id : 13}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 0}), (n1 {id : 1}) CREATE(n0)-[r :T19{k172 : -2996511376664851653, k174 : false, k173 : true, k176 : -388690034533412998, k175 : true, k177 : false, id : 15}]->(n1);
---- error
Binder exception: Table T19 does not exist.
-STATEMENT MATCH (n0 {id : 9}), (n1 {id : 9}) CREATE(n0)-[r :T21{k183 : false, k185 : "Sm2tf4", k184 : true, k187 : true, k186 : 3577337712342130273, id : 17}]->(n1);
---- ok
-STATEMENT MATCH (n0 {id : 3}), (n1 {id : 5}) CREATE(n0)-[r :T8{k103 : "hHlj4Is9W", k105 : false, id : 19, k107 : "FETY6P", k106 : 6431465387480627665, k109 : true, k108 : true}]->(n1);
---- ok
-STATEMENT MATCH (n0)-[r0]-(n1{k20:true}), (n2)-[r1]-(n3{k20:true}), (n4)<-[r2]-(n5), (n5{k39:false})-[r3]->(n2{k41:false}) WHERE (((r2.id) <> (r3.id)) AND true) RETURN n2.id as a0, r1.id as a1, n3.id as a2;
---- 0

-CASE issue4783
-STATEMENT CREATE NODE TABLE Person(id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE IF NOT EXISTS Movie(id INT64, name STRING, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE rel table knows(from person to person, from person to movie, age int64, comment string);
---- ok
-STATEMENT CREATE (:person {id: 12});
---- ok
-STATEMENT CREATE (:movie {id: 12, name: 'm'});
---- ok
-STATEMENT CREATE (:person {id: 25});
---- ok
-STATEMENT CREATE (:movie {id: 25, name: 'z'});
---- ok
-STATEMENT alter table knows drop age;
---- ok
-STATEMENT match (a:person), (b:person) where a.id = 25 and b.id = 12 create (a)-[:knows {comment: -8696457900372165364}]->(b);
---- ok
