-DATASET CSV ldbc-sf01
-BUFFER_POOL_SIZE 134217728

--

-CASE 3188
-STATEMENT MATCH (a:Comment) RETURN a.id ORDER BY a.length, a.browserUsed, a.locationIP, a.creationDate, a.content, a.id limit 5;
---- 5
68719546388
68719764543
137438958893
137439023070
137439023073

-CASE 3274
-STATEMENT CREATE REL TABLE knows_with_null (FROM Person TO Person, __EXTRAID string, creationDate int64);
---- ok
-STATEMENT COPY knows_with_null FROM '${KUZU_ROOT_DIRECTORY}/dataset/lsqb-sf01/Person_knows_Person_with_null_column.csv';
---- ok
-STATEMENT MATCH (a:Person)-[r:knows_with_null]->(b:Person) WHERE r.__EXTRAID IS NOT NULL RETURN COUNT(*)
---- 1
0
