-NAME NodeP0
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
-ENUMERATE
---- 1
5001

-NAME NodeP1
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 1 RETURN b.ID
-ENUMERATE
---- 1
5000

-NAME NodeP5500
-COMPARE_RESULT 1
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 5500 RETURN b.ID
-ENUMERATE
---- 0

-NAME NodeP43500
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 5500 RETURN COUNT(*)
-ENUMERATE
---- 1
0

-NAME EdgeID
-QUERY MATCH (a:person)-[r:knows]->(b:person) RETURN COUNT(DISTINCT(ID(r)))
-ENUMERATE
---- 1
10001

-NAME IndexScanTest1
-QUERY MATCH (a:person) WHERE 381 = a.ID RETURN COUNT(*)
-PARALLELISM 2
-ENUMERATE
---- 1
1

-NAME IndexScanTest2
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE 5000 = b.ID RETURN COUNT(*)
-PARALLELISM 8
-ENUMERATE
---- 1
5001
