-GROUP EndToEndReadLargeListsTest
-DATASET CSV read-list-tests/large-list

--

-CASE LargeAdjListTest

-LOG NodeP0
-STATEMENT MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
-ENUMERATE
---- 1
5001

-LOG NodeP1
-STATEMENT MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 1 RETURN b.ID
-ENUMERATE
---- 1
5000

-LOG NodeP5500
-STATEMENT MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 5500 RETURN b.ID
-ENUMERATE
---- 0

-LOG EdgeID
-STATEMENT MATCH (a:person)-[r:knows]->(b:person) WHERE a.ID = 0 AND b.ID=4999 RETURN r.int64Prop
-ENUMERATE
---- 1
4999

-LOG CrossProduct1
-STATEMENT MATCH (a:person), (b:person) RETURN COUNT(*)
-PARALLELISM 2
-ENUMERATE
---- 1
36000000

-LOG CrossProduct
-STATEMENT MATCH (a:person) WITH AVG(a.ID) AS s MATCH (b:person) WHERE s > b.ID RETURN COUNT(*)
-PARALLELISM 8
-ENUMERATE
---- 1
3000
