-GROUP EndToEndReadListsSubQueryTest
-DATASET CSV read-list-tests/large-list-sub-query-tests

--

-CASE LargeListSubQueryTest

-NAME KnowsVeryLargeAdjListSubQueryTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person)-[:knows]->(c:person) } RETURN count(*)
-PARALLELISM 1
-ENUMERATE
---- 1
1

-NAME KnowsVeryLargeAdjListVarLenWithSubQueryTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows*2..2]->(b:person) } RETURN count(*)
-PARALLELISM 1
-ENUMERATE
---- 1
1
