-NAME KnowsVeryLargeAdjListSubQueryTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person)-[:knows]->(c:person) RETURN a.ID } RETURN count(*)
-PARALLELISM 1
-ENUMERATE
---- 1
1

-NAME KnowsVeryLargeAdjListVarLenWithSubQueryTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows*2..2]->(b:person) RETURN a.ID } RETURN count(*)
-PARALLELISM 1
-ENUMERATE
---- 1
1
