-DATASET CSV read-list-tests/large-list-sub-query-tests

--

-CASE LargeListSubQueryTest
-SKIP_WASM

-LOG KnowsVeryLargeAdjListSubQueryTest
-STATEMENT CALL threads=1
---- ok
-STATEMENT MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person)-[:knows]->(c:person) } RETURN count(*)
---- 1
1

-LOG KnowsVeryLargeAdjListVarLenWithSubQueryTest
-STATEMENT CALL threads=1
---- ok
-STATEMENT MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows*2..2]->(b:person) } RETURN count(*)
---- 1
1
