-DATASET CSV empty
# rows span multiple node groups if node group size is 2
-SKIP_NODE_GROUP_SIZE_TESTS
--

-CASE CreateInt8MaxWidth
-STATEMENT CREATE NODE TABLE test(id SERIAL, value INT8, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (t:test {value: 127})
---- ok
-STATEMENT CREATE (t:test {value: 0})
---- ok
-STATEMENT CREATE (t:test {value: -128})
---- ok
-STATEMENT CALL storage_info("test") WHERE column_name = "value" return compression
---- 1
UNCOMPRESSED
-STATEMENT MATCH (t:test) RETURN t.value
---- 3
127
0
-128

-CASE CreateInt16MaxWidth
-STATEMENT CREATE NODE TABLE test(id SERIAL, value INT16, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (t:test {value: 32767})
---- ok
-STATEMENT CREATE (t:test {value: 0})
---- ok
-STATEMENT CREATE (t:test {value: -32768})
---- ok
-STATEMENT CALL storage_info("test") WHERE column_name = "value" return compression
---- 1
UNCOMPRESSED
-STATEMENT MATCH (t:test) RETURN t.value
---- 3
32767
0
-32768

-CASE CreateInt32MaxWidth
-STATEMENT CREATE NODE TABLE test(id SERIAL, value INT32, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (t:test {value:2147483647})
---- ok
-STATEMENT CREATE (t:test {value: 0})
---- ok
-STATEMENT CREATE (t:test {value: -2147483648})
---- ok
-STATEMENT CALL storage_info("test") WHERE column_name = "value" return compression
---- 1
UNCOMPRESSED
-STATEMENT MATCH (t:test) RETURN t.value
---- 3
2147483647
0
-2147483648

-CASE CreateInt64MaxWidth
-STATEMENT CREATE NODE TABLE test(id SERIAL, value INT64, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (t:test {value:9223372036854775807})
---- ok
-STATEMENT CREATE (t:test {value: 0})
---- ok
-STATEMENT CREATE (t:test {value: -9223372036854775808})
---- ok
-STATEMENT CALL storage_info("test") WHERE column_name = "value" return compression
---- 1
UNCOMPRESSED
-STATEMENT MATCH (t:test) RETURN t.value
---- 3
9223372036854775807
0
-9223372036854775808

-CASE CreateInt128MaxWidth
-STATEMENT CREATE NODE TABLE test(id SERIAL, value INT128, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (t:test {value:170141183460469231731687303715884105727})
---- ok
-STATEMENT CREATE (t:test {value: 0})
---- ok
-STATEMENT CREATE (t:test {value: -170141183460469231731687303715884105727})
---- ok
-STATEMENT CALL storage_info("test") WHERE column_name = "value" return compression
---- 1
UNCOMPRESSED
-STATEMENT MATCH (t:test) RETURN t.value
---- 3
170141183460469231731687303715884105727
0
-170141183460469231731687303715884105727
