-DATASET CSV empty
--

-CASE CopyRelSetStorageDirection
-STATEMENT create node table person (ID INt64, fName StRING, gender INT64, isStudent BoOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration interval, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT create rel table knows (FROM person TO person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MAnY) WITH (storage_direction = 'fwd_only');
---- ok
-STATEMENT create rel table meets (FROM person TO person, location FLOAT[2], times INT, data BYTEA, MANY_ONE);
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv";
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson2.csv";
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv";
---- ok
-STATEMENT COPY meets FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eMeets.csv";
---- ok
-STATEMENT MATCH (a:person)-[k:knows]->(b:person) HINT a JOIN (k JOIN b) RETURN COUNT(*)
---- error
Runtime exception: Failed to get bwd data for rel table "knows", please set the storage direction to BOTH
-STATEMENT MATCH (a:person)-[k:knows]->(b:person) HINT b JOIN (k JOIN a) RETURN COUNT(*)
---- 1
6
-STATEMENT CALL table_info('knows') RETURN DISTINCT storage_direction
---- 1
fwd_only
-STATEMENT CALL table_info('meets') RETURN DISTINCT storage_direction
---- 1
both
