-GROUP CopyRDFGraphTest
-DATASET CSV copy-test/node/rdf

--

-CASE CopyRDFGraphTest

-LOG CountTest
-STATEMENT MATCH (s:`taxonomy`) RETURN COUNT(*)
---- 1
1138397

-LOG ResultTest
-STATEMENT MATCH (s:`taxonomy`) RETURN s.iri ORDER BY s.iri LIMIT 5
---- 5
http://dbpedia.org/class/yago/'hood108641944
http://dbpedia.org/class/yago/14July115200493
http://dbpedia.org/class/yago/1530s115148787
http://dbpedia.org/class/yago/16PF106475933
http://dbpedia.org/class/yago/1750s115149933

-LOG ResultTest
-STATEMENT MATCH (s:`taxonomy`)-[p:`taxonomy`]->(o:`taxonomy`) RETURN s.iri, p, o.iri ORDER BY s.iri LIMIT 2
---- 2
http://dbpedia.org/class/yago/'hood108641944|(0:0)-{_LABEL: taxonomy.Triples, _ID: 1:0, _predicateIRIOffset: 0:2001, iri: http://www.w3.org/2000/01/rdf-schema#subClassOf0}->(0:4049)|http://dbpedia.org/class/yago/Vicinity108641113
http://dbpedia.org/class/yago/14July115200493|(0:1)-{_LABEL: taxonomy.Triples, _ID: 1:1, _predicateIRIOffset: 0:2002, iri: http://www.w3.org/2000/01/rdf-schema#subClassOf1}->(0:4050)|http://dbpedia.org/class/yago/LegalHoliday115199592
