-GROUP Rdf
-DATASET TTL EMPTY

--

-CASE LangTagOutofMemory
-STATEMENT CREATE RDFGraph R;
---- ok
-STATEMENT COPY R FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/lang/data.ttl" (in_memory=false);
---- ok
-STATEMENT MATCH (a)-[p]->(o) RETURN a.iri, p.iri, o.val, o.lang;
---- 6
http://example.org/vocab/show/218|http://example.org/vocab/show/localName|Cette Série des Années Septante|fr-be
http://example.org/vocab/show/218|http://example.org/vocab/show/localName|Cette Série des Années Soixante-dix|fr
http://example.org/vocab/show/218|http://example.org/vocab/show/localName|That Seventies Show|en
http://example.org/vocab/show/218|http://www.w3.org/2000/01/rdf-schema#label|That Seventies Show|
http://example.org/vocab/show/218|http://www.w3.org/2000/01/rdf-schema#label|That Seventies Show|
http://example.org/vocab/show/218|http://www.w3.org/2000/01/rdf-schema#label|That Seventies Show|


-CASE LangTagInMemory
-STATEMENT CREATE RDFGraph R;
---- ok
-STATEMENT COPY R FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/lang/data.ttl" (in_memory=false);
---- ok
-STATEMENT MATCH (a)-[p]->(o) RETURN a.iri, p.iri, o.val, o.lang;
---- 6
http://example.org/vocab/show/218|http://example.org/vocab/show/localName|Cette Série des Années Septante|fr-be
http://example.org/vocab/show/218|http://example.org/vocab/show/localName|Cette Série des Années Soixante-dix|fr
http://example.org/vocab/show/218|http://example.org/vocab/show/localName|That Seventies Show|en
http://example.org/vocab/show/218|http://www.w3.org/2000/01/rdf-schema#label|That Seventies Show|
http://example.org/vocab/show/218|http://www.w3.org/2000/01/rdf-schema#label|That Seventies Show|
http://example.org/vocab/show/218|http://www.w3.org/2000/01/rdf-schema#label|That Seventies Show|
