-GROUP Rdf
-DATASET TTL rdf/large_block

--

-CASE LargeBlock
-STATEMENT MATCH (a:example_r) RETURN COUNT(*);
---- 1
6003
