-GROUP Rdf
-DATASET TTL rdf/memory_bug

--

-CASE MemoryBug
-STATEMENT MATCH (a)-[e]->(b) RETURN COUNT(*);
---- 1
124
