-GROUP Rdf
-DATASET TTL rdf/memory-bug

--

-CASE MemoryBug
-STATEMENT MATCH (a)-[e]->(b) RETURN COUNT(*);
---- 1
126