-GROUP RdfoxExample
-DATASET TTL rdf/rdfox_example

--

-CASE Basic


-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 5
example_literal_triples_t|REL|
example_literal_t|NODE|
example_resource_triples_t|REL|
example_resource_t|NODE|
example|RDF|

-STATEMENT MATCH (s:example_resource_t) RETURN s.iri ORDER BY offset(id(s));
-CHECK_ORDER
---- 14
:andy
:literal
:peter
:forename
http://www.w3.org/1999/02/22-rdf-syntax-ns#type
:Person
:marriedTo
:lois
:gender
:meg
:hasParent
:chris
:stewie
:brian


-STATEMENT MATCH (s:example_literal_t) RETURN s.iri ORDER BY s.id;
-CHECK_ORDER
---- 16
12
-14.900000
True
0.016630
1999-08-16
Peter
male
Lois
female
Meg
female
Chris
male
Stewie
male
Brian

-CASE tmp
-SKIP

-STATEMENT MATCH (a:example_resource_t)-[e:example_resource_triples_t]->(b:example_resource_t) RETURN a.iri, b.iri
---- 10
:peter|:Person
:peter|:lois
:lois|:Person
:meg|:Person
:meg|:lois
:meg|:peter
:chris|:Person
:chris|:peter
:stewie|:Person
:stewie|:lois

-STATEMENT MATCH (a:example_resource_t)-[e:example_literal_triples_t]->(b:example_literal_t) RETURN a.iri, b.iri
---- 12
:peter|Peter
:peter|male
:lois|Lois
:lois|female
:meg|Meg
:meg|female
:chris|Chris
:chris|male
:stewie|Stewie
:stewie|male
:brian|Brian
:andy|12
