-GROUP RdfoxExample
-DATASET TTL rdf/rdfox_example

--

-CASE Basic
-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 5
example_literal_triples_t|REL|
example_literal_t|NODE|
example_resource_triples_t|REL|
example_resource_t|NODE|
example|RDF|

-STATEMENT MATCH (s:example_resource_t) RETURN s.IRI ORDER BY offset(id(s));
-CHECK_ORDER
---- 14
:peter
:forename
http://www.w3.org/1999/02/22-rdf-syntax-ns#type
:Person
:marriedTo
:lois
:gender
:meg
:hasParent
:chris
:stewie
:brian
:andy
:age

-STATEMENT MATCH (s:example_literal_t) RETURN s.* ORDER BY offset(id(s));
-CHECK_ORDER
---- 12
0|Peter
1|male
2|Lois
3|female
4|Meg
5|female
6|Chris
7|male
8|Stewie
9|male
10|Brian
11|12

-STATEMENT MATCH (a:example_resource_t)-[e:example_resource_triples_t]->(b:example_resource_t) RETURN a.IRI, b.IRI
---- 10
:peter|:Person
:peter|:lois
:lois|:Person
:meg|:Person
:meg|:lois
:meg|:peter
:chris|:Person
:chris|:peter
:stewie|:Person
:stewie|:lois

-STATEMENT MATCH (a:example_resource_t)-[e:example_literal_triples_t]->(b:example_literal_t) RETURN a.IRI, b.IRI
---- 12
:peter|Peter
:peter|male
:lois|Lois
:lois|female
:meg|Meg
:meg|female
:chris|Chris
:chris|male
:stewie|Stewie
:stewie|male
:brian|Brian
:andy|12
