-GROUP Rdf
-DATASET TTL rdf/rdfox_example

--

-CASE RdfUpdate
-STATEMENT MATCH (a)-[e]->(b) WHERE NOT a.iri ENDS WITH "brian"  DELETE e;
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 1
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
-STATEMENT CREATE (a:example_r {iri: "a"})-[e:example_rt {iri: "b"}]->(b:example_r {iri: "c"})
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 2
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
a|b|c|
-STATEMENT CREATE (a:example_r {iri: "a"})-[:example_rt {iri: "b"}]->(:example_r {iri: "c"})-[:example_rt {iri: "c"}]->(:example_r {iri: "d"})
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 4
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
a|b|c|
a|b|c|
c|c|d|
-STATEMENT MATCH (a)-[e]->(b) WHERE a.iri = "a" AND e.iri="b" AND b.iri="c"  DELETE e;
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 2
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
c|c|d|
-STATEMENT CREATE (a:example_r {iri: "a"})-[:example_lt {iri: "b"}]->(b:example_l {val: 12}),
                  (a)-[:example_lt {iri: "mm"}]->(:example_l {val:cast("2024-01-01", "DATE")})
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 4
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
c|c|d|
a|b||12
a|mm||2024-01-01
-STATEMENT MATCH (a)-[e]->(b:example_l {val: 12}) DELETE e;
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 3
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
c|c|d|
a|mm||2024-01-01
-STATEMENT CREATE (a:example_r {iri: "x"})-[:example_lt {iri: "c"}]->(b:example_l {val: "hh"}) RETURN a.iri, b.val
---- 1
x|hh
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 4
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
c|c|d|
a|mm||2024-01-01
x|c||hh

-CASE Basic
-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 5
example_lt|REL|
example_l|NODE|
example_rt|REL|
example_r|NODE|
example|RDFGraph|

-STATEMENT MATCH (s:example_r) RETURN s.iri ORDER BY offset(id(s));
---- 16
http://www.w3.org/1999/02/22-rdf-syntax-ns#type
https://kuzudb.com/engineer
https://rdfox.com/getting-started/Person
https://rdfox.com/getting-started/andy
https://rdfox.com/getting-started/brian
https://rdfox.com/getting-started/chris
https://rdfox.com/getting-started/forename
https://rdfox.com/getting-started/gender
https://rdfox.com/getting-started/hasParent
https://rdfox.com/getting-started/literal
https://rdfox.com/getting-started/lois
https://rdfox.com/getting-started/marriedTo
https://rdfox.com/getting-started/meg
https://rdfox.com/getting-started/peter
https://rdfox.com/getting-started/role
https://rdfox.com/getting-started/stewie

-STATEMENT MATCH (s:example_l) RETURN s.val ORDER BY s.id ;
-CHECK_ORDER
---- 16
12
-14.900000
True
0.016630
1999-08-16
Peter
male
Lois
female
Meg
female
Chris
male
Stewie
male
Brian

-STATEMENT MATCH (s:example_l) RETURN s.val,
        to_int64(s.val) + 1, to_int32(s.val), to_int16(s.val), to_int8(s.val) * 2,
        to_uint64(s.val), to_uint32(s.val), to_uint16(s.val), to_uint8(s.val),
        to_double(s.val), to_float(s.val), to_bool(s.val), to_blob(s.val),
        date(s.val), timestamp(s.val), cast(s.val, "TIMESTAMP_NS"), cast(s.val, "TIMESTAMP_MS"),
        cast(s.val, "TIMESTAMP_SEC"), cast(s.val, "TIMESTAMP_TZ"), interval(s.val), to_string(s.val)
        ORDER BY s.id LIMIT 6;
-CHECK_ORDER
---- 6
12|13|12|12|24|12|12|12|12|12.000000|12.000000||||||||||12
-14.900000|-14|-15|-15|-30|||||-14.900000|-14.900000||||||||||-14.900000
True|||||||||||True|||||||||True
0.016630|1|0|0|0|0|0|0|0|0.016630|0.016630||||||||||0.016630
1999-08-16|||||||||||||1999-08-16|||||||1999-08-16
Peter||||||||||||||||||||Peter

-STATEMENT MATCH (s:example_l) RETURN s.val +1, s.val * 2, s.val * 2.0, s.val = true, dayname(s.val), concat(s.val, 'a')
        ORDER BY s.id LIMIT 6;
-CHECK_ORDER
---- 6
13|24|24.000000|||12a
-14|-30|-29.800000|||-14.900000a
|||True||Truea
1|0|0.033260|||0.016630a
||||Monday|1999-08-16a
|||||Petera

-STATEMENT MATCH (a:example_r)-[e:example]->(b:example_r) RETURN a.iri, e.iri, b.iri
---- 11
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/role|https://kuzudb.com/engineer
https://rdfox.com/getting-started/chris|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/peter
https://rdfox.com/getting-started/lois|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person
https://rdfox.com/getting-started/meg|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/lois
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/peter
https://rdfox.com/getting-started/peter|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/marriedTo|https://rdfox.com/getting-started/lois
https://rdfox.com/getting-started/stewie|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/lois

-STATEMENT MATCH (a:example_r)-[e:example]->(b:example_l) RETURN a.iri, e.iri, b.val
---- 16
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal|-14.900000
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal|0.016630
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal|12
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal|1999-08-16
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal|True
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename|Brian
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/forename|Chris
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/gender|male
https://rdfox.com/getting-started/lois|https://rdfox.com/getting-started/forename|Lois
https://rdfox.com/getting-started/lois|https://rdfox.com/getting-started/gender|female
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/forename|Meg
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/gender|female
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/forename|Peter
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/gender|male
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/forename|Stewie
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/gender|male

-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 27
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||-14.900000
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||0.016630
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||12
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||1999-08-16
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||True
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/role|https://kuzudb.com/engineer|
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
https://rdfox.com/getting-started/chris|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/forename||Chris
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/gender||male
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/peter|
https://rdfox.com/getting-started/lois|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/lois|https://rdfox.com/getting-started/forename||Lois
https://rdfox.com/getting-started/lois|https://rdfox.com/getting-started/gender||female
https://rdfox.com/getting-started/meg|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/forename||Meg
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/gender||female
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/lois|
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/peter|
https://rdfox.com/getting-started/peter|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/forename||Peter
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/gender||male
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/marriedTo|https://rdfox.com/getting-started/lois|
https://rdfox.com/getting-started/stewie|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/forename||Stewie
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/gender||male
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/lois|

# Internal offset is not deterministic across platforms. So we don't check result
-STATEMENT MATCH (a)-[e]->(b)
            WHERE a.iri = "https://rdfox.com/getting-started/brian"
            RETURN a, e, b
---- ok
-STATEMENT MATCH (a)-[e*]->(b)
            WHERE a.iri = "https://rdfox.com/getting-started/brian"
            RETURN e
---- ok
-STATEMENT RETURN 1;
---- 1
1
-STATEMENT MATCH (a)-[e]->(b) RETURN e.pid;
---- error
Binder exception: pid is reserved for system usage. External access is not allowed.
