-GROUP RdfoxExample
-DATASET TTL rdf/rdfox_example

--



-CASE RdfUpdate
-STATEMENT MATCH (a)-[e]->(b) WHERE a.iri <> ":brian"  DELETE e;
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 1
:brian|:forename||Brian
-STATEMENT CREATE (a:example_r {iri: "a"})-[e:example_rt {iri: "b"}]->(b:example_r {iri: "c"})
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 2
:brian|:forename||Brian
a|b|c|
-STATEMENT CREATE (a:example_r {iri: "a"})-[:example_rt {iri: "b"}]->(:example_r {iri: "c"})-[:example_rt {iri: "c"}]->(:example_r {iri: "d"})
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 4
:brian|:forename||Brian
a|b|c|
a|b|c|
c|c|d|
-STATEMENT MATCH (a)-[e]->(b) WHERE a.iri = "a" AND e.iri="b" AND b.iri="c"  DELETE e;
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 2
:brian|:forename||Brian
c|c|d|

-CASE Basic
-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 5
example_lt|REL|
example_l|NODE|
example_rt|REL|
example_r|NODE|
example|RDF|

-STATEMENT MATCH (s:example_r) RETURN s.iri ORDER BY offset(id(s));
---- 14
:andy
:literal
:peter
:forename
http://www.w3.org/1999/02/22-rdf-syntax-ns#type
:Person
:marriedTo
:lois
:gender
:meg
:hasParent
:chris
:stewie
:brian


-STATEMENT MATCH (s:example_l) RETURN s.val ORDER BY s.id ;
-CHECK_ORDER
---- 16
12
-14.900000
True
0.016630
1999-08-16
Peter
male
Lois
female
Meg
female
Chris
male
Stewie
male
Brian

-STATEMENT MATCH (s:example_l) RETURN s.val,
        to_int64(s.val) + 1, to_int32(s.val), to_int16(s.val), to_int8(s.val) * 2,
        to_uint64(s.val), to_uint32(s.val), to_uint16(s.val), to_uint8(s.val),
        to_double(s.val), to_float(s.val), to_bool(s.val), to_blob(s.val),
        date(s.val), timestamp(s.val), cast(s.val, "TIMESTAMP_NS"), cast(s.val, "TIMESTAMP_MS"),
        cast(s.val, "TIMESTAMP_SEC"), cast(s.val, "TIMESTAMP_TZ"), interval(s.val), to_string(s.val)
        ORDER BY s.id LIMIT 6;
-CHECK_ORDER
---- 6
12|13|12|12|24|12|12|12|12|12.000000|12.000000||||||||||12
-14.900000|-14|-15|-15|-30|||||-14.900000|-14.900000||||||||||-14.900000
True|||||||||||True|||||||||True
0.016630|1|0|0|0|0|0|0|0|0.016630|0.016630||||||||||0.016630
1999-08-16|||||||||||||1999-08-16|||||||1999-08-16
Peter||||||||||||||||||||Peter

-STATEMENT MATCH (s:example_l) RETURN s.val +1, s.val * 2, s.val * 2.0, s.val = true, dayname(s.val), concat(s.val, 'a')
        ORDER BY s.id LIMIT 6;
-CHECK_ORDER
---- 6
13|24|24.000000|||12a
-14|-30|-29.800000|||-14.900000a
|||True||Truea
1|0|0.033260|||0.016630a
||||Monday|1999-08-16a
|||||Petera

-STATEMENT MATCH (a:example_r)-[e:example]->(b:example_r) RETURN a.iri, e.iri, b.iri
---- 10
:peter|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:peter|:marriedTo|:lois
:lois|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:meg|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:meg|:hasParent|:lois
:meg|:hasParent|:peter
:chris|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:chris|:hasParent|:peter
:stewie|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person
:stewie|:hasParent|:lois

-STATEMENT MATCH (a:example_r)-[e:example]->(b:example_l) RETURN a.iri, e.iri, b.val
---- 16
:andy|:literal|12
:andy|:literal|-14.900000
:andy|:literal|True
:andy|:literal|0.016630
:andy|:literal|1999-08-16
:peter|:forename|Peter
:peter|:gender|male
:lois|:forename|Lois
:lois|:gender|female
:meg|:forename|Meg
:meg|:gender|female
:chris|:forename|Chris
:chris|:gender|male
:stewie|:forename|Stewie
:stewie|:gender|male
:brian|:forename|Brian

-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 26
:andy|:literal||-14.900000
:andy|:literal||0.016630
:andy|:literal||12
:andy|:literal||1999-08-16
:andy|:literal||True
:brian|:forename||Brian
:chris|:forename||Chris
:chris|:gender||male
:chris|:hasParent|:peter|
:chris|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person|
:lois|:forename||Lois
:lois|:gender||female
:lois|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person|
:meg|:forename||Meg
:meg|:gender||female
:meg|:hasParent|:lois|
:meg|:hasParent|:peter|
:meg|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person|
:peter|:forename||Peter
:peter|:gender||male
:peter|:marriedTo|:lois|
:peter|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person|
:stewie|:forename||Stewie
:stewie|:gender||male
:stewie|:hasParent|:lois|
:stewie|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|:Person|