-GROUP Rdf
-DATASET TTL EMPTY

--

-CASE RdfoxInMemory

-STATEMENT CREATE RDFGraph example;
---- ok
-STATEMENT COPY example FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/rdfox_example/data.ttl" (in_memory=true);
---- ok
-STATEMENT MATCH (a)-[e]->(b) RETURN a.iri, e.iri, b.iri, b.val
---- 27
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||-14.900000
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||0.016630
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||12
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||1999-08-16
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/literal||True
https://rdfox.com/getting-started/andy|https://rdfox.com/getting-started/role|https://kuzudb.com/engineer|
https://rdfox.com/getting-started/brian|https://rdfox.com/getting-started/forename||Brian
https://rdfox.com/getting-started/chris|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/forename||Chris
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/gender||male
https://rdfox.com/getting-started/chris|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/peter|
https://rdfox.com/getting-started/lois|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/lois|https://rdfox.com/getting-started/forename||Lois
https://rdfox.com/getting-started/lois|https://rdfox.com/getting-started/gender||female
https://rdfox.com/getting-started/meg|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/forename||Meg
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/gender||female
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/lois|
https://rdfox.com/getting-started/meg|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/peter|
https://rdfox.com/getting-started/peter|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/forename||Peter
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/gender||male
https://rdfox.com/getting-started/peter|https://rdfox.com/getting-started/marriedTo|https://rdfox.com/getting-started/lois|
https://rdfox.com/getting-started/stewie|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|https://rdfox.com/getting-started/Person|
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/forename||Stewie
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/gender||male
https://rdfox.com/getting-started/stewie|https://rdfox.com/getting-started/hasParent|https://rdfox.com/getting-started/lois|
