-DATASET CSV tinysnb

--

-CASE DuplicateKeyTest
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT CREATE (a:person {ID:2});
---- error
Runtime exception: Found duplicated primary key value 2, which violates the uniqueness constraint of the primary key column.
-STATEMENT CREATE (a:person {ID:200});
---- ok
-STATEMENT MATCH (a:person {ID:200}) SET a.ID = 300;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID > 10 RETURN a.ID;
---- 1
300

-CASE NonNullTest
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35
-STATEMENT MATCH (a:person) WHERE a.ID = 0 SET a.age = 70;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
70
-STATEMENT COMMIT;
---- ok


-CASE NullTest
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35
-STATEMENT MATCH (a:person) WHERE a.ID = 0 SET a.age = null;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1

-STATEMENT COMMIT;
---- ok

-CASE RollbackTest
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 SET a.fName='abcdefghijklmnopqrstuvwxyz'
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.fName;
---- 1
Alice
