-GROUP Set_Transaction
-DATASET CSV tinysnb

--

-CASE NonNullTest
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35
-STATEMENT MATCH (a:person) WHERE a.ID = 0 SET a.age = 70;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
70

-CASE NullTest
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35
-STATEMENT MATCH (a:person) WHERE a.ID = 0 SET a.age = null;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1

-CASE TimeoutErrorTest
-CHECKPOINT_WAIT_TIMEOUT 10000
-CREATE_CONNECTION conn1
-STATEMENT [conn1] BEGIN TRANSACTION READ ONLY;
---- ok
-CREATE_CONNECTION conn2
-STATEMENT [conn2] BEGIN TRANSACTION;
---- ok
-STATEMENT [conn2] MATCH (a:person) WHERE a.ID=0 set a.age=70;
---- ok
-STATEMENT [conn2] COMMIT
---- error
Timeout waiting for read transactions to leave the system before committing and checkpointing a write transaction. If you have an open read transaction close and try again.
-STATEMENT [conn1] MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35

-CASE RollbackTest
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 SET a.fName='abcdefghijklmnopqrstuvwxyz'
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.fName;
---- 1
Alice
-CASE VeryLongStringErrorsTest
-LOG Set Very Long String Errors Test
-STATEMENT BEGIN TRANSACTION;
---- ok
-DEFINE test_long_string REPEAT 262144 "a"
-STATEMENT MATCH (a:person) WHERE a.ID=0 SET a.fName='${test_long_string}';
---- ok
