-DATASET CSV tinysnb

--

-CASE NonNullTest
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35
-STATEMENT MATCH (a:person) WHERE a.ID = 0 SET a.age = 70;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
70
-STATEMENT COMMIT;
---- ok


-CASE NullTest
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35
-STATEMENT MATCH (a:person) WHERE a.ID = 0 SET a.age = null;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1

-STATEMENT COMMIT;
---- ok


-CASE TimeoutErrorTest
-CHECKPOINT_WAIT_TIMEOUT 10000
-CREATE_CONNECTION conn1
-STATEMENT [conn1] BEGIN TRANSACTION READ ONLY;
---- ok
-CREATE_CONNECTION conn2
-STATEMENT [conn2] BEGIN TRANSACTION;
---- ok
-STATEMENT [conn2] MATCH (a:person) WHERE a.ID=0 set a.age=70;
---- ok
-STATEMENT [conn2] COMMIT
---- error
Timeout waiting for active transactions to leave the system before checkpointing. If you have an open transaction, please close it and try again.
-STATEMENT [conn1] MATCH (a:person) WHERE a.ID=0 RETURN a.age;
---- 1
35


-CASE RollbackTest
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 SET a.fName='abcdefghijklmnopqrstuvwxyz'
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 RETURN a.fName;
---- 1
Alice
