-GROUP CopyThreeDimensionalNpyTest
-DATASET NPY npy-3d

--

-CASE CopyThreeDimensionalNpyTest

-LOG ID
-STATEMENT MATCH (n:npytable) RETURN n.id
---- 2
1
2

-LOG i64
-STATEMENT MATCH (n:npytable) RETURN n.i64
---- 2
[1,2,3,4,5,6,7,8,9,10,11,12]
[13,14,15,16,17,18,19,20,21,22,23,24]
