-DATASET CSV snap/amazon0601/csv
-BUFFER_POOL_SIZE 268435456
-SKIP_IN_MEM
--

-CASE CopySNAPAmazon0601CSV
-STATEMENT MATCH (a:account) RETURN COUNT(*)
---- 1
403394
-STATEMENT MATCH (a:account)-[e:follows]->(b:account) HINT a JOIN (e JOIN b) RETURN COUNT(*)
---- 1
3387388
-STATEMENT MATCH (a:account)-[e:follows]->(b:account) HINT b JOIN (e JOIN a) RETURN COUNT(*)
---- 1
3387388
