-DATASET PARQUET empty

--

-CASE CopyParquet

-STATEMENT CREATE NODE TABLE test1(a DOUBLE, b DOUBLE[2], PRIMARY KEY (a));
---- ok
-STATEMENT COPY test1 FROM "${KUZU_ROOT_DIRECTORY}/dataset/parquet/issue3481.parquet";
---- ok
-STATEMENT MATCH (a:test1) RETURN a.*;
---- 2
1.110000|[2.300000,3.300000]
4.410000|[12.300000,53.300000]
-STATEMENT CREATE NODE TABLE test2(a FLOAT, b DOUBLE[], PRIMARY KEY (a));
---- ok
-STATEMENT COPY test2 FROM "${KUZU_ROOT_DIRECTORY}/dataset/parquet/issue3481.parquet";
---- ok
-STATEMENT MATCH (a:test2) RETURN a.*;
---- 2
1.110000|[2.300000,3.300000]
4.410000|[12.300000,53.300000]
