-NAME Subset
-QUERY MATCH (row:table_csv) WHERE row.id >= 20 AND row.id <= 24 RETURN *;
---- 5
20|0|57.579280|True|1731-09-26|1731-09-26 03:30:08|OdM
21|7|64.630960|False|1307-01-26|1307-01-26 03:31:08|AjbxHQThEtDDlOjbzMjCQSXlvGQEjcFLykESrnFHwPKX
22|71|37.963386|True|1455-07-26|1455-07-26 03:07:03|dRvHHdyNXYfSUcicaxBoQEKQUfgex
23|58|42.774957|False|1181-10-16|1181-10-16 18:19:43|ISImRVpUjynGMFRQyYmeIUVjM
24|75|53.813224|False|1942-10-24|1942-10-24 09:30:16|naDlQ

-NAME CountTrue
-QUERY MATCH (row:table_csv) WHERE row.column3 = True RETURN count(*)
---- 1
24997

-NAME countFalse
-QUERY MATCH (row:table_csv) WHERE row.column3 = False RETURN count(*)
---- 1
25002

-NAME Sum
-QUERY MATCH (row:table_csv) RETURN sum(row.id), sum(row.column1), sum(row.column2)
---- 1
1249925001|2500180|2504542.349696

-NAME EmptyString
-QUERY MATCH (row:table_csv) WHERE row.id = 49992 RETURN *;
---- 1
49992|50|31.582059|False|1551-07-19|1551-07-19 16:28:31|

-NAME Float
-QUERY MATCH (row:table_csv) WHERE row.column2 = 68.73718401556897 RETURN row.column4;
---- 1
1042-06-05

-NAME Date
-QUERY MATCH (row:table_csv) WHERE row.id = 25531 RETURN *;
---- 1
25531|77|28.417543|False|1895-03-13|1895-03-13 04:31:22|XB

-NAME Interval
-QUERY MATCH (row:table_csv) WHERE 0 <= row.column2 AND row.column2 <= 10 AND 0 <= row.column1 AND row.column1 <= 10 RETURN count(*);
---- 1
546