-GROUP CopyThreeDimensionalNpyTest
-DATASET NPY npy-20k

--

# This is pending the feature of reading the results from a txt/csv file
-CASE CopyLargeNpyTest
-SKIP

-NAME ID
-QUERY MATCH (n:npytable) RETURN n.id
---- 2
1
2

