-DATASET CSV long-string-multiple-files
-SKIP_WASM

--

-CASE CopyLongStringMultipleFilesTest

-LOG LongStringAlice
-STATEMENT MATCH (p:person) RETURN COUNT(*);
---- 1
220000
