-GROUP CopySerialPKTest
-DATASET CSV tinysnb-serial

--

-CASE CopySerialPK
-SKIP
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN COUNT(*)
---- 1
14
