-GROUP CopyNodeFromCSVTest
-DATASET CSV copy-test/node/csv

--

-CASE CopyNodeTest

-LOG SubsetTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.id >= 20 AND row.id <= 24 RETURN *;
---- 5
{_ID: 0:20, _LABEL: tableOfTypes, id: 20, int64Column: 0, doubleColumn: 57.579280, booleanColumn: True, dateColumn: 1731-09-26, timestampColumn: 1731-09-26 03:30:08, stringColumn: OdM, listOfInt: [93,,86,37]}
{_ID: 0:21, _LABEL: tableOfTypes, id: 21, int64Column: 7, doubleColumn: 64.630960, booleanColumn: False, dateColumn: 1307-01-26, timestampColumn: 1307-01-26 03:31:08, stringColumn: AjbxHQThEtDDlOjbzMjCQSXlvGQEjcFLykESrnFHwPKX, listOfInt: []}
{_ID: 0:22, _LABEL: tableOfTypes, id: 22, int64Column: 71, doubleColumn: 37.963386, booleanColumn: True, dateColumn: 1455-07-26, timestampColumn: 1455-07-26 03:07:03, stringColumn: dRvHHdyNXYfSUcicaxBoQEKQUfgex, listOfInt: [72,,45,,81]}
{_ID: 0:23, _LABEL: tableOfTypes, id: 23, int64Column: 58, doubleColumn: 42.774957, booleanColumn: False, dateColumn: 1181-10-16, timestampColumn: 1181-10-16 18:19:43, stringColumn: ISImRVpUjynGMFRQyYmeIUVjM}
{_ID: 0:24, _LABEL: tableOfTypes, id: 24, int64Column: 75, doubleColumn: 53.813224, booleanColumn: False, dateColumn: 1942-10-24, timestampColumn: 1942-10-24 09:30:16, stringColumn: naDlQ, listOfInt: [97,91,28,26,]}

-LOG CheckNumLinesTest
-STATEMENT MATCH (row:tableOfTypes) RETURN count(*)
---- 1
49999

-LOG CountTrueTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.booleanColumn = True RETURN count(*)
---- 1
24997

-LOG CountFalseTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.booleanColumn = False RETURN count(*)
---- 1
25002

-LOG CheckSumTest
-STATEMENT MATCH (row:tableOfTypes) RETURN sum(row.id), sum(row.int64Column), sum(row.doubleColumn)
---- 1
1249925001|2500180|2504542.349696

-LOG EmptyStringTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.id = 49992 RETURN *;
---- 1
{_ID: 0:49992, _LABEL: tableOfTypes, id: 49992, int64Column: 50, doubleColumn: 31.582059, booleanColumn: False, dateColumn: 1551-07-19, timestampColumn: 1551-07-19 16:28:31, listOfInt: [5,67,66]}

-LOG FloatTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.doubleColumn = 68.73718401556897 RETURN row.dateColumn;
---- 1
1042-06-05

-LOG DateTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.id = 25531 RETURN *;
---- 1
{_ID: 0:25531, _LABEL: tableOfTypes, id: 25531, int64Column: 77, doubleColumn: 28.417543, booleanColumn: False, dateColumn: 1895-03-13, timestampColumn: 1895-03-13 04:31:22, stringColumn: XB, listOfInt: [9,66,0,15]}

-LOG IntervalTest
-STATEMENT MATCH (row:tableOfTypes) WHERE 0 <= row.doubleColumn AND row.doubleColumn <= 10 AND 0 <= row.int64Column AND row.int64Column <= 10 RETURN count(*);
---- 1
546
