-GROUP TinySnbTimestampTest
-DATASET CSV tinysnb

--

-CASE NodePropertyColumnWithTimestamp
-STATEMENT MATCH (p:person) RETURN p.registerTime
---- 8
1911-08-20 02:32:21
1972-07-31 13:22:30.678559
1976-12-23 04:41:42
1976-12-23 11:21:42
2008-11-03 15:25:30.000526
2011-08-20 11:25:30
2023-02-21 13:25:30
2031-11-30 12:25:30
