-GROUP CopyLongStringTest
-DATASET CSV copy-fault-tests/long-string

--

-CASE LongStringError
-DEFINE AliceStr REPEAT 819 "Alice"

-DEBUG_LOG LongStringAlice
-STATEMENT MATCH (p:person) RETURN p.fName;
---- 2
${AliceStr}A
Bob

-DEBUG_LOG Gender
-STATEMENT MATCH (p:person) RETURN p.gender
---- 2
1
2
