-GROUP CopyNodeFromCSVTest
-DATASET CSV copy-test/node/csv

--

-CASE CopyNodeTest

-LOG SubsetTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.id >= 20 AND row.id <= 24 RETURN row.*;
---- 5
20|0|57.579280|True|1731-09-26|1731-09-26 03:30:08|OdM|[93,,86,37]
21|7|64.630960|False|1307-01-26|1307-01-26 03:31:08|AjbxHQThEtDDlOjbzMjCQSXlvGQEjcFLykESrnFHwPKX|[]
22|71|37.963386|True|1455-07-26|1455-07-26 03:07:03|dRvHHdyNXYfSUcicaxBoQEKQUfgex|[72,,45,,81]
23|58|42.774957|False|1181-10-16|1181-10-16 18:19:43|ISImRVpUjynGMFRQyYmeIUVjM|
24|75|53.813224|False|1942-10-24|1942-10-24 09:30:16|naDlQ|[97,91,28,26,]

-LOG CheckNumLinesTest
-STATEMENT MATCH (row:tableOfTypes) RETURN count(*)
---- 1
49999

-LOG CountTrueTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.booleanColumn = True RETURN count(*)
---- 1
24997

-LOG CountFalseTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.booleanColumn = False RETURN count(*)
---- 1
25002

-LOG CheckSumTest
-STATEMENT MATCH (row:tableOfTypes) RETURN sum(row.id), sum(row.int64Column), sum(row.doubleColumn)
---- 1
1249925001|2500180|2504542.349696

-LOG EmptyStringTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.id = 49992 RETURN row.*;
---- 1
49992|50|31.582059|False|1551-07-19|1551-07-19 16:28:31||[5,67,66]

-LOG FloatTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.doubleColumn = 68.73718401556897 RETURN row.dateColumn;
---- 1
1042-06-05

-LOG DateTest
-STATEMENT MATCH (row:tableOfTypes) WHERE row.id = 25531 RETURN row.*;
---- 1
25531|77|28.417543|False|1895-03-13|1895-03-13 04:31:22|XB|[9,66,0,15]

-LOG IntervalTest
-STATEMENT MATCH (row:tableOfTypes) WHERE 0 <= row.doubleColumn AND row.doubleColumn <= 10 AND 0 <= row.int64Column AND row.int64Column <= 10 RETURN count(*);
---- 1
546

-LOG OrderByTest
-STATEMENT MATCH (row:tableOfTypes) RETURN row.id ORDER BY row.id DESC LIMIT 10;
-PARALLELISM 1
-CHECK_ORDER
---- 10
49998
49997
49996
49995
49994
49993
49992
49991
49990
49989

-LOG OrderByMultiColTest
-STATEMENT MATCH (row:tableOfTypes) RETURN row.id ORDER BY row.id DESC, row.booleanColumn, row.doubleColumn LIMIT 10;
-PARALLELISM 1
-CHECK_ORDER
---- 10
49998
49997
49996
49995
49994
49993
49992
49991
49990
49989
