-GROUP CopySerialPKTest
-DATASET CSV tinysnb-serial

--

-CASE CopySerialPKTest
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN COUNT(*)
---- 1
14
