-DATASET CSV snap/twitter/parquet
-BUFFER_POOL_SIZE 268435456

--

-CASE CopySNAPTwitterParquet
-STATEMENT MATCH (a:account) RETURN COUNT(*)
---- 1
81306
-STATEMENT MATCH (a:account)-[:follows]->(b:account) RETURN COUNT(*)
---- 1
2420766
