-GROUP CopyLongStringTest
-DATASET CSV copy-fault-tests/long-string
-SKIP

--

-CASE LongStringError
-DEFINE AliceStr REPEAT 819 "Alice"

-LOG LongStringAlice
-STATEMENT MATCH (p:person) RETURN p.fName;
---- 2
${AliceStr}A
Bob

-LOG Gender
-STATEMENT MATCH (p:person) RETURN p.gender
---- 2
1
2
