-DATASET CSV snap/twitter/csv
-BUFFER_POOL_SIZE 268435456

--

-CASE CopySNAPTwitterCSV
-STATEMENT MATCH (a:account) RETURN COUNT(*)
---- 1
81306
-STATEMENT MATCH (a:account)-[:follows]->(b:account) RETURN COUNT(*)
---- 1
2420766
