-GROUP COPY_SNAP
-DATASET CSV snap/amazon0601/parquet

--

-CASE CopySNAPAmazon0601Parquet
-STATEMENT MATCH (a:account) RETURN COUNT(*)
---- 1
403394
-STATEMENT MATCH (a:account)-[:follows]->(b:account) RETURN COUNT(*)
---- 1
3387388
