-DATASET CSV demo-db/csv

--

-CASE ExportImportDatabaseDefault
-SKIP_WASM
-STATEMENT create macro addWithDefault(a,b:=3) as a + b;
---- ok
-STATEMENT ALTER TABLE User ADD random MAP(STRING, INT64) DEFAULT map(["key1","key2"],[400,250])
---- ok
-STATEMENT MATCH (p:User) WHERE p.name = "Adam" return p.random
---- 1
{key1=400, key2=250}
-STATEMENT create sequence seq start 0 increment 10 minvalue 0;
---- ok
-STATEMENT return nextval('seq');
---- 1
0
-STATEMENT return nextval('seq');
---- 1
10
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case1/demo-db"
---- 1
Exported database successfully.
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case1/demo-db"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case1/demo-db"
---- 1
Imported database successfully.
-STATEMENT MATCH (u:User) WHERE u.name = "Adam" SET u.age = 50
---- ok
-LOG ReturnAge
-STATEMENT MATCH (u:User) WHERE u.name="Adam" RETURN u.age
---- 1
50
-STATEMENT return addWithDefault(2);
---- 1
5
-STATEMENT return currval('seq');
---- 1
10

-CASE ExportImportDatabaseWithCSVOption
-SKIP_WASM
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case2/demo-db2" (format="csv", header=true)
---- 1
Exported database successfully.
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case2/demo-db2"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case2/demo-db2"
---- 1
Imported database successfully.
-STATEMENT MATCH (u:User) WHERE u.name = "Adam" SET u.age = 50
---- ok
-LOG ReturnAge
-STATEMENT MATCH (u:User) WHERE u.name="Adam" RETURN u.age
---- 1
50
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case2/demo-db2" (format="csv", header=true)
---- error
Runtime exception: Directory ${KUZU_EXPORT_DB_DIRECTORY}_case2/demo-db2 already exists.

-CASE ExportImportDatabaseWithPARQUET
-SKIP_WASM
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case3/demo-db3" (format="parquet")
---- ok
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case3/demo-db3"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case3/demo-db3"
---- ok
-STATEMENT MATCH (u:User) WHERE u.name = "Adam" SET u.age = 50
---- ok
-LOG ReturnAge
-STATEMENT MATCH (u:User) WHERE u.name="Adam" RETURN u.age
---- 1
50

-CASE ExportImportDatabaseError
-SKIP_WASM
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4" (format="npy")
---- error
Binder exception: Export database currently only supports csv and parquet files.

-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4" (format=false)
---- error
Binder exception: The type of format option must be a string.

-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4" (format="PARQUET", header=true)
---- error
Binder exception: Only export to csv can have options.

-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4" (header=true)
---- ok

-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db5"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db5"
---- error
Binder exception: Directory ${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db5 does not exist.

-REMOVE_FILE "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4/schema.cypher"
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4"
---- error(regex)
^Binder exception: File ${KUZU_EXPORT_DB_DIRECTORY}_case4/demo-db4[/\\]schema.cypher does not exist.$


-CASE ExportImportDatabaseRelGroup
-SKIP_WASM
-STATEMENT CREATE NODE TABLE A(ID INT64, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE NODE TABLE B(ID INT64, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE NODE TABLE End2(ID INT64, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE REL TABLE REL2(FROM A TO B, FROM B TO End2, num INT64);
---- ok
-STATEMENT CREATE REL TABLE REL3(FROM A TO B, FROM B TO End2);
---- ok
-STATEMENT CREATE (a:A{ID:0})-[:REL2_A_B {num: 1}]->(b:B{ID:1})-[:REL2_B_End2 {num: 2}]->(e:End2{ID:2});
---- ok
-STATEMENT MATCH (a:A{ID:0}), (b:B{ID:1}) CREATE (a)-[:REL3_A_B]->(b);
---- ok
-STATEMENT MATCH (a)-[r:REL2_A_B]->(b:B)
           RETURN a.ID;
---- 1
0
-STATEMENT MATCH (a)-[r:REL3_A_B]->(b:B)
           RETURN a.ID, b.ID;
---- 1
0|1
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case5/demo-db"
---- 1
Exported database successfully.
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case5/demo-db"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case5/demo-db"
---- 1
Imported database successfully.
-STATEMENT MATCH (a)-[r:REL3_A_B]->(b:B)
           RETURN a.ID, b.ID;
---- 1
0|1
-STATEMENT MATCH (u:User) WHERE u.name = "Adam" SET u.age = 50
---- ok
-LOG ReturnAge
-STATEMENT MATCH (u:User) WHERE u.name="Adam" RETURN u.age
---- 1
50
-STATEMENT MATCH (a)-[r:REL2_A_B]->(b:B)
           RETURN a.ID;
---- 1
0

-CASE ExportDatabaseWithSerialTable
-SKIP_WASM
-STATEMENT CREATE NODE TABLE oneserial(ID serial, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (o:oneserial)
---- ok
-STATEMENT CREATE (o:oneserial)
---- ok
-STATEMENT CREATE NODE TABLE twoserial(ID serial, prop STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (o:twoserial {prop: "Alice"})
---- ok
-STATEMENT CREATE (o:twoserial {prop: "Bob"})
---- ok
-STATEMENT CREATE (o:twoserial {prop: "Carol"})
---- ok
-STATEMENT CREATE (o:twoserial {prop: "Dan"})
---- ok
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case7/demo-db"
---- ok
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case7/demo-db"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case7/demo-db"
---- 1
Imported database successfully.
-STATEMENT MATCH (o:twoserial) RETURN o.*;
---- 4
0|Alice
1|Bob
2|Carol
3|Dan
-STATEMENT MATCH (o:oneserial) RETURN o.*;
---- 2
0
1
-STATEMENT CREATE (o:twoserial {prop: "Dan2"})
---- ok
-STATEMENT CREATE (o:oneserial)
---- ok
-STATEMENT MATCH (o:twoserial) RETURN o.*;
---- 5
0|Alice
1|Bob
2|Carol
3|Dan
4|Dan2
-STATEMENT MATCH (o:oneserial) RETURN o.*;
---- 3
0
1
2

-CASE DocExportImportExampleCSV
-SKIP_WASM
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case8/demo-db" (format="csv", header=true);
---- ok
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case8/demo-db"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case8/demo-db"
---- ok
-STATEMENT MATCH (u:User)-[:Follows]->(f:User) RETURN u.name, f.name;
---- 4
Adam|Karissa
Adam|Zhang
Karissa|Zhang
Zhang|Noura


-CASE DocExportImportExampleParquet
-SKIP_WASM
-STATEMENT Export Database "${KUZU_EXPORT_DB_DIRECTORY}_case9/demo-db" (format="parquet");
---- ok
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case9/demo-db"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_case9/demo-db"
---- ok
-STATEMENT MATCH (u:User)-[:Follows]->(f:User) RETURN u.name, f.name;
---- 4
Adam|Karissa
Adam|Zhang
Karissa|Zhang
Zhang|Noura

-CASE ExplainExport
-SKIP_WASM
-SKIP_IN_MEM
-STATEMENT EXPLAIN EXPORT Database "${KUZU_EXPORT_DB_DIRECTORY}_case10/demo-db" (format="parquet");
---- ok
-STATEMENT LOAD FROM "${KUZU_EXPORT_DB_DIRECTORY}_case9/demo-db/city.parquet" RETURN *
---- error
Binder exception: No file found that matches the pattern: ${KUZU_EXPORT_DB_DIRECTORY}_case9/demo-db/city.parquet.

-CASE ImportLegacyDB
-SKIP_WASM
-SKIP_IN_MEM
-STATEMENT IMPORT Database "${KUZU_ROOT_DIRECTORY}/dataset/import_db_legacy";
---- ok
-STATEMENT MATCH (p:person)-[:studyAt]->(o:organisation) RETURN p.fName, o.ID
---- 3
Alice|1
Bob|1
Farooq|1
