-DATASET CSV EMPTY

--

-CASE MismatchFromToType

-STATEMENT CREATE NODE TABLE N1 (id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE NODE TABLE N2 (id STRING PRIMARY KEY);
---- ok
-STATEMENT CREATE (:N2 {id:'Waterloo'}), (:N2 {id:'Kitchener'}), (:N2 {id:'Guelph'})
---- ok
-STATEMENT CREATE (:N2 {id:'150000'}), (:N2 {id:'200000'}), (:N2 {id:'75000'})
---- ok
-STATEMENT CREATE REL TABLE R1 (FROM N1 TO N1, p1 INT64);
---- ok
-STATEMENT CREATE REL TABLE R2 (FROM N2 TO N2);
---- ok
-STATEMENT COPY R1 FROM '${KUZU_ROOT_DIRECTORY}/dataset/demo-db/parquet/follows.parquet'
---- error
Conversion exception: Cast failed. Could not convert "Adam" to INT64.
-STATEMENT COPY R2 FROM '${KUZU_ROOT_DIRECTORY}/dataset/demo-db/parquet/city.parquet'
---- ok
-STATEMENT MATCH (a:N2)-[:R2]->(b:N2) RETURN a.id, b.id
---- 3
Guelph|75000
Kitchener|200000
Waterloo|150000
