-DATASET CSV EMPTY

--

-CASE CreateDeleteNodeInSingelStatement

-STATEMENT CREATE NODE TABLE A (id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE B (id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE REL TABLE R (FROM A TO B);
---- ok
-STATEMENT CREATE (a:A {id:0})-[:R]->(b:B {id:10})
---- ok
-STATEMENT CREATE (a:A {id:1})-[:R]->(b:B {id:11})
---- ok
-STATEMENT UNWIND [2,3] AS x
           CREATE (a:A {id:x})-[:R]->(b:B {id:10 + x})
           WITH b
           WHERE b.id = 12
           DETACH DELETE b
           RETURN b.id
---- 1
12
-STATEMENT MATCH (a)-[e]->(b) HINT a JOIN (e JOIN b) RETURN COUNT(*);
---- 1
3
-STATEMENT MATCH (a)-[e]->(b) HINT (a JOIN e) JOIN b RETURN COUNT(*);
---- 1
3

