-DATASET CSV EMPTY

--

-CASE CreateDeleteNodeInSingelStatement
-STATEMENT CREATE NODE TABLE A (id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE NODE TABLE B (id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE REL TABLE R (FROM A TO B);
---- ok
-STATEMENT CREATE (a:A {id:0})-[:R]->(b:B {id:10})
---- ok
-STATEMENT CREATE (a:A {id:1})-[:R]->(b:B {id:11})
---- ok
-STATEMENT UNWIND [2,3] AS x
           CREATE (a:A {id:x})-[:R]->(b:B {id:10 + x})
           WITH b
           WHERE b.id = 12
           DETACH DELETE b
           RETURN b.id
---- 1
12
-STATEMENT MATCH (a)-[e]->(b) HINT a JOIN (e JOIN b) RETURN COUNT(*);
---- 1
3
-STATEMENT MATCH (a)-[e]->(b) HINT (a JOIN e) JOIN b RETURN COUNT(*);
---- 1
3

-CASE MultipleDeletionsSingleTransaction
-STATEMENT CREATE NODE TABLE test(id INT64, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE (t:test {id:1});
---- ok
-STATEMENT CREATE (t:test {id:2});
---- ok
-STATEMENT CREATE (t:test {id:3});
---- ok
-STATEMENT CREATE (t:test {id:4});
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (t:test) WHERE t.id > 2 DELETE t;
---- ok
-STATEMENT MATCH (t:test) DELETE t;
---- ok
-STATEMENT MATCH (t:test) RETURN COUNT(t);
---- 1
0
-STATEMENT COMMIT;
---- ok
-STATEMENT MATCH (t:test) RETURN COUNT(t);
---- 1
0

-CASE DeleteFromFirstVector
-STATEMENT CREATE NODE TABLE test(id INT64, PRIMARY KEY(id));
---- ok
-STATEMENT UNWIND RANGE(1, 2048) AS x CREATE (t:test {id:x});
---- ok
-STATEMENT UNWIND RANGE(2049, 4000) AS x CREATE (t:test {id:x});
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT MATCH (t:test) WHERE t.id < 100 DELETE t;
---- ok
-STATEMENT MATCH (t:test) RETURN MIN(t.id), MAX(t.id);
---- 1
100|4000
