-DATASET CSV tinysnb

--

-CASE DeleteNodeAfterInsertTest
-STATEMENT CREATE (a:person {ID:100, fName:'Xiyang', age:26})
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 100 DELETE a
---- ok
-STATEMENT CREATE (a:person {ID:101})
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 101 RETURN a.ID, a.fName, a.age
---- 1
101||
-STATEMENT MATCH (a:person) WHERE a.ID = 0 DETACH DELETE a WITH a MATCH (b:person) WHERE b.ID < 6 RETURN a.ID, b.ID;
---- 3
0|2
0|3
0|5

-CASE MixedDeleteInsertTest
-STATEMENT CREATE (a:organisation {ID:30, mark:3.3})
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 1
|3.300000
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 DELETE a
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 0
-STATEMENT CREATE (a:organisation {ID:30, orgCode:33})
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 1
33|

-CASE MixedDeleteInsertTestAutoCheckpoint
-STATEMENT CALL auto_checkpoint=true
---- ok
-STATEMENT CALL checkpoint_threshold=0
---- ok
-STATEMENT CREATE (a:organisation {ID:30, mark:3.3})
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 1
|3.300000
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 DELETE a
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 0
-STATEMENT CREATE (a:organisation {ID:30, orgCode:33})
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.ID = 30 RETURN a.orgCode, a.mark
---- 1
33|

-CASE DeleteNodeMultiLabel1
-STATEMENT MATCH (a:person)-[e]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
5
-STATEMENT MATCH (a)-[e]->(b) DELETE e
---- ok
-STATEMENT MATCH (a:person:organisation) WHERE a.ID > 1 AND a.ID < 10 DELETE a
---- ok
-STATEMENT MATCH (a:person:organisation) RETURN a.ID
---- 3
0
1
10
-STATEMENT MATCH (a:person:organisation) DELETE a
---- ok
-STATEMENT MATCH (a:person:organisation) RETURN COUNT(*)
---- 1
0

-CASE RedundantNodeDeletions
-STATEMENT MATCH (a:person {ID: 3})-[e]->() DELETE e
---- ok
-STATEMENT MATCH (a:person {ID: 3})<-[e]-() DELETE e
---- ok
-STATEMENT MATCH (a:person {ID: 3}), (b:person {ID: 3}) DELETE a, b
---- ok
-STATEMENT MATCH (a:person) RETURN a.ID
---- 7
0
2
5
7
8
9
10

-CASE OptionalDelete
-STATEMENT OPTIONAL MATCH (a:person) WHERE a.ID > 100 DELETE a;
---- ok
-STATEMENT MATCH (a:person) RETURN COUNT(*)
---- 1
8
-STATEMENT OPTIONAL MATCH (a) WHERE a.ID > 100 DELETE a;
---- ok
-STATEMENT MATCH (a) RETURN COUNT(*)
---- 1
14

## This can produce exception messages with different connected rel table on different platforms.
#-CASE DeleteNodeWithConnectedRels
#-STATEMENT MATCH (a:person {ID: 0}) DELETE a
#---- error(regex)
#^Runtime exception: Node\(nodeOffset: 0\) has connected edges in table (knows|studyAt|meets|marries) in the fwd direction, which cannot be deleted\. Please delete the edges first or try DETACH DELETE\.$
#-STATEMENT MATCH (o:organisation {ID: 6}) DELETE o
#---- error
#Runtime exception: Node(nodeOffset: 2) has connected edges in table workAt in the bwd direction, which cannot be deleted. Please delete the edges first or try DETACH DELETE.

-CASE MultiLabelDetachDeleteNode
-STATEMENT MATCH (a)-[e]->(b) RETURN COUNT(*)
---- 1
30
-STATEMENT MATCH (a) DETACH DELETE a;
---- ok
-STATEMENT MATCH (a) RETURN COUNT(*)
---- 1
0
-STATEMENT MATCH (a)-[e]->(b) RETURN COUNT(*)
---- 1
0

-CASE OptionalDetachDeleteNode
-STATEMENT OPTIONAL MATCH (a:person) WHERE a.ID > 100 DETACH DELETE a;
---- ok
-STATEMENT MATCH (a:person) RETURN COUNT(*)
---- 1
8

-CASE DeleteNodeWithSemiMaskBug
-STATEMENT MATCH (a) WHERE a.ID = 0 OR a.ID = 3 OR a.ID= 5 DETACH DELETE a;
---- ok
-STATEMENT MATCH (a:person)-[:knows]->(b:person) WHERE b.ID = 2 RETURN a.fName, b.fName;
---- 0
#