-NAME moduloFunctionOnDoubleDoubleTest
-QUERY MATCH (a:organisation) RETURN a.orgCode % a.rating
---- 3
0.000000
0.340000
0.320000

-NAME powerFunctionOnUnstrIntUnstrIntTest
-QUERY MATCH (a:organisation) RETURN (a.unstrInt64Prop % 7) ^ abs(a.unstrInt64Prop)
---- 3
59049.000000
256.000000


-NAME sinFunctionOnDoubleTest
-QUERY MATCH (a:organisation) WHERE a.name <> 'abc' RETURN sin(a.mark) 
---- 3
-0.529836
-0.818277
-0.818277

-NAME sinFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN sin(a.orgCode)
---- 3
-0.988036
-0.811656
0.785018

-NAME sinFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) WHERE a.name <> 'good' RETURN sin(a.unstrInt64Prop) 
---- 3
-0.544021
0.756802


-NAME sinFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN sin(a.unstrNumericProp)
---- 3
0.066322
-0.157746


-NAME cosFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN cos(a.mark)
---- 3
-0.848100
-0.574824
-0.574824
-NAME cosFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN cos(a.orgCode)
---- 3
-0.154222
-0.584135
0.619473

-NAME cosFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN cos(a.unstrInt64Prop)
---- 3
-0.839072
-0.653644


-NAME cosFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN cos(a.unstrNumericProp)
---- 3
0.997798
-0.987480


-NAME tanFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN tan(a.mark)
---- 3
0.624733
1.423526
1.423526

-NAME tanFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN tan(a.orgCode)
---- 3
6.406598
1.389500
1.267234

-NAME tanFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN tan(a.unstrInt64Prop)
---- 3
0.648361
-1.157821


-NAME tanFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN tan(a.unstrNumericProp)
---- 3
0.066468
0.159746


-NAME cotFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN cot(a.mark)
---- 3
1.600684
0.702481
0.702481

-NAME cotFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN cot(a.orgCode)
---- 3
0.156089
0.719683
0.789120

-NAME cotFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN cot(a.unstrInt64Prop)
---- 3
1.542351
-0.863691


-NAME cotFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN cot(a.unstrNumericProp)
---- 3
15.044779
6.259948


-NAME asinFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN asin(a.rating)
---- 3
1.570796
0.894666
0.546851

-NAME asinFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN asin(a.orgCode % 2 - 1)
---- 3
0.000000
-1.570796
-1.570796

-NAME asinFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN asin(a.unstrInt64Prop % 2 - 1)
---- 3
-1.570796
-1.570796


-NAME asinFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN asin(a.unstrNumericProp / 14)
---- 3
-1.103650
0.237953


-NAME acosFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN acos(a.rating)
---- 3
0.000000
0.676131
1.023945

-NAME acosFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN acos(a.orgCode % 2 - 1)
---- 3
1.570796
3.141593
3.141593

-NAME acosFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN acos(a.unstrInt64Prop % 2 - 1)
---- 3
3.141593
3.141593


-NAME acosFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN acos(a.unstrNumericProp / 14)
---- 3
2.674447
1.332843


-NAME atanFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN atan(a.rating)
---- 3
0.785398
0.662426
0.479519

-NAME atanFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN atan(a.orgCode % 2 - 1)
---- 3
0.000000
-0.785398
-0.785398

-NAME atanFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN atan(a.unstrInt64Prop % 2 - 1)
---- 3
-0.785398
-0.785398


-NAME atanFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN atan(a.unstrNumericProp / 14)
---- 3
-0.728855
0.231489

-NAME evenFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN even(a.mark)
---- 3
4
6
6

-NAME evenFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN even(a.orgCode)
---- 3
326
934
824

-NAME evenFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN even(a.unstrInt64Prop)
---- 3
10
-4


-NAME evenFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN even(a.unstrNumericProp)
---- 3
-14
4

-NAME factorialFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN factorial(a.orgCode % 20)
---- 3
120
24
87178291200

-NAME factorialFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN factorial(a.unstrInt64Prop + 4)
---- 3
87178291200
1


-NAME signFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN sign(a.mark)
---- 3
1
1
1

-NAME signFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN sign(a.orgCode)
---- 3
1
1
1

-NAME signFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN sign(a.unstrInt64Prop)
---- 3
1
-1


-NAME signFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN sign(a.unstrNumericProp)
---- 3
-1
1

-NAME sqrtFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN sqrt(a.mark)
---- 3
1.923538
2.024846
2.024846

-NAME sqrtFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN sqrt(a.orgCode)
---- 3
18.027756
30.561414
28.705400

-NAME sqrtFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN sqrt(a.unstrInt64Prop + 6)
---- 3
1.414214
4.000000


-NAME sqrtFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN sqrt(a.unstrNumericProp + 13.5)
---- 3
1.000000
4.098780


-NAME cbrtFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN cbrt(a.mark)
---- 3
1.546680
1.600521
1.600521

-NAME cbrtFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN cbrt(a.orgCode)
---- 3
6.875344
9.774974
9.375096

-NAME cbrtFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN cbrt(a.unstrInt64Prop)
---- 3
2.154435
-1.587401


-NAME cbrtFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN cbrt(a.unstrNumericProp)
---- 3
-2.320794
1.488806


-NAME gammaFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN gamma(a.mark)
---- 3
4.170652
6.812623
6.812623

-NAME gammaFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN gamma(a.orgCode % 10)
---- 3
24
6
6

-NAME gammaFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN gamma(a.unstrInt64Prop + 7)
---- 3
20922789888000
2

-NAME gammaFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN gamma(abs(a.unstrNumericProp) - 3)
---- 3
119292.461995
2.991569

-NAME lgammaFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN lgamma(a.mark)
---- 3
1.428072
1.918777
1.918777

-NAME lgammaFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN lgamma(a.orgCode)
---- 3
1552.770467
5451.570283
4706.038471

-NAME lgammaFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN lgamma(a.unstrInt64Prop + 5)
---- 3
0.000000
25.191221


-NAME lnFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN ln(a.mark)
---- 3
1.308333
1.410987
1.410987

-NAME lnFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN ln(a.orgCode)
---- 3
5.783825
6.839476
6.714171

-NAME lnFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN ln(a.unstrInt64Prop + 5)
---- 3
2.708050
0.000000


-NAME lnFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN ln(a.unstrNumericProp + 13.2)
---- 3
-0.356675
2.803360


-NAME logFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN log(a.mark)
---- 3
0.568202
0.612784
0.612784

-NAME logFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN log(a.orgCode)
---- 3
2.511883
2.970347
2.915927

-NAME logFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN log(a.unstrInt64Prop + 5)
---- 3
1.176091
0.000000


-NAME logFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN log(a.unstrNumericProp + 13.2)
---- 3
-0.154902
1.217484


-NAME log2FunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN log2(a.mark)
---- 3
1.887525
2.035624
2.035624

-NAME log2FunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN log2(a.orgCode)
---- 3
8.344296
9.867279
9.686501

-NAME log2FunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN log2(a.unstrInt64Prop + 5)
---- 3
3.906891
0.000000


-NAME log2FunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN log2(a.unstrNumericProp + 13.2)
---- 3
-0.514573
4.044394


-NAME degreesFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN degrees(a.mark)
---- 3
211.994384
234.912696
234.912696

-NAME degreesFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN degrees(a.orgCode)
---- 3
18621.128342
53514.258065
47211.722319

-NAME degreesFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN degrees(a.unstrInt64Prop)
---- 3
572.957795
-229.183118


-NAME degreesFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN degrees(a.unstrNumericProp)
---- 3
-716.197244
189.076072


-NAME radiansFunctionOnDoubleTest
-QUERY MATCH (a:organisation) RETURN radians(a.mark)
---- 3
0.064577
0.071558
0.071558

-NAME radiansFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN radians(a.orgCode)
---- 3
5.672320
16.301375
14.381513

-NAME radiansFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN radians(a.unstrInt64Prop)
---- 3
0.174533
-0.069813


-NAME radiansFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN radians(a.unstrNumericProp)
---- 3
-0.218166
0.057596


-NAME atan2FunctionOnDoubleDoubleTest
-QUERY MATCH (a:organisation) RETURN atan2(a.mark, a.mark)
---- 3
0.785398
0.785398
0.785398

-NAME atan2FunctionOnDoubleInt64Test
-QUERY MATCH (a:organisation) RETURN atan2(a.mark, a.orgCode)
---- 3
0.011384
0.004390
0.004976

-NAME atan2FunctionOnInt64Int64Test
-QUERY MATCH (a:organisation) RETURN atan2(a.orgCode, a.orgCode)
---- 3
0.785398
0.785398
0.785398

-NAME atan2FunctionOnInt64DoubleTest
-QUERY MATCH (a:organisation) RETURN atan2(a.orgCode, a.mark)
---- 3
1.559412
1.566407
1.565821

-NAME atan2FunctionOnUnstrInt64DoubleTest
-QUERY MATCH (a:organisation) RETURN atan2(a.unstrInt64Prop, a.unstrNumericProp)
---- 3
1.252049



-NAME atan2FunctionOnUnstrDoubleUnstrDoubleTest
-QUERY MATCH (a:organisation) RETURN atan2(a.unstrNumericProp, a.unstrNumericProp)
---- 3
-2.356194

0.785398

-NAME atan2FunctionOnUnstrDoubleUnstrIntTest
-QUERY MATCH (a:organisation) RETURN atan2(a.unstrNumericProp, a.unstrInt64Prop)
---- 3


0.318748

-NAME roundFunctionOnDoubleTest
-QUERY MATCH (a:organisation) WHERE a.ID <> 2 RETURN round(a.rating, 1)
---- 3
0.800000
0.500000
1.000000

-NAME roundFunctionOnInt64Test
-QUERY MATCH (a:organisation) RETURN round(a.orgCode, 2)
---- 3
325.000000
824.000000
934.000000

-NAME roundFunctionOnUnstrDoubleTest
-QUERY MATCH (a:organisation) WHERE a.ID <> 2 RETURN round(a.unstrNumericProp, a.unstrInt64Prop)
---- 3
3.300000



-NAME roundFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN round(a.unstrInt64Prop, 3)
---- 3
-4.000000
10.000000


-NAME bitwiseXorFunctionOnInt64Test
-QUERY MATCH (a:organisation) WHERE a.ID <> 2 RETURN bitwise_xor(a.orgCode, a.score)
---- 3
-325
-966
831

-NAME bitwiseXorFunctionOnUnstrInt64Test
-QUERY MATCH (a:organisation) RETURN bitwise_xor(a.unstrInt64Prop, a.unstrInt64Prop)
---- 3
0
0


-NAME piFunctionAddStrIntTest
-QUERY MATCH (a:organisation) RETURN a.orgCode + pi()
---- 3
328.141593
937.141593
827.141593

-NAME piFunctionAddUnstrNumericalValTest
-QUERY MATCH (a:person) RETURN a.unstrNumericProp + pi()
---- 8
50.141593
55.141593
71.141593






-NAME AbsFunctionStrInt
-QUERY MATCH (a:organisation) RETURN abs(a.score)
---- 3
100
2
7

-NAME AbsFunctionUnstrValue
-QUERY MATCH (a:organisation) RETURN abs(a.unstrNumericProp)
---- 3

12.500000
3.300000

-NAME FloorFunctionStrInt
-QUERY MATCH (a:organisation) RETURN floor(a.score)
---- 3
-2
-100
7

-NAME FloorFunctionUnstrValue
-QUERY MATCH (a:organisation) RETURN floor(a.unstrNumericProp)
---- 3
-13.000000

3.000000

-NAME CeilFunctionStrInt
-QUERY MATCH (a:organisation) RETURN ceil(a.score)
---- 3
-2
-100
7

-NAME CeilFunctionUnstrValue
-QUERY MATCH (a:organisation) RETURN ceiling(a.unstrNumericProp)
---- 3
-12.000000

4.000000

-NAME CeilFloorFunctionTest
-QUERY MATCH (a:organisation) RETURN ceil(ceil(a.unstrNumericProp + abs(-0.5)) + floor(3.5))
---- 3

-9.000000
7.000000
