-NAME StructuredDateDayNameFuncTest
-QUERY MATCH (p:person) RETURN dayname(p.birthdate)
---- 8
Monday
Monday
Saturday
Sunday
Sunday
Sunday
Sunday
Tuesday

-NAME UnstructuredDateDayNameFuncTest
-QUERY MATCH (p:person) RETURN dayname(p.unstrDateProp)
---- 8
Tuesday
Tuesday
Saturday






-NAME StructuredDateMonthNameFuncTest
-QUERY MATCH (p:person) RETURN monthname(p.birthdate)
---- 8
January
January
June
July
October
October
October
November

-NAME UnstructuredDateMonthNameFuncTest
-QUERY MATCH (p:person) RETURN monthname(p.unstrDateProp)
---- 8
July
February
February






-NAME StructuredDateLastDayFuncTest
-QUERY MATCH (p:person) RETURN lastday(p.birthdate)
---- 8
1900-01-31
1900-01-31
1940-06-30
1950-07-31
1980-10-31
1980-10-31
1980-10-31
1990-11-30

-NAME UnstructuredDateLastDayFuncTest
-QUERY MATCH (p:person) RETURN lastday(p.unstrDateProp)
---- 8
1952-07-31
2019-02-28
2020-02-29






-NAME StructuredDateExtractYearFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.birthdate, "year")
---- 8
1900
1900
1940
1950
1980
1980
1980
1990

-NAME UnstructuredDateExtractYearFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.unstrDateProp, "YEAR")
---- 8
1952
2019
2020






-NAME StructuredDateExtractMonthFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.birthdate, "month")
---- 8
1
1
6
7
10
10
10
11

-NAME UnstructuredDateExtractMonthFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.unstrDateProp, "month")
---- 8
7
2
2





-NAME StructuredDateExtractDayFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.birthdate, "Day")
---- 8
1
1
22
23
26
26
26
27

-NAME UnstructuredDateExtractDayFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.unstrDateProp, "daY")
---- 8
15
12
29






-NAME StructuredDateExtractDecadeFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.birthdate, "decadE")
---- 8
190
190
194
195
198
198
198
199

-NAME UnstructuredDateExtractDecadeFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.unstrDateProp, "decAde")
---- 8
195
201
202






-NAME StructuredDateExtractCenturyFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.birthdate, "cenTury")
---- 8
19
19
20
20
20
20
20
20

-NAME UnstructuredDateExtractCenturyFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.unstrDateProp, "Century")
---- 8
20
21
21






-NAME StructuredDateExtractMillenniumFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.birthdate, "millenniuM")
---- 8
2
2
2
2
2
2
2
2

-NAME UnstructuredDateExtractMillenniumFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.unstrDateProp, "millennIum")
---- 8
2
3
3






-NAME StructuredDateExtractQuarterFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.birthdate, "quarTer")
---- 8
1
1
2
3
4
4
4
4

-NAME UnstructuredDateExtractQuarterFuncTest
-QUERY MATCH (p:person) RETURN datepart(p.unstrDateProp, "Quarter")
---- 8
3
1
1






-NAME StructuredDateTruncYearFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.birthdate, "year")
---- 8
1900-01-01
1900-01-01
1940-01-01
1950-01-01
1980-01-01
1980-01-01
1980-01-01
1990-01-01

-NAME UnstructuredDateTruncYearFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.unstrDateProp, "YEAR")
---- 8
1952-01-01
2019-01-01
2020-01-01






-NAME StructuredDateTruncMonthFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.birthdate, "month")
---- 8
1900-01-01
1900-01-01
1940-06-01
1950-07-01
1980-10-01
1980-10-01
1980-10-01
1990-11-01

-NAME UnstructuredDateTruncMonthFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.unstrDateProp, "month")
---- 8
1952-07-01
2019-02-01
2020-02-01





-NAME StructuredDateTruncDayFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.birthdate, "Day")
---- 8
1900-01-01
1900-01-01
1940-06-22
1950-07-23
1980-10-26
1980-10-26
1980-10-26
1990-11-27

-NAME UnstructuredDateTruncDayFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.unstrDateProp, "daY")
---- 8
1952-07-15
2019-02-12
2020-02-29






-NAME StructuredDateTruncDecadeFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.birthdate, "decadE")
---- 8
1900-01-01
1900-01-01
1940-01-01
1950-01-01
1980-01-01
1980-01-01
1980-01-01
1990-01-01

-NAME UnstructuredDateTruncDecadeFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.unstrDateProp, "decAde")
---- 8
1950-01-01
2010-01-01
2020-01-01






-NAME StructuredDateTruncCenturyFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.birthdate, "cenTury")
---- 8
1900-01-01
1900-01-01
1900-01-01
1900-01-01
1900-01-01
1900-01-01
1900-01-01
1900-01-01

-NAME UnstructuredDateTruncCenturyFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.unstrDateProp, "Century")
---- 8
1900-01-01
2000-01-01
2000-01-01






-NAME StructuredDateTruncMillenniumFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.birthdate, "millenniuM")
---- 8
1000-01-01
1000-01-01
1000-01-01
1000-01-01
1000-01-01
1000-01-01
1000-01-01
1000-01-01

-NAME UnstructuredDateTruncMillenniumFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.unstrDateProp, "millennIum")
---- 8
1000-01-01
2000-01-01
2000-01-01






-NAME StructuredDateTruncQuarterFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.birthdate, "quarTer")
---- 8
1900-01-01
1900-01-01
1940-04-01
1950-07-01
1980-10-01
1980-10-01
1980-10-01
1990-10-01

-NAME UnstructuredDateTruncQuarterFuncTest
-QUERY MATCH (p:person) RETURN datetrunc(p.unstrDateProp, "Quarter")
---- 8
1952-07-01
2019-01-01
2020-01-01






-NAME StructuredDateGreatestFuncTest
-QUERY MATCH (p:person) RETURN greatest(p.birthdate, date("1980-10-02"))
---- 8
1980-10-02
1980-10-02
1980-10-02
1980-10-02
1980-10-26
1980-10-26
1980-10-26
1990-11-27

-NAME UnstructuredDateGreatestFuncTest
-QUERY MATCH (p:person) RETURN greatest(p.unstrDateProp, date("1975-12-22"))
---- 8
1975-12-22
2019-02-12
2020-02-29






-NAME StructuredDateLeastFuncTest
-QUERY MATCH (p:person) RETURN least(p.birthdate, date("1980-10-02"))
---- 8
1900-01-01
1900-01-01
1940-06-22
1950-07-23
1980-10-02
1980-10-02
1980-10-02
1980-10-02

-NAME UnstructuredDateLeastFuncTest
-QUERY MATCH (p:person) RETURN least(p.unstrDateProp, date("1975-12-22"))
---- 8
1952-07-15
1975-12-22
1975-12-22





