-NAME StructuredIntervalExtractYearFuncTest
-QUERY MATCH (p:person) RETURN date_part("yeAr", p.lastJobDuration)
---- 8
3
10
0
10
0
0
10
3

-NAME UnstructuredIntervalExtractYearFuncTest
-QUERY MATCH (p:person) RETURN date_part("Y", p.unstrIntervalProp)
---- 8
5
0







-NAME StructuredIntervalExtractMonthFuncTest
-QUERY MATCH (p:person) RETURN date_part("month", p.lastJobDuration)
---- 8
0
5
0
5
0
0
5
0

-NAME UnstructuredIntervalExtractMonthFuncTest
-QUERY MATCH (p:person) RETURN date_part("months", p.unstrIntervalProp)
---- 8
0
0







-NAME StructuredIntervalExtractDayFuncTest
-QUERY MATCH (p:person) RETURN date_part("day", p.lastJobDuration)
---- 8
2
0
0
0
0
0
0
2

-NAME UnstructuredIntervalExtractDayFuncTest
-QUERY MATCH (p:person) RETURN date_part("day", p.unstrIntervalProp)
---- 8
700
300







-NAME StructuredIntervalExtractDecadeFuncTest
-QUERY MATCH (p:person) RETURN date_part("Decade", p.lastJobDuration)
---- 8
0
1
0
1
0
0
1
0

-NAME UnstructuredIntervalExtractDecadeFuncTest
-QUERY MATCH (p:person) RETURN date_part("decade", p.unstrIntervalProp)
---- 8
0
0







-NAME StructuredIntervalExtractCenturyFuncTest
-QUERY MATCH (p:person) RETURN date_part("century", p.lastJobDuration)
---- 8
0
0
0
0
0
0
0
0

-NAME UnstructuredIntervalExtractCenturyFuncTest
-QUERY MATCH (p:person) RETURN date_part("century", p.unstrIntervalProp)
---- 8
0
0







-NAME StructuredIntervalExtractMillenniumFuncTest
-QUERY MATCH (p:person) RETURN date_part("MILLENNIUM", p.lastJobDuration)
---- 8
0
0
0
0
0
0
0
0

-NAME UnstructuredIntervalExtractMillenniumFuncTest
-QUERY MATCH (p:person) RETURN date_part("MILLENNIUM", p.unstrIntervalProp)
---- 8
0
0







-NAME StructuredIntervalExtractQuarterFuncTest
-QUERY MATCH (p:person) RETURN date_part("QUARTER", p.lastJobDuration)
---- 8
1
2
1
2
1
1
2
1

-NAME UnstructuredIntervalExtractQuarterFuncTest
-QUERY MATCH (p:person) RETURN date_part("QUARTER", p.unstrIntervalProp)
---- 8
1
1







-NAME StructuredIntervalExtractMicrosecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("MICROSECOND", p.lastJobDuration)
---- 8
0
24
11000000
24
11000000
24000
24
0

-NAME UnstructuredIntervalExtractMicrosecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("MICROSECOND", p.unstrIntervalProp)
---- 8
0
1000







-NAME StructuredIntervalExtractMillisecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("MILLISECOND", p.lastJobDuration)
---- 8
0
0
11000
0
11000
24
0
0

-NAME UnstructuredIntervalExtractMillisecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("MILLISECOND", p.unstrIntervalProp)
---- 8
0
1







-NAME StructuredIntervalExtractSecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("second", p.lastJobDuration)
---- 8
0
0
11
0
11
0
0
0

-NAME UnstructuredIntervalExtractSecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("seconds", p.unstrIntervalProp)
---- 8
0
0







-NAME StructuredIntervalExtractMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_part("minutes", p.lastJobDuration)
---- 8
2
0
24
0
24
18
0
2

-NAME UnstructuredIntervalExtractMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_part("minute", p.unstrIntervalProp)
---- 8
0
40







-NAME StructuredIntervalExtractHourFuncTest
-QUERY MATCH (p:person) RETURN date_part("hours", p.lastJobDuration)
---- 8
13
13
48
13
48
0
13
13

-NAME UnstructuredIntervalExtractHourFuncTest
-QUERY MATCH (p:person) RETURN date_part("hour", p.unstrIntervalProp)
---- 8
5000
50







-NAME StructuredInt64ToYearFuncTest
-QUERY MATCH (p:person) RETURN to_years(p.age)
---- 8
35 years
30 years
45 years
20 years
20 years
25 years
40 years
83 years

-NAME UnstructuredInt64ToYearFuncTest
-QUERY MATCH (p:person) RETURN to_years(p.unstrInt64Prop2)
---- 8
20 years
43 years







-NAME StructuredInt64ToMonthsFuncTest
-QUERY MATCH (p:person) RETURN to_months(p.age)
---- 8
2 years 11 months
2 years 6 months
3 years 9 months
1 year 8 months
1 year 8 months
2 years 1 month
3 years 4 months
6 years 11 months

-NAME UnstructuredInt64ToMonthsFuncTest
-QUERY MATCH (p:person) RETURN to_months(p.unstrInt64Prop2)
---- 8
1 year 8 months
3 years 7 months







-NAME StructuredInt64ToDaysFuncTest
-QUERY MATCH (p:person) RETURN to_days(p.age)
---- 8
35 days
30 days
45 days
20 days
20 days
25 days
40 days
83 days

-NAME UnstructuredInt64ToDaysFuncTest
-QUERY MATCH (p:person) RETURN to_days(p.unstrInt64Prop2)
---- 8
20 days
43 days







-NAME StructuredInt64ToHoursFuncTest
-QUERY MATCH (p:person) RETURN to_hours(p.age)
---- 8
35:00:00
30:00:00
45:00:00
20:00:00
20:00:00
25:00:00
40:00:00
83:00:00

-NAME UnstructuredInt64ToHoursFuncTest
-QUERY MATCH (p:person) RETURN to_hours(p.unstrInt64Prop2)
---- 8
20:00:00
43:00:00







-NAME StructuredInt64ToMinutesFuncTest
-QUERY MATCH (p:person) RETURN to_minutes(p.age)
---- 8
00:35:00
00:30:00
00:45:00
00:20:00
00:20:00
00:25:00
00:40:00
01:23:00

-NAME UnstructuredInt64ToMinutesFuncTest
-QUERY MATCH (p:person) RETURN to_minutes(p.unstrInt64Prop2)
---- 8
00:20:00
00:43:00







-NAME StructuredInt64ToSecondsFuncTest
-QUERY MATCH (p:person) RETURN to_seconds(p.age)
---- 8
00:00:35
00:00:30
00:00:45
00:00:20
00:00:20
00:00:25
00:00:40
00:01:23

-NAME UnstructuredInt64ToSecondsFuncTest
-QUERY MATCH (p:person) RETURN to_seconds(p.unstrInt64Prop2)
---- 8
00:00:20
00:00:43







-NAME StructuredInt64ToMillisecondsFuncTest
-QUERY MATCH (p:person) RETURN to_milliseconds(p.age)
---- 8
00:00:00.035
00:00:00.03
00:00:00.045
00:00:00.02
00:00:00.02
00:00:00.025
00:00:00.04
00:00:00.083

-NAME UnstructuredInt64ToMillisecondsFuncTest
-QUERY MATCH (p:person) RETURN to_milliseconds(p.unstrInt64Prop2)
---- 8
00:00:00.02
00:00:00.043







-NAME StructuredInt64ToMicrosecondsFuncTest
-QUERY MATCH (p:person) RETURN to_microseconds(p.age)
---- 8
00:00:00.000035
00:00:00.00003
00:00:00.000045
00:00:00.00002
00:00:00.00002
00:00:00.000025
00:00:00.00004
00:00:00.000083

-NAME UnstructuredInt64ToMicrosecondsFuncTest
-QUERY MATCH (p:person) RETURN to_microseconds(p.unstrInt64Prop2)
---- 8
00:00:00.00002
00:00:00.000043






