# description: string functions test

-NAME ContainsReturn
-QUERY MATCH (a:person) RETURN a.fName, a.fName CONTAINS "a" ORDER BY a.fName
---- 8
Alice|False
Bob|False
Carol|True
Dan|True
Elizabeth|True
Farooq|True
Greg|False
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|True

-NAME ContainsSelect
-QUERY MATCH (a:person) WHERE a.fName CONTAINS "B" RETURN a.fName
---- 2
Bob
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-NAME ContainsSelect2
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE NOT a.fName CONTAINS b.fName RETURN COUNT(*)
---- 1
14

-NAME StartsWithReturn1
-QUERY MATCH (a:person) RETURN a.fName, a.fName STARTS WITH "A" ORDER BY a.fName
---- 8
Alice|True
Bob|False
Carol|False
Dan|False
Elizabeth|False
Farooq|False
Greg|False
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|False

-NAME StartsWithReturn2
-QUERY MATCH (a:person) RETURN a.label1, a.label1 STARTS WITH "g" ORDER BY a.fName
---- 8
excellent|False
good|True
good|True
good|True
|
|
|
|

-NAME StartsWithSelect
-QUERY MATCH (a:person) WHERE a.fName STARTS WITH "C" RETURN a.fName
---- 1
Carol

-NAME LowerOnStructuredStr
-QUERY MATCH (a:organisation) return lower(a.name)
---- 3
abfsuni
cswork
deswork

-NAME LowerOnUnStructuredStr
-QUERY MATCH (a:organisation) return lower(a.unstrStrProp)
---- 3
 very good
 not good


-NAME UpperOnStructuredStr
-QUERY MATCH (a:organisation) return upper(a.name)
---- 3
ABFSUNI
CSWORK
DESWORK

-NAME UpperOnUnStructuredStr
-QUERY MATCH (a:organisation) return upper(a.unstrStrProp)
---- 3
 VERY GOOD
 NOT GOOD


-NAME LtrimOnUnStructuredStr
-QUERY MATCH (a:organisation) return ltrim(a.unstrStrProp)
---- 3
vEry good
not goOd


-NAME RtrimOnUnStructuredStr
-QUERY MATCH (a:organisation) return rtrim(a.unstrStrProp)
---- 3
 vEry good
 not goOd


-NAME LengthOnStructuredStr
-QUERY MATCH (a:organisation) return length(a.name)
---- 3
7
6
7

-NAME LengthOnUnStructuredStr
-QUERY MATCH (a:organisation) return length(a.unstrStrProp)
---- 3
9
10


-NAME ReverseOnStructuredStr
-QUERY MATCH (a:organisation) return reverse(a.name)
---- 3
inUsFBA
kroWsC
kroWsED


-NAME ReverseOnUnStructuredStr
-QUERY MATCH (a:organisation) return reverse(a.unstrStrProp)
---- 3

dOog ton 
doog yrEv 
