-NAME StructuredTimestampExtractYearFuncTest
-QUERY MATCH (p:person) RETURN date_part("yeAr", p.registerTime)
---- 8
2011
2008
1911
2031
1976
1972
1976
2023

-NAME UnstructuredTimestampExtractYearFuncTest
-QUERY MATCH (p:person) RETURN date_part("Y", p.unstrTimestampProp1)
---- 8
2031
1946
1962
2023





-NAME StructuredTimestampExtractMicroFuncTest
-QUERY MATCH (p:person) RETURN date_part("microSeconds", p.registerTime)
---- 8
30000000
30000526
21000000
30000000
42000000
30678559
42000000
30000000

-NAME UnstructuredTimestampExtractMicroFuncTest
-QUERY MATCH (p:person) RETURN date_part("microsecond", p.unstrTimestampProp2)
---- 8
42000000
30000526







-NAME StructuredTimestampExtractMsFuncTest
-QUERY MATCH (p:person) RETURN date_part("millisEcond", p.registerTime)
---- 8
30000
30000
21000
30000
42000
30678
42000
30000

-NAME UnstructuredTimestampExtractMsFuncTest
-QUERY MATCH (p:person) RETURN date_part("miLlisEconds", p.unstrTimestampProp2)
---- 8
42000
30000







-NAME StructuredTimestampExtractSecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("seConds", p.registerTime)
---- 8
30
30
21
30
42
30
42
30

-NAME UnstructuredTimestampExtractSecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("seCOND", p.unstrTimestampProp2)
---- 8
42
30







-NAME StructuredTimestampExtractMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_part("minute", p.registerTime)
---- 8
25
25
32
25
21
22
21
25

-NAME UnstructuredTimestampExtractMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_part("miNutes", p.unstrTimestampProp2)
---- 8
21
25







-NAME StructuredTimestampExtractHourFuncTest
-QUERY MATCH (p:person) RETURN date_part("hours", p.registerTime)
---- 8
11
13
2
12
11
13
11
13

-NAME UnstructuredTimestampExtractHourFuncTest
-QUERY MATCH (p:person) RETURN date_part("Hour", p.unstrTimestampProp2)
---- 8
11
13







-NAME StructuredTimestampTruncDayFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Day", p.registerTime)
---- 8
2011-08-20 00:00:00
2008-11-03 00:00:00
1911-08-20 00:00:00
2031-11-30 00:00:00
1976-12-23 00:00:00
1972-07-31 00:00:00
1976-12-23 00:00:00
2023-02-21 00:00:00

-NAME UnstructuredTimestampTruncDayFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("daY", p.unstrTimestampProp2)
---- 8
1976-12-23 00:00:00
2008-11-03 00:00:00







-NAME StructuredTimestampTruncMicrosecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("MIcroseCond", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 13:25:30.000526
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30.678559
1976-12-23 11:21:42
2023-02-21 13:25:30

-NAME UnstructuredTimestampTruncMicrosecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("MIcroseconds", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:42
2008-11-03 13:25:30.000526







-NAME StructuredTimestampTruncMillisecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("mIlliSecond", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 13:25:30
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30.678
1976-12-23 11:21:42
2023-02-21 13:25:30

-NAME UnstructuredTimestampTruncMillisecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("mIlliSeconds", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:42
2008-11-03 13:25:30







-NAME StructuredTimestampTruncSecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("secOnds", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 13:25:30
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30
1976-12-23 11:21:42
2023-02-21 13:25:30

-NAME UnstructuredTimestampTruncSecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("secondS", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:42
2008-11-03 13:25:30







-NAME StructuredTimestampTruncMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Minutes", p.registerTime)
---- 8
2011-08-20 11:25:00
2008-11-03 13:25:00
1911-08-20 02:32:00
2031-11-30 12:25:00
1976-12-23 11:21:00
1972-07-31 13:22:00
1976-12-23 11:21:00
2023-02-21 13:25:00

-NAME UnstructuredTimestampTruncMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("minutes", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:00
2008-11-03 13:25:00







-NAME StructuredTimestampTruncHourFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Hours", p.registerTime)
---- 8
2011-08-20 11:00:00
2008-11-03 13:00:00
1911-08-20 02:00:00
2031-11-30 12:00:00
1976-12-23 11:00:00
1972-07-31 13:00:00
1976-12-23 11:00:00
2023-02-21 13:00:00

-NAME UnstructuredTimestampTruncHourFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("houRs", p.unstrTimestampProp2)
---- 8
1976-12-23 11:00:00
2008-11-03 13:00:00







-NAME StructuredTimestampCenturyFuncTest
-QUERY MATCH (p:person) RETURN century(p.registerTime)
---- 8
21
21
20
21
20
20
20
21

-NAME UnstructuredTimestampCenturyFuncTest
-QUERY MATCH (p:person) RETURN century(p.unstrTimestampProp2)
---- 8
20
21







-NAME StructuredTimestampDaynameFuncTest
-QUERY MATCH (p:person) RETURN dayname(p.registerTime)
---- 8
Saturday
Monday
Sunday
Sunday
Thursday
Monday
Thursday
Tuesday

-NAME UnstructuredTimestampDaynameFuncTest
-QUERY MATCH (p:person) RETURN dayname(p.unstrTimestampProp2)
---- 8
Thursday
Monday







-NAME StructuredTimestampMonthNameFuncTest
-QUERY MATCH (p:person) RETURN monthname(p.registerTime)
---- 8
August
November
August
November
December
July
December
February

-NAME UnstructuredTimestampMonthNameFuncTest
-QUERY MATCH (p:person) RETURN monthname(p.unstrTimestampProp2)
---- 8
December
November







-NAME StructuredTimestampLastDayFuncTest
-QUERY MATCH (p:person) RETURN last_day(p.registerTime)
---- 8
2011-08-31
2008-11-30
1911-08-31
2031-11-30
1976-12-31
1972-07-31
1976-12-31
2023-02-28

-NAME UnstructuredTimestampLastDayFuncTest
-QUERY MATCH (p:person) RETURN last_day(p.unstrTimestampProp2)
---- 8
1976-12-31
2008-11-30







-NAME StructuredInt64EpochMsFuncTest
-QUERY MATCH (p:person) RETURN epoch_ms(p.age)
---- 8
1970-01-01 00:00:00.035
1970-01-01 00:00:00.03
1970-01-01 00:00:00.045
1970-01-01 00:00:00.02
1970-01-01 00:00:00.02
1970-01-01 00:00:00.025
1970-01-01 00:00:00.04
1970-01-01 00:00:00.083

-NAME UnstructuredInt64EpochMsFuncTest
-QUERY MATCH (p:person) RETURN epoch_ms(p.unstrInt64Prop)
---- 8
1970-01-06 05:20:44.124
1970-01-01 01:15:41.124
1970-01-01 01:13:32.124






-NAME StructuredInt64ToTimestampFuncTest
-QUERY MATCH (p:person) RETURN to_timestamp(p.age)
---- 8
1970-01-01 00:00:35
1970-01-01 00:00:30
1970-01-01 00:00:45
1970-01-01 00:00:20
1970-01-01 00:00:20
1970-01-01 00:00:25
1970-01-01 00:00:40
1970-01-01 00:01:23

-NAME UnstructuredInt64ToTimestampFuncTest
-QUERY MATCH (p:person) RETURN to_timestamp(p.unstrInt64Prop)
---- 8
1984-04-19 17:35:24
1970-02-22 13:25:24
1970-02-21 01:35:24






-NAME StructuredTimestampGreatestFuncTest
-QUERY MATCH (p:person) RETURN greatest(p.registerTime, timestamp("2006-02-12 11:25:33"))
---- 8
2011-08-20 11:25:30
2008-11-03 13:25:30.000526
2006-02-12 11:25:33
2031-11-30 12:25:30
2006-02-12 11:25:33
2006-02-12 11:25:33
2006-02-12 11:25:33
2023-02-21 13:25:30

-NAME UnstructuredTimestampGreatestFuncTest
-QUERY MATCH (p:person) RETURN greatest(p.unstrTimestampProp2, timestamp("1986-02-12 11:25:33"))
---- 8
1986-02-12 11:25:33
2008-11-03 13:25:30.000526







-NAME StructuredTimestampLeastFuncTest
-QUERY MATCH (p:person) RETURN least(p.registerTime, timestamp("2006-02-12 11:25:33"))
---- 8
2006-02-12 11:25:33
2006-02-12 11:25:33
1911-08-20 02:32:21
2006-02-12 11:25:33
1976-12-23 11:21:42
1972-07-31 13:22:30.678559
1976-12-23 11:21:42
2006-02-12 11:25:33

-NAME UnstructuredTimestampLeastFuncTest
-QUERY MATCH (p:person) RETURN least(p.unstrTimestampProp2, timestamp("1986-02-12 11:25:33"))
---- 8
1976-12-23 11:21:42
1986-02-12 11:25:33



