-DATASET CSV gds-all-sp-large

--
-CASE AllSPDestinationsDoNotReturnLengths
-STATEMENT PROJECT GRAPH PK (person1, knows11)
           MATCH (a:person1) WHERE a.ID = 1
           CALL all_sp_destinations(PK, a, 4, true)
           RETURN length, count(*);
---- error
Binder exception: Variable length is not in scope.

-CASE AllSPLengthsDoNotReturnPathNodeIDs
-STATEMENT PROJECT GRAPH PK (person1, knows11)
           MATCH (a:person1) WHERE a.ID = 1
           CALL all_sp_lengths(PK, a, 4, true)
           RETURN length, pathNodeIDs;
---- error
Binder exception: Variable pathNodeIDs is not in scope.

-CASE AllSPLengthsSingleLabel
-STATEMENT PROJECT GRAPH PK (person1, knows11)
           MATCH (a:person1) WHERE a.ID = 1
           CALL all_sp_lengths(PK, a, 40, true)
           RETURN length, count(*);
---- 5
0|1
1|10
2|100
3|1000
4|10000