-DATASET CSV gds-all-sp-paths

--

-CASE SingleSPPathsBasic
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL all_sp_lengths(PK, a, 40, true)
           RETURN a.ID, _node.ID, length;
---- 13
0|0|0
0|10|1
0|20|1
0|300|2
0|300|2
0|4000|3
0|4000|3
0|5000|3
0|5000|3
0|6000|4
0|6000|4
0|6000|4
0|6000|4
