-DATASET CSV gds-all-sp-small

--

-CASE AllSPDestinationsBasic
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL all_sp_destinations(PK, a, 30, true)
           RETURN a.ID, _node.ID;
---- 13
0|0
0|10
0|20
0|300
0|300
0|4000
0|4000
0|5000
0|5000
0|60000
0|60000
0|60000
0|60000

-CASE AllSPLengthsBasic
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL all_sp_lengths(PK, a, 30, true)
           RETURN a.ID, _node.ID, length;
---- 13
0|0|0
0|10|1
0|20|1
0|300|2
0|300|2
0|4000|3
0|4000|3
0|5000|3
0|5000|3
0|60000|4
0|60000|4
0|60000|4
0|60000|4

#-CASE AllSPPathsBasic
#-STATEMENT PROJECT GRAPH PK (person, knows)
#           MATCH (a:person) WHERE a.ID = 0
#           CALL all_sp_paths(PK, a, 30, true)
#           WHERE length <= 1
#           RETURN a.ID, _node.ID, length, pathNodeIDs;
#---- 3
#0|0|0|[]
#0|10|1|[]
#0|20|1|[]
