-DATASET CSV tinysnb

--

-CASE BasicAlgorithm

-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID < 6
           CALL VAR_LEN_JOINS(PK, a, 1, 2, "FWD")
           RETURN a.fName, COUNT(*);
---- 4
Alice|12
Bob|12
Carol|12
Dan|12
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID < 6
           CALL VAR_LEN_JOINS(PK, a, 1, 2, "BWD")
           RETURN a.fName, COUNT(*);
---- 4
Alice|12
Bob|12
Carol|12
Dan|12
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID < 6
           CALL VAR_LEN_JOINS(PK, a, 1, 2, "BOTH")
           RETURN a.fName, COUNT(*);
---- 4
Alice|42
Bob|42
Carol|42
Dan|42
-STATEMENT PROJECT GRAPH PK (person {age}, knows) CALL variable_length_path(PK, 1, 1) RETURN *;
---- error
Parser exception: Filtering or projecting properties in graph projection is not supported.
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS(PK, a, 2, "FWD")
           RETURN a.fName, _node.name, length;
---- error
Binder exception: Cannot find property name for _node.
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS(PK, a, 2, "X")
           RETURN a.fName, _node.name, length;
---- error
Runtime exception: Cannot parse X as ExtendDirection.
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS(PK, a, 2, "FWD")
           RETURN a.fName, _node.fName, length;
---- 3
Alice|Bob|1
Alice|Carol|1
Alice|Dan|1
-STATEMENT PROJECT GRAPH PK (person, organisation, workAt, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS(PK, a, 2, "FWD")
           RETURN a.fName, _node.fName, _node.name, length;
---- 5
Alice|Bob||1
Alice|Carol||1
Alice|Dan||1
Alice||CsWork|2
Alice||DEsWork|2
-STATEMENT PROJECT GRAPH PK (person, knows) CALL weakly_connected_component(PK) RETURN _node.fName, group_id;
---- 8
Alice|0
Bob|0
Carol|0
Dan|0
Elizabeth|4
Farooq|4
Greg|4
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|7
-STATEMENT PROJECT GRAPH PK (person, organisation, knows, workAt) CALL weakly_connected_component(PK) RETURN _node.fName, _node.name, group_id;
---- 11
Alice||1
Bob||1
Carol||1
Dan||1
Elizabeth||1
Farooq||1
Greg||1
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff||10
|ABFsUni|0
|CsWork|1
|DEsWork|1
-STATEMENT PROJECT GRAPH PK (person, knows) CALL page_rank(PK) RETURN _node.fName, rank;
---- 8
Alice|0.125000
Bob|0.125000
Carol|0.125000
Dan|0.125000
Elizabeth|0.022734
Farooq|0.018750
Greg|0.018750
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|0.018750

-STATEMENT CALL enable_gds = true;
---- ok
-STATEMENT MATCH p = (a:person)-[e:knows*1..2]->(b:person) WHERE a.ID = 0 RETURN properties(nodes(p),'fName'), properties(rels(p), 'date'), properties(rels(e), '_src'), properties(rels(e), '_dst'), a.fName, b.fName
---- 12
[Alice,Bob,Alice]|[2021-06-30,2021-06-30]|[0:0,0:1]|[0:1,0:0]|Alice|Alice
[Alice,Bob,Carol]|[2021-06-30,1950-05-14]|[0:0,0:1]|[0:1,0:2]|Alice|Carol
[Alice,Bob,Dan]|[2021-06-30,1950-05-14]|[0:0,0:1]|[0:1,0:3]|Alice|Dan
[Alice,Bob]|[2021-06-30]|[0:0]|[0:1]|Alice|Bob
[Alice,Carol,Alice]|[2021-06-30,2021-06-30]|[0:0,0:2]|[0:2,0:0]|Alice|Alice
[Alice,Carol,Bob]|[2021-06-30,1950-05-14]|[0:0,0:2]|[0:2,0:1]|Alice|Bob
[Alice,Carol,Dan]|[2021-06-30,2000-01-01]|[0:0,0:2]|[0:2,0:3]|Alice|Dan
[Alice,Carol]|[2021-06-30]|[0:0]|[0:2]|Alice|Carol
[Alice,Dan,Alice]|[2021-06-30,2021-06-30]|[0:0,0:3]|[0:3,0:0]|Alice|Alice
[Alice,Dan,Bob]|[2021-06-30,1950-05-14]|[0:0,0:3]|[0:3,0:1]|Alice|Bob
[Alice,Dan,Carol]|[2021-06-30,2000-01-01]|[0:0,0:3]|[0:3,0:2]|Alice|Carol
[Alice,Dan]|[2021-06-30]|[0:0]|[0:3]|Alice|Dan
-STATEMENT MATCH p = (a:person)-[e:knows* 3..3]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
27
-STATEMENT MATCH p = (a:person)-[e:knows* TRAIL 3..3]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
24
# 3 * 3 * 2
-STATEMENT MATCH p = (a:person)-[e:knows* ACYCLIC 4..4]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
54

-STATEMENT CALL enable_gds = false;
---- ok
-STATEMENT MATCH p = (a:person)-[e:knows*1..2]->(b:person) WHERE a.ID = 0 RETURN properties(nodes(p),'fName'), properties(rels(p), 'date'), properties(rels(e), '_src'), properties(rels(e), '_dst'), a.fName, b.fName
---- 12
[Alice,Bob,Alice]|[2021-06-30,2021-06-30]|[0:0,0:1]|[0:1,0:0]|Alice|Alice
[Alice,Bob,Carol]|[2021-06-30,1950-05-14]|[0:0,0:1]|[0:1,0:2]|Alice|Carol
[Alice,Bob,Dan]|[2021-06-30,1950-05-14]|[0:0,0:1]|[0:1,0:3]|Alice|Dan
[Alice,Bob]|[2021-06-30]|[0:0]|[0:1]|Alice|Bob
[Alice,Carol,Alice]|[2021-06-30,2021-06-30]|[0:0,0:2]|[0:2,0:0]|Alice|Alice
[Alice,Carol,Bob]|[2021-06-30,1950-05-14]|[0:0,0:2]|[0:2,0:1]|Alice|Bob
[Alice,Carol,Dan]|[2021-06-30,2000-01-01]|[0:0,0:2]|[0:2,0:3]|Alice|Dan
[Alice,Carol]|[2021-06-30]|[0:0]|[0:2]|Alice|Carol
[Alice,Dan,Alice]|[2021-06-30,2021-06-30]|[0:0,0:3]|[0:3,0:0]|Alice|Alice
[Alice,Dan,Bob]|[2021-06-30,1950-05-14]|[0:0,0:3]|[0:3,0:1]|Alice|Bob
[Alice,Dan,Carol]|[2021-06-30,2000-01-01]|[0:0,0:3]|[0:3,0:2]|Alice|Carol
[Alice,Dan]|[2021-06-30]|[0:0]|[0:3]|Alice|Dan