# Original single label graph, which consists of person1 and knows11 edges looks as follows:
# p1_0->p1_1->p1_2->p1_3->p1_4 and 2 "shortcut" edges directly from p1_2->p1_4.
# There are 2 copies of the nodes used throughout the tests: person1 and person2. These get internal table_id_t's 0 and 1.
# There are 4 copies of the edges used throughout the tests: knows11, knows12, knows21, and knows22. knows{i}{j}
# connect person{i} to person{j} with the same structure.
# Multilabel1 graph: contains knows12 and knows21.
# Multilabel2 graph: contains knows11, knows12, knows21, knows22.
-DATASET CSV gds-rec-joins-small

--

-CASE GDSSmall

-LOG RJLimitPushDown
-STATEMENT MATCH p = (a:person1)-[e:knows11*2..2]->(b:person1) HINT (a JOIN e) JOIN b WITH b LIMIT 1 RETURN COUNT(*);
---- 1
1

-STATEMENT MATCH p = (b:person1)<-[e:knows11*3..3]-(a:person1)-[e2:knows11*2..2]->(c:person1)
        WHERE a.ID = 0
        RETURN properties(nodes(p),'ID')
---- 3
[3,2,1,0,1,2]
[4,2,1,0,1,2]
[4,2,1,0,1,2]
-STATEMENT MATCH p = (a:person1)-[e:knows11*3..3]-(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[0,1,0,1]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[0,1,2,1]|[2:0,2:1,2:1]|[0:0,0:1,0:1]|[0:1,0:2,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*3..3]-(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[0,1,0,1]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[0,1,2,1]|[2:0,2:1,2:1]|[0:0,0:1,0:1]|[0:1,0:2,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (b:person1)-[e:knows11*3..3]-(a:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[1,0,1,0]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[1,2,1,0]|[2:1,2:1,2:0]|[0:1,0:1,0:0]|[0:2,0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
-STATEMENT MATCH p = (b:person1)-[e:knows11*3..3]-(a:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[1,0,1,0]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[1,2,1,0]|[2:1,2:1,2:0]|[0:1,0:1,0:0]|[0:2,0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]

-STATEMENT MATCH p = (b:person1)<-[e:knows11*1..4]-(a:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[1,0]|[2:0]|[0:0]|[0:1]
0|2|[2,1,0]|[2:1,2:0]|[0:1,0:0]|[0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]

-STATEMENT MATCH p = (b:person1)<-[e:knows11*1..4]-(a:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[1,0]|[2:0]|[0:0]|[0:1]
0|2|[2,1,0]|[2:1,2:0]|[0:1,0:0]|[0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE n.age < 15)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'age')
---- 2
0|1|[0,10]
0|2|[0,10,20]

---- ok
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE n.age < 35)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'age')
---- 6
0|1|[0,10]
0|2|[0,10,20]
0|3|[0,10,20,30]
0|4|[0,10,20,30,40]
0|4|[0,10,20,40]
0|4|[0,10,20,40]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE n.age < 35)]->(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'age')
---- 6
0|1|[0,10]
0|2|[0,10,20]
0|3|[0,10,20,30]
0|4|[0,10,20,30,40]
0|4|[0,10,20,40]
0|4|[0,10,20,40]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE r.score  < 1)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), 'score')
---- 0
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE r.score < 5)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), 'score')
---- 4
0|1|[0,1]|[1]
0|2|[0,1,2]|[1,2]
0|3|[0,1,2,3]|[1,2,3]
0|4|[0,1,2,3,4]|[1,2,3,4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE r.score >=1 AND r.score < 3)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), 'score')
---- 2
0|1|[0,1]|[1]
0|2|[0,1,2]|[1,2]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (a:person1)<-[e:knows11*1..4]-(b:person1)
        WHERE a.ID = 4
        HINT (a JOIN e) JOIN b
        RETURN a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 10
4|0|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]
4|1|[4,2,1]|[2:4,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,2,1]|[2:5,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,3,2,1]|[2:3,2:2,2:1]|[0:3,0:2,0:1]|[0:4,0:3,0:2]
4|2|[4,2]|[2:4]|[0:2]|[0:4]
4|2|[4,2]|[2:5]|[0:2]|[0:4]
4|2|[4,3,2]|[2:3,2:2]|[0:3,0:2]|[0:4,0:3]
4|3|[4,3]|[2:3]|[0:3]|[0:4]
-STATEMENT MATCH p = (a:person1)<-[e:knows11*1..4]-(b:person1)
        WHERE a.ID = 4
        HINT a JOIN (e JOIN b)
        RETURN a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 10
4|0|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]
4|1|[4,2,1]|[2:4,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,2,1]|[2:5,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,3,2,1]|[2:3,2:2,2:1]|[0:3,0:2,0:1]|[0:4,0:3,0:2]
4|2|[4,2]|[2:4]|[0:2]|[0:4]
4|2|[4,2]|[2:5]|[0:2]|[0:4]
4|2|[4,3,2]|[2:3,2:2]|[0:3,0:2]|[0:4,0:3]
4|3|[4,3]|[2:3]|[0:3]|[0:4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..2]-(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 3
0|0|[0,1,0]|[2:0,2:0]|[0:0,0:0]|[0:1,0:1]
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]

-STATEMENT CALL create_projected_graph('PK1', ['person1'], ['knows11'])
---- ok
-LOG VarLenJoinsUBLessThanLBError
-STATEMENT MATCH (a:person1)-[e:knows11 * 2..1]->(b:person1) RETURN *;
---- error
Binder exception: Lower bound of rel e is greater than upperBound.
-LOG VarLenJoinsUBTooHighError
-STATEMENT MATCH (a:person1)-[e:knows11 * 1..10000]->(b:person1) RETURN *;
---- error
Binder exception: Upper bound of rel e exceeds maximum: 30.

-LOG ShortestPathsJoinsUBNonPositiveError
-STATEMENT MATCH (a:person1)-[e:knows11 * ALL SHORTEST 0..1]->(b:person1) RETURN *;
---- error
Binder exception: Lower bound of shortest/all_shortest path must be 1.

-LOG VarLenJoins
-STATEMENT MATCH (a:person1)-[e:knows11 * 1..30]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 6
0|1|1|[]|[1]
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,6]
0|4|4|[1,2,3]|[1,2,3,4]
-STATEMENT MATCH (a:person1)<-[e:knows11 * 1..30]-(b:person1) WHERE a.ID=4
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 10
4|0|3|[2,1]|[5,2,1]
4|0|3|[2,1]|[6,2,1]
4|0|4|[3,2,1]|[4,3,2,1]
4|1|2|[2]|[5,2]
4|1|2|[2]|[6,2]
4|1|3|[3,2]|[4,3,2]
4|2|1|[]|[5]
4|2|1|[]|[6]
4|2|2|[3]|[4,3]
4|3|1|[]|[4]
-STATEMENT MATCH (a:person1)-[e:knows11 * 1..2]-(b:person1) WHERE a.ID=1
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 7
1|0|1|[]|[1]
1|1|2|[0]|[1,1]
1|1|2|[2]|[2,2]
1|2|1|[]|[2]
1|3|2|[2]|[2,3]
1|4|2|[2]|[2,5]
1|4|2|[2]|[2,6]

-STATEMENT CALL create_projected_graph('PK2', ['person1', 'person2'], ['knows12', 'knows21'])
---- ok
-LOG VarLenJoinsMultilabel1
-STATEMENT MATCH (a:person1)-[e:knows12|:knows21 * 1..30]->(b:person2:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 6
0|1|1|[]|[1]
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,6]
0|4|4|[1,2,3]|[1,2,3,4]

-STATEMENT CALL create_projected_graph('PK3', ['person1', 'person2'], ['knows11', 'knows12', 'knows21', 'knows22'])
---- ok
-LOG VarLenJoinsMultilabel2
-STATEMENT MATCH (a:person1)-[e * 1..30]->(b:person2:person1) WHERE a.ID=0
           RETURN length(e), COUNT(*);
---- 4
1|2
2|4
3|24
4|16

-LOG VarLenJoinsLowerBoundZeroUpperBoundOne
-STATEMENT MATCH (a:person1)-[e:knows11 * 0..2]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 3
0|0|0|[]|[]
0|1|1|[]|[1]
0|2|2|[1]|[1,2]

-LOG VarLenJoinsLowerBoundZeroUpperBoundZero
-STATEMENT MATCH (a:person1)-[e:knows11 * 0..0]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 1
0|0|0|[]|[]

-LOG VarLenJoinsLowerBound1
-STATEMENT MATCH (a:person1)-[e:knows11 * 2..3]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 4
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,6]

-LOG VarLenJoinsLowerBound2
-STATEMENT MATCH (a:person1)-[e:knows11 * 4..30]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 1
0|4|4|[1,2,3]|[1,2,3,4]

-LOG VarLenJoinsEmptyPaths
-STATEMENT MATCH (a:person1)-[e:knows11 * 1..4]->(b:person1) WHERE a.ID=4
           RETURN a.ID, b.ID, length(e), properties(nodes(e), 'id'), properties(rels(e), 'score');
---- 0

-LOG AllSPDestinations
-STATEMENT MATCH (a:person1)-[e:knows11 * ALL SHORTEST 1..30]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID;
---- 5
0|1
0|2
0|3
0|4
0|4

-LOG AllSPDestinationsMultilabel1
-STATEMENT MATCH (a:person1)-[e:knows12|:knows21 * ALL SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID;
---- 6
0|1
0|2
0|3
0|4
0|4
0|4

-LOG AllSPDestinationsMultilabel2
-STATEMENT MATCH (a:person1)-[e * ALL SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID;
---- 30
0|1
0|1
0|2
0|2
0|2
0|2
0|3
0|3
0|3
0|3
0|3
0|3
0|3
0|3
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4

-LOG AllSPLengths
-STATEMENT MATCH (a:person1)-[e:knows11 * ALL SHORTEST 1..30]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e);
---- 5
0|1|1
0|2|2
0|3|3
0|4|3
0|4|3

-LOG AllSPLengthsMultilabel1
-STATEMENT MATCH (a:person1)-[e:knows12|knows21 * ALL SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e);
---- 6
0|1|1
0|2|2
0|3|3
0|4|3
0|4|3
0|4|4

-LOG AllSPLengthsMultilabel2
-STATEMENT MATCH (a:person1)-[e * ALL SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e);
---- 30
0|1|1
0|1|1
0|2|2
0|2|2
0|2|2
0|2|2
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3

-LOG AllSPPaths
-STATEMENT MATCH (a:person1)-[e:knows11 * ALL SHORTEST 1..5]->(b:person1) WHERE a.ID=0
            RETURN a.ID, b.ID, length(e), properties(nodes(e),'ID'), properties(rels(e), 'score');
---- 5
0|1|1|[]|[1]
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,6]
-STATEMENT MATCH (a:person1)-[e:knows11 * ALL SHORTEST 1..5]-(b:person1) WHERE a.ID=4
            RETURN a.ID, b.ID, length(e), properties(nodes(e),'ID'), properties(rels(e), 'score');
---- 7
4|0|3|[2,1]|[5,2,1]
4|0|3|[2,1]|[6,2,1]
4|1|2|[2]|[5,2]
4|1|2|[2]|[6,2]
4|2|1|[]|[5]
4|2|1|[]|[6]
4|3|1|[]|[4]

-LOG AllSPPathsMultilabel1
-STATEMENT MATCH (a:person1)-[e:knows12|:knows21 * ALL SHORTEST 1..30]->(b) WHERE a.ID=0
            RETURN a.ID, b.ID, length(e), properties(nodes(e),'ID'), properties(rels(e), 'score');
---- 6
0|1|1|[]|[1]
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,6]
0|4|4|[1,2,3]|[1,2,3,4]

-LOG AllSPPathsMultilabel2
-STATEMENT MATCH (a:person1)-[e * ALL SHORTEST 1..30]->(b) WHERE a.ID=0
            RETURN a.ID, b.ID, length(e), properties(nodes(e),'ID'), properties(rels(e), 'score');
---- 30
0|1|1|[]|[1]
0|1|1|[]|[1]
0|2|2|[1]|[1,2]
0|2|2|[1]|[1,2]
0|2|2|[1]|[1,2]
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|3|3|[1,2]|[1,2,3]
0|3|3|[1,2]|[1,2,3]
0|3|3|[1,2]|[1,2,3]
0|3|3|[1,2]|[1,2,3]
0|3|3|[1,2]|[1,2,3]
0|3|3|[1,2]|[1,2,3]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,5]
0|4|3|[1,2]|[1,2,6]
0|4|3|[1,2]|[1,2,6]
0|4|3|[1,2]|[1,2,6]
0|4|3|[1,2]|[1,2,6]
0|4|3|[1,2]|[1,2,6]
0|4|3|[1,2]|[1,2,6]
0|4|3|[1,2]|[1,2,6]
0|4|3|[1,2]|[1,2,6]

-LOG SingleSPDestinations
-STATEMENT MATCH (a:person1)-[e:knows11 * SHORTEST 1..30]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID;
---- 4
0|1
0|2
0|3
0|4

-LOG SingleSPDestinationsMultilabel1
-STATEMENT MATCH (a:person1)-[e:knows12|:knows21 * SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID;
---- 5
0|1
0|2
0|3
0|4
0|4

-LOG SingleSPDestinationsMultilabel2
-STATEMENT MATCH (a:person1)-[e * SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID;
---- 8
0|1
0|1
0|2
0|2
0|3
0|3
0|4
0|4

-LOG SingleSPLengths
-STATEMENT MATCH (a:person1)-[e:knows11 * SHORTEST 1..30]->(b:person1) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e);
---- 4
0|1|1
0|2|2
0|3|3
0|4|3

-LOG SingleSPLengthsMultilabel1
-STATEMENT MATCH (a:person1)-[e:knows12|:knows21 * SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e);
---- 5
0|1|1
0|2|2
0|3|3
0|4|3
0|4|4

-LOG SingleSPLengthsMultilabel2
-STATEMENT MATCH (a:person1)-[e * SHORTEST 1..30]->(b) WHERE a.ID=0
           RETURN a.ID, b.ID, length(e);
---- 8
0|1|1
0|1|1
0|2|2
0|2|2
0|3|3
0|3|3
0|4|3
0|4|3

-LOG SingleSPPaths
-STATEMENT MATCH (a:person1)-[e:knows11 * SHORTEST 1..5]->(b:person1) WHERE a.ID=0
            RETURN a.ID, b.ID, length(e), properties(nodes(e),'ID'), properties(rels(e), 'score');
---- 4
0|1|1|[]|[1]
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
-STATEMENT MATCH (a:person1)-[e:knows11 * SHORTEST 1..5]-(b:person1) WHERE a.ID=2
            RETURN a.ID, b.ID, length(e), properties(nodes(e),'ID'), properties(rels(e), 'score');
---- 4
2|0|2|[1]|[2,1]
2|1|1|[]|[2]
2|3|1|[]|[3]
2|4|1|[]|[5]

-LOG SingleSPPathsMultilabel1
-STATEMENT MATCH (a:person1)-[e:knows12|:knows21 * SHORTEST 1..5]->(b) WHERE a.ID=0
            RETURN a.ID, b.ID, length(e), properties(nodes(e),'ID'), properties(rels(e), 'score');
---- 5
0|1|1|[]|[1]
0|2|2|[1]|[1,2]
0|3|3|[1,2]|[1,2,3]
0|4|3|[1,2]|[1,2,5]
0|4|4|[1,2,3]|[1,2,3,4]

-LOG SingleSPPathsMultilabel2
-STATEMENT MATCH (a:person1)-[e * SHORTEST 1..5]->(b) WHERE a.ID=0
            RETURN length(e), COUNT(*);
---- 3
1|2
2|2
3|4
