# Original single label graph, which consists of person1 and knows11 edges looks as follows:
# p1_0->p1_1->p1_2->p1_3->p1_4 and 2 "shortcut" edges directly from p1_2->p1_4.
# There are 2 copies of the nodes used throughout the tests: person1 and person2. These get internal table_id_t's 0 and 1.
# There are 4 copies of the edges used throughout the tests: knows11, knows12, knows21, and knows22. knows{i}{j}
# connect person{i} to person{j} with the same structure.
# Multilabel1 graph: contains knows12 and knows21.
# Multilabel2 graph: contains knows11, knows12, knows21, knows22.
-DATASET CSV gds-rec-joins-small

--

-CASE GDSSmall

-STATEMENT MATCH p = (b:person1)<-[e:knows11*3..3]-(a:person1)-[e2:knows11*2..2]->(c:person1)
        WHERE a.ID = 0
        RETURN properties(nodes(p),'ID')
---- 3
[3,2,1,0,1,2]
[4,2,1,0,1,2]
[4,2,1,0,1,2]
-STATEMENT MATCH p = (a:person1)-[e:knows11*3..3]-(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[0,1,0,1]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[0,1,2,1]|[2:0,2:1,2:1]|[0:0,0:1,0:1]|[0:1,0:2,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*3..3]-(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[0,1,0,1]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[0,1,2,1]|[2:0,2:1,2:1]|[0:0,0:1,0:1]|[0:1,0:2,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (b:person1)-[e:knows11*3..3]-(a:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[1,0,1,0]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[1,2,1,0]|[2:1,2:1,2:0]|[0:1,0:1,0:0]|[0:2,0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
-STATEMENT MATCH p = (b:person1)-[e:knows11*3..3]-(a:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 5
0|1|[1,0,1,0]|[2:0,2:0,2:0]|[0:0,0:0,0:0]|[0:1,0:1,0:1]
0|1|[1,2,1,0]|[2:1,2:1,2:0]|[0:1,0:1,0:0]|[0:2,0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]

-STATEMENT MATCH p = (b:person1)<-[e:knows11*1..4]-(a:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[1,0]|[2:0]|[0:0]|[0:1]
0|2|[2,1,0]|[2:1,2:0]|[0:1,0:0]|[0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]

-STATEMENT MATCH p = (b:person1)<-[e:knows11*1..4]-(a:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[1,0]|[2:0]|[0:0]|[0:1]
0|2|[2,1,0]|[2:1,2:0]|[0:1,0:0]|[0:2,0:1]
0|3|[3,2,1,0]|[2:2,2:1,2:0]|[0:2,0:1,0:0]|[0:3,0:2,0:1]
0|4|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
0|4|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE n.age < 15)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'age')
---- 2
0|1|[0,10]
0|2|[0,10,20]

---- ok
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE n.age < 35)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'age')
---- 6
0|1|[0,10]
0|2|[0,10,20]
0|3|[0,10,20,30]
0|4|[0,10,20,30,40]
0|4|[0,10,20,40]
0|4|[0,10,20,40]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE n.age < 35)]->(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'age')
---- 6
0|1|[0,10]
0|2|[0,10,20]
0|3|[0,10,20,30]
0|4|[0,10,20,30,40]
0|4|[0,10,20,40]
0|4|[0,10,20,40]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE r.score  < 1)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), 'score')
---- 0
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE r.score < 5)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), 'score')
---- 4
0|1|[0,1]|[1]
0|2|[0,1,2]|[1,2]
0|3|[0,1,2,3]|[1,2,3]
0|4|[0,1,2,3,4]|[1,2,3,4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4 (r, n | WHERE r.score >=1 AND r.score < 3)]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), 'score')
---- 2
0|1|[0,1]|[1]
0|2|[0,1,2]|[1,2]

-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT a JOIN (e JOIN b)
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..4]->(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 6
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]
0|3|[0,1,2,3]|[2:0,2:1,2:2]|[0:0,0:1,0:2]|[0:1,0:2,0:3]
0|4|[0,1,2,3,4]|[2:0,2:1,2:2,2:3]|[0:0,0:1,0:2,0:3]|[0:1,0:2,0:3,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:4]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
0|4|[0,1,2,4]|[2:0,2:1,2:5]|[0:0,0:1,0:2]|[0:1,0:2,0:4]
-STATEMENT MATCH p = (a:person1)<-[e:knows11*1..4]-(b:person1)
        WHERE a.ID = 4
        HINT (a JOIN e) JOIN b
        RETURN a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 10
4|0|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]
4|1|[4,2,1]|[2:4,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,2,1]|[2:5,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,3,2,1]|[2:3,2:2,2:1]|[0:3,0:2,0:1]|[0:4,0:3,0:2]
4|2|[4,2]|[2:4]|[0:2]|[0:4]
4|2|[4,2]|[2:5]|[0:2]|[0:4]
4|2|[4,3,2]|[2:3,2:2]|[0:3,0:2]|[0:4,0:3]
4|3|[4,3]|[2:3]|[0:3]|[0:4]
-STATEMENT MATCH p = (a:person1)<-[e:knows11*1..4]-(b:person1)
        WHERE a.ID = 4
        HINT a JOIN (e JOIN b)
        RETURN a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 10
4|0|[4,2,1,0]|[2:4,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,2,1,0]|[2:5,2:1,2:0]|[0:2,0:1,0:0]|[0:4,0:2,0:1]
4|0|[4,3,2,1,0]|[2:3,2:2,2:1,2:0]|[0:3,0:2,0:1,0:0]|[0:4,0:3,0:2,0:1]
4|1|[4,2,1]|[2:4,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,2,1]|[2:5,2:1]|[0:2,0:1]|[0:4,0:2]
4|1|[4,3,2,1]|[2:3,2:2,2:1]|[0:3,0:2,0:1]|[0:4,0:3,0:2]
4|2|[4,2]|[2:4]|[0:2]|[0:4]
4|2|[4,2]|[2:5]|[0:2]|[0:4]
4|2|[4,3,2]|[2:3,2:2]|[0:3,0:2]|[0:4,0:3]
4|3|[4,3]|[2:3]|[0:3]|[0:4]
-STATEMENT MATCH p = (a:person1)-[e:knows11*1..2]-(b:person1)
        WHERE a.ID = 0
        HINT (a JOIN e) JOIN b
        RETURN  a.ID, b.ID, properties(nodes(p),'ID'), properties(rels(e), '_id'), properties(rels(e), '_src'), properties(rels(e), '_dst')
---- 3
0|0|[0,1,0]|[2:0,2:0]|[0:0,0:0]|[0:1,0:1]
0|1|[0,1]|[2:0]|[0:0]|[0:1]
0|2|[0,1,2]|[2:0,2:1]|[0:0,0:1]|[0:1,0:2]

-STATEMENT CALL create_project_graph('PK1', ['person1'], ['knows11'])
---- ok
-LOG VarLenJoinsUBLessThanLBError
-STATEMENT MATCH (a:person1)
           CALL var_len_joins('PK1', a, 2, 1, "FWD")
           RETURN *;
---- error
Runtime exception: Lower bound length of recursive join operations need to be less than or equal to upper bound. Given lower bound is: 2 and upper bound is: 1.

-LOG VarLenJoinsUBTooHighError
-STATEMENT MATCH (a:person1)
           CALL var_len_joins('PK1', a, 1, 10000,"FWD")
           RETURN *;
---- error
Runtime exception: Recursive join operations only works for non-positive upper bound iterations that are up to 255. Given upper bound is: 10000.

-LOG VarLenJoinsLBNonPositiveError
-STATEMENT MATCH (a:person1)
           CALL var_len_joins('PK1', a, -1, 3, "FWD")
           RETURN *;
---- error
Runtime exception: Lower and upper bound lengths of recursive join operations need to be non-negative. Given lower bound is: -1 and upper bound is: 3.

-LOG ShortestPathsJoinsUBNonPositiveError
-STATEMENT MATCH (a:person1)
           CALL all_sp_paths('PK1', a, -5, "FWD")
           RETURN *;
---- error
Runtime exception: Lower and upper bound lengths of recursive join operations need to be non-negative. Given lower bound is: 1 and upper bound is: -5.

-LOG ShortestPathsJoinsUBNonPositiveError
-STATEMENT MATCH (a:person1)
           CALL all_sp_paths('PK1', a, 0, "FWD")
           RETURN *;
---- error
Runtime exception: Shortest path operations only works for positive upper bound iterations. Given upper bound is: 0.

-LOG VarLenJoins
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL var_len_joins('PK1', a, 1, 30, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 6
0|1|1|[]|[2:0]
0|2|2|[0:1]|[2:0,2:1]
0|3|3|[0:1,0:2]|[2:0,2:1,2:2]
0|4|3|[0:1,0:2]|[2:0,2:1,2:4]
0|4|3|[0:1,0:2]|[2:0,2:1,2:5]
0|4|4|[0:1,0:2,0:3]|[2:0,2:1,2:2,2:3]

-STATEMENT MATCH (a:person1) WHERE a.ID = 4
           CALL var_len_joins('PK1', a, 1, 30, "BWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 10
4|0|3|[0:2,0:1]|[2:4,2:1,2:0]
4|0|3|[0:2,0:1]|[2:5,2:1,2:0]
4|0|4|[0:3,0:2,0:1]|[2:3,2:2,2:1,2:0]
4|1|2|[0:2]|[2:4,2:1]
4|1|2|[0:2]|[2:5,2:1]
4|1|3|[0:3,0:2]|[2:3,2:2,2:1]
4|2|1|[]|[2:4]
4|2|1|[]|[2:5]
4|2|2|[0:3]|[2:3,2:2]
4|3|1|[]|[2:3]
-STATEMENT MATCH (a:person1) WHERE a.ID = 1
           CALL var_len_joins('PK1', a, 1, 2, "BOTH")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs, direction;
---- 7
1|0|1|[]|[2:0]|[False]
1|1|2|[0:0]|[2:0,2:0]|[False,True]
1|1|2|[0:2]|[2:1,2:1]|[True,False]
1|2|1|[]|[2:1]|[True]
1|3|2|[0:2]|[2:1,2:2]|[True,True]
1|4|2|[0:2]|[2:1,2:4]|[True,True]
1|4|2|[0:2]|[2:1,2:5]|[True,True]

-STATEMENT CALL create_project_graph('PK2', ['person1', 'person2'], ['knows12', 'knows21'])
---- ok
-LOG VarLenJoinsMultilabel1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL var_len_joins('PK2', a, 1, 30, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 6
0|1|1|[]|[3:0]
0|2|2|[1:1]|[3:0,4:1]
0|3|3|[1:1,0:2]|[3:0,4:1,3:2]
0|4|3|[1:1,0:2]|[3:0,4:1,3:4]
0|4|3|[1:1,0:2]|[3:0,4:1,3:5]
0|4|4|[1:1,0:2,1:3]|[3:0,4:1,3:2,4:3]

-STATEMENT CALL create_project_graph('PK3', ['person1', 'person2'], ['knows11', 'knows12', 'knows21', 'knows22'])
---- ok
-LOG VarLenJoinsMultilabel2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL var_len_joins('PK3', a, 1, 30, "FWD")
           RETURN length, count(*)
---- 4
1|2
2|4
3|24
4|16

-LOG VarLenJoinsLowerBoundZeroUpperBoundOne
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL var_len_joins('PK1', a, 0, 2, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 3
0|0|0|[]|[]
0|1|1|[]|[2:0]
0|2|2|[0:1]|[2:0,2:1]

-LOG VarLenJoinsLowerBoundZeroUpperBoundZero
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL var_len_joins('PK1', a, 0, 0, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 1
0|0|0|[]|[]

-LOG VarLenJoinsLowerBound1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL var_len_joins('PK1', a, 2, 3, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 4
0|2|2|[0:1]|[2:0,2:1]
0|3|3|[0:1,0:2]|[2:0,2:1,2:2]
0|4|3|[0:1,0:2]|[2:0,2:1,2:4]
0|4|3|[0:1,0:2]|[2:0,2:1,2:5]

-LOG VarLenJoinsLowerBound2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL var_len_joins('PK1', a, 4, 30, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 1
0|4|4|[0:1,0:2,0:3]|[2:0,2:1,2:2,2:3]

-LOG VarLenJoinsEmptyPaths
-STATEMENT MATCH (a:person1) WHERE a.ID = 4
           CALL var_len_joins('PK1', a, 1, 4, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs;
---- 0


-LOG AllSPDestinations
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL all_sp_destinations('PK1', a, 30, "FWD")
           RETURN a.ID, node.ID;
---- 5
0|1
0|2
0|3
0|4
0|4

-LOG AllSPDestinationsMultilabel1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL all_sp_destinations('PK2', a, 30, "FWD")
           RETURN a.ID, node.ID;
---- 6
0|1
0|2
0|3
0|4
0|4
0|4

-LOG AllSPDestinationsMultilabel2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL all_sp_destinations('PK3', a, 30, "FWD")
           RETURN a.ID, node.ID;
---- 30
0|1
0|1
0|2
0|2
0|2
0|2
0|3
0|3
0|3
0|3
0|3
0|3
0|3
0|3
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4
0|4

-LOG AllSPLengths
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL ALL_SP_DESTINATIONS('PK1', a, 30, "FWD")
           RETURN a.ID, node.ID, length;
---- 5
0|1|1
0|2|2
0|3|3
0|4|3
0|4|3

-LOG AllSPLengthsMultilabel1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL ALL_SP_DESTINATIONS('PK2', a, 30, "FWD")
           RETURN a.ID, node.ID, length;
---- 6
0|1|1
0|2|2
0|3|3
0|4|3
0|4|3
0|4|4

-LOG AllSPLengthsMultilabel2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL ALL_SP_DESTINATIONS('PK3', a, 30, "FWD")
           RETURN a.ID, node.ID, length;
---- 30
0|1|1
0|1|1
0|2|2
0|2|2
0|2|2
0|2|2
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|3|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3
0|4|3

-LOG AllSPPaths
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL all_sp_paths('PK1', a, 5, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 5
0|1|1|[]|[2:0]
0|2|2|[0:1]|[2:0,2:1]
0|3|3|[0:1,0:2]|[2:0,2:1,2:2]
0|4|3|[0:1,0:2]|[2:0,2:1,2:4]
0|4|3|[0:1,0:2]|[2:0,2:1,2:5]
-STATEMENT MATCH (a:person1) WHERE a.ID = 4
           CALL all_sp_paths('PK1', a, 5, "BOTH")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 7
4|0|3|[0:2,0:1]|[2:4,2:1,2:0]
4|0|3|[0:2,0:1]|[2:5,2:1,2:0]
4|1|2|[0:2]|[2:4,2:1]
4|1|2|[0:2]|[2:5,2:1]
4|2|1|[]|[2:4]
4|2|1|[]|[2:5]
4|3|1|[]|[2:3]

-LOG AllSPPathsMultilabel1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL all_sp_paths('PK2', a, 30, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 6
0|1|1|[]|[3:0]
0|2|2|[1:1]|[3:0,4:1]
0|3|3|[1:1,0:2]|[3:0,4:1,3:2]
0|4|3|[1:1,0:2]|[3:0,4:1,3:4]
0|4|3|[1:1,0:2]|[3:0,4:1,3:5]
0|4|4|[1:1,0:2,1:3]|[3:0,4:1,3:2,4:3]

-LOG AllSPPathsMultilabel2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL all_sp_paths('PK3', a, 30, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 30
0|1|1|[]|[2:0]
0|1|1|[]|[3:0]
0|2|2|[0:1]|[2:0,2:1]
0|2|2|[0:1]|[2:0,3:1]
0|2|2|[1:1]|[3:0,4:1]
0|2|2|[1:1]|[3:0,5:1]
0|3|3|[0:1,0:2]|[2:0,2:1,2:2]
0|3|3|[0:1,0:2]|[2:0,2:1,3:2]
0|3|3|[0:1,1:2]|[2:0,3:1,4:2]
0|3|3|[0:1,1:2]|[2:0,3:1,5:2]
0|3|3|[1:1,0:2]|[3:0,4:1,2:2]
0|3|3|[1:1,0:2]|[3:0,4:1,3:2]
0|3|3|[1:1,1:2]|[3:0,5:1,4:2]
0|3|3|[1:1,1:2]|[3:0,5:1,5:2]
0|4|3|[0:1,0:2]|[2:0,2:1,2:4]
0|4|3|[0:1,0:2]|[2:0,2:1,2:5]
0|4|3|[0:1,0:2]|[2:0,2:1,3:4]
0|4|3|[0:1,0:2]|[2:0,2:1,3:5]
0|4|3|[0:1,1:2]|[2:0,3:1,4:4]
0|4|3|[0:1,1:2]|[2:0,3:1,4:5]
0|4|3|[0:1,1:2]|[2:0,3:1,5:4]
0|4|3|[0:1,1:2]|[2:0,3:1,5:5]
0|4|3|[1:1,0:2]|[3:0,4:1,2:4]
0|4|3|[1:1,0:2]|[3:0,4:1,2:5]
0|4|3|[1:1,0:2]|[3:0,4:1,3:4]
0|4|3|[1:1,0:2]|[3:0,4:1,3:5]
0|4|3|[1:1,1:2]|[3:0,5:1,4:4]
0|4|3|[1:1,1:2]|[3:0,5:1,4:5]
0|4|3|[1:1,1:2]|[3:0,5:1,5:4]
0|4|3|[1:1,1:2]|[3:0,5:1,5:5]

-LOG SingleSPDestinations
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS('PK1', a, 30, "FWD")
           RETURN a.ID, node.ID;
---- 4
0|1
0|2
0|3
0|4

-LOG SingleSPDestinationsMultilabel1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS('PK2', a, 30, "FWD")
           RETURN a.ID, node.ID;
---- 5
0|1
0|2
0|3
0|4
0|4

-LOG SingleSPDestinationsMultilabel2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL single_sp_destinations('PK3', a, 30, "FWD")
           RETURN a.ID, node.ID
---- 8
0|1
0|1
0|2
0|2
0|3
0|3
0|4
0|4

-LOG SingleSPLengths
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS('PK1', a, 30, "FWD")
           RETURN a.ID, node.ID, length;
---- 4
0|1|1
0|2|2
0|3|3
0|4|3

-LOG SingleSPLengthsMultilabel1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS('PK2', a, 30, "FWD")
           RETURN a.ID, node.ID, length;
---- 5
0|1|1
0|2|2
0|3|3
0|4|3
0|4|4

-LOG SingleSPLengthsMultilabel2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL SINGLE_SP_DESTINATIONS('PK3', a, 30, "FWD")
           RETURN a.ID, node.ID, length
---- 8
0|1|1
0|1|1
0|2|2
0|2|2
0|3|3
0|3|3
0|4|3
0|4|3

-LOG SingleSPPaths
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL single_sp_paths('PK1', a, 5, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 4
0|1|1|[]|[2:0]
0|2|2|[0:1]|[2:0,2:1]
0|3|3|[0:1,0:2]|[2:0,2:1,2:2]
0|4|3|[0:1,0:2]|[2:0,2:1,2:4]
-STATEMENT MATCH (a:person1) WHERE a.ID = 2
           CALL single_sp_paths('PK1', a, 5, "BOTH")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 4
2|0|2|[0:1]|[2:1,2:0]
2|1|1|[]|[2:1]
2|3|1|[]|[2:2]
2|4|1|[]|[2:4]

-LOG SingleSPPathsMultilabel1
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL single_sp_paths('PK2', a, 30, "FWD")
           RETURN a.ID, node.ID, length, pathNodeIDs, pathEdgeIDs;
---- 5
0|1|1|[]|[3:0]
0|2|2|[1:1]|[3:0,4:1]
0|3|3|[1:1,0:2]|[3:0,4:1,3:2]
0|4|3|[1:1,0:2]|[3:0,4:1,3:4]
0|4|4|[1:1,0:2,1:3]|[3:0,4:1,3:2,4:3]

-LOG SingleSPPathsMultilabel2
-STATEMENT MATCH (a:person1) WHERE a.ID = 0
           CALL single_sp_paths('PK3', a, 30, "FWD")
           RETURN length, count(*)
---- 3
1|2
2|2
3|4
