-DATASET CSV tinysnb

--

-CASE ParShortestPathAlgorithm

-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL par_shortest_path(PK, a, 2, true)
           RETURN a.fName, _node.fName, length;
---- 4
Alice|Alice|0
Alice|Bob|1
Alice|Carol|1
Alice|Dan|1
