-DATASET CSV gds-single-sp-paths

--

-CASE SingleSPPathsBasic
-SKIP
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL single_sp_paths(PK, a, 40, true)
           RETURN a.ID, _node.ID, length, pathNodeIDs;
-PARALLELISM 8
---- 4
0|0|0|[]
0|1|1|[]
0|2|2|[0:1]
0|3|3|[0:1,0:2]

-CASE SingleSPEmptyPaths
-SKIP
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 3
           CALL single_sp_paths(PK, a, 4, true)
           RETURN a.ID, _node.ID, length, pathNodeIDs;
-PARALLELISM 8
---- 1
3|3|0|[]
