-DATASET CSV gds-weighted-shortest-path

--

-CASE WeightedShortestPath
-LOG SingleWSP
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost1) ]->(b)
        WHERE a.ID = 'A'
        RETURN b.ID, e_weight
---- 5
B|50.000000
C|50.000000
D|90.000000
E|120.000000
F|160.000000

-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost1) ]->(b)
        WHERE a.ID = 'A'
        RETURN b.ID, e_weight, properties(nodes(p), "ID"), properties(rels(p), "cost1")
---- 5
B|50.000000|[A,B]|[50]
C|50.000000|[A,C]|[50]
D|90.000000|[A,B,D]|[50,40]
E|120.000000|[A,B,D,E]|[50,40,30]
F|160.000000|[A,B,D,E,F]|[50,40,30,40]

-LOG WSP-INT128
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost0) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- error
Binder exception: INT128 weight type is not supported for weighted shortest path.

-LOG WSP-INT64
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost1) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-INT32
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost2) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-INT16
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost3) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-INT8
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost4) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|5.000000
A|C|5.000000
A|D|9.000000
A|E|12.000000
A|F|16.000000
B|D|4.000000
B|E|7.000000
B|F|11.000000
C|D|4.000000
C|E|7.000000
C|F|11.000000
D|E|3.000000
D|F|7.000000
E|F|4.000000
-LOG WSP-UINT64
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost5) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-UINT32
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost6) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-UINT16
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost7) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-UINT8
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost8) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|5.000000
A|C|5.000000
A|D|9.000000
A|E|12.000000
A|F|16.000000
B|D|4.000000
B|E|7.000000
B|F|11.000000
C|D|4.000000
C|E|7.000000
C|F|11.000000
D|E|3.000000
D|F|7.000000
E|F|4.000000
-LOG WSP-DOUBLE
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost9) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-FLOAT
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost10) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-D38
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost14) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- error
Binder exception: DECIMAL(38, 4) weight type is not supported for weighted shortest path.

-STATEMENT CREATE NODE TABLE N2 (ID STRING PRIMARY KEY);
---- ok
-STATEMENT CREATE (:N2 {ID:'AA'});
---- ok
-STATEMENT CREATE REL TABLE NRN2 (FROM N TO N2, cost1 INT64);
---- ok
-STATEMENT CREATE REL TABLE N2RN (FROM N2 TO N, cost1 INT64);
---- ok
-STATEMENT MATCH (n2:N2 {ID:'AA'}), (a:N {ID:'A'}), (b:N {ID: 'B'})
            CREATE (a)-[:NRN2{cost1:1}]->(n2)-[:N2RN{cost1:1}]->(b)
---- ok
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost1) ]->(b)
        WHERE a.ID = 'A'
        RETURN b.ID, e_weight
---- 6
AA|1.000000
B|2.000000
C|50.000000
D|42.000000
E|72.000000
F|112.000000
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost1) ]->(b)
        WHERE a.ID = 'A'
        RETURN b.ID, e_weight, properties(nodes(p), "ID"), properties(rels(p), "cost1")
---- 6
AA|1.000000|[A,AA]|[1]
B|2.000000|[A,AA,B]|[1,1]
C|50.000000|[A,C]|[50]
D|42.000000|[A,AA,B,D]|[1,1,40]
E|72.000000|[A,AA,B,D,E]|[1,1,40,30]
F|112.000000|[A,AA,B,D,E,F]|[1,1,40,30,40]

-STATEMENT MATCH  (a:N {ID:'A'}), (b:N {ID: 'B'})
            CREATE (a)-[:R{cost1:2}]->(b)
---- ok
-STATEMENT MATCH p = (a)-[e* ALL WSHORTEST(cost1) ]->(b)
        WHERE a.ID = 'A' AND b.ID = 'F'
        RETURN b.ID, e_weight, properties(nodes(p), "ID"), properties(rels(p), "cost1")
---- 2
F|112.000000|[A,AA,B,D,E,F]|[1,1,40,30,40]
F|112.000000|[A,B,D,E,F]|[2,40,30,40]

-CASE NegativeWeight
-STATEMENT MATCH (a {ID:'A'}), (b {ID:'B'})
        CREATE (a)-[r {cost1:-1}]->(b)
---- ok
-STATEMENT MATCH (a)-[e* WSHORTEST(cost1) ]->(b)
           RETURN a.ID, b.ID, e_weight
---- error
Runtime exception: Found negative weight -1. This is not supported in weighted shortest path.
-STATEMENT MATCH p=(a)-[e* WSHORTEST(cost1) ]->(b)
           RETURN p
---- error
Runtime exception: Found negative weight -1. This is not supported in weighted shortest path.