-DATASET CSV gds-weighted-shortest-path

--

-CASE WeightedShortestPath
-LOG SingleWSP
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost1) ]->(b)
        WHERE a.ID = 'A'
        RETURN b.ID, e_weight
---- 5
B|50.000000
C|50.000000
D|90.000000
E|120.000000
F|160.000000
-LOG WSP-INT128
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost0) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- error
Runtime exception: INT128 weight type is not supported for weighted shortest path.
-LOG WSP-INT64
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost1) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-INT32
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost2) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-INT16
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost3) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-INT8
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost4) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|5.000000
A|C|5.000000
A|D|9.000000
A|E|12.000000
A|F|16.000000
B|D|4.000000
B|E|7.000000
B|F|11.000000
C|D|4.000000
C|E|7.000000
C|F|11.000000
D|E|3.000000
D|F|7.000000
E|F|4.000000
-LOG WSP-UINT64
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost5) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-UINT32
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost6) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-UINT16
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost7) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-UINT8
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost8) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|5.000000
A|C|5.000000
A|D|9.000000
A|E|12.000000
A|F|16.000000
B|D|4.000000
B|E|7.000000
B|F|11.000000
C|D|4.000000
C|E|7.000000
C|F|11.000000
D|E|3.000000
D|F|7.000000
E|F|4.000000
-LOG WSP-DOUBLE
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost9) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-FLOAT
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost10) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- 14
A|B|50.000000
A|C|50.000000
A|D|90.000000
A|E|120.000000
A|F|160.000000
B|D|40.000000
B|E|70.000000
B|F|110.000000
C|D|40.000000
C|E|70.000000
C|F|110.000000
D|E|30.000000
D|F|70.000000
E|F|40.000000
-LOG WSP-D38
-STATEMENT MATCH p = (a)-[e* WSHORTEST(cost14) ]->(b)
        RETURN a.ID, b.ID, e_weight
---- error
Runtime exception: DECIMAL(38, 4) weight type is not supported for weighted shortest path.
