-DATASET CSV rel-group

--

-CASE SimpleMatch
-STATEMENT MATCH (a)-[e:knows]->(b) WHERE a.ID = 0 AND b.ID = 2 RETURN label(e), label(b), b.*
---- 3
knows|personB|2|Bob
knows|personC|2|Bob
knows|personC|2|Bob
-STATEMENT MATCH (a:personA)-[e:knows]->(b) WHERE a.ID = 0 AND b.ID = 2 RETURN label(e), label(b), b.*
---- 2
knows|personB|2|Bob
knows|personC|2|Bob
-STATEMENT MATCH (a:personA)-[e:knows]->(b:personB) WHERE a.ID = 0 AND b.ID = 2 RETURN label(e), label(b), b.*
---- 1
knows|personB|2|Bob
-STATEMENT MATCH (a:personA)-[e:likes]->(b:personB) WHERE a.ID = 0 RETURN label(e), label(b), b.*
---- 3
likes|personB|2|Bob
likes|personB|3|Carol
likes|personB|5|Dan
-STATEMENT MATCH (a)-[e:likes]-(b) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
12
-STATEMENT MATCH (a)-[e]->(b) WHERE a.ID = 0 AND b.ID = 2 RETURN label(e), label(b), b.*
---- 5
knows|personB|2|Bob
knows|personC|2|Bob
knows|personC|2|Bob
likes|personB|2|Bob
likes|personA|2|Bob

-CASE Drop
-STATEMENT CALL show_tables() RETURN *;
---- 5
0|personA|NODE|local(kuzu)|
1|personB|NODE|local(kuzu)|
2|personC|NODE|local(kuzu)|
6|knows|REL|local(kuzu)|
9|likes|REL|local(kuzu)|
-STATEMENT DROP TABLE knows_personA_personB;
---- error
Binder exception: Table knows_personA_personB does not exist.
-STATEMENT DROP TABLE knows;
---- ok
-STATEMENT CALL show_tables() RETURN *;
---- 4
0|personA|NODE|local(kuzu)|
1|personB|NODE|local(kuzu)|
2|personC|NODE|local(kuzu)|
9|likes|REL|local(kuzu)|
-STATEMENT MATCH (a:personA)-[e:knows]->(b) RETURN COUNT(*)
---- error
Binder exception: Table knows does not exist.
-STATEMENT MATCH (a:personA)-[e:knows_personA_personB]->(b) RETURN COUNT(*)
---- error
Binder exception: Table knows_personA_personB does not exist.


-CASE DropReclaim
-SKIP_IN_MEM
-STATEMENT DROP TABLE knows;
---- ok
-STATEMENT CHECKPOINT
---- ok
-STATEMENT CALL FSM_INFO() RETURN SUM(num_pages) > 0
---- 1
True

-CASE Alter
-STATEMENT ALTER TABLE likes RENAME TO hates;
 ---- ok
-STATEMENT CALL show_tables() RETURN *;
---- 5
0|personA|NODE|local(kuzu)|
1|personB|NODE|local(kuzu)|
2|personC|NODE|local(kuzu)|
6|knows|REL|local(kuzu)|
9|hates|REL|local(kuzu)|
-STATEMENT MATCH (a:personA)-[e:hates]->(b:personB) WHERE a.ID = 0 RETURN label(e), label(b), b.*
---- 3
hates|personB|2|Bob
hates|personB|3|Carol
hates|personB|5|Dan
-STATEMENT ALTER TABLE hates ADD age INT;
---- ok
-STATEMENT MATCH (a:personA)-[e:hates]->(b:personB) WHERE a.ID = 0 RETURN e.age
---- 3 # default values are null



-STATEMENT ALTER TABLE hates RENAME age TO s;
---- ok
-STATEMENT MATCH (a:personA)-[e:hates]->(b:personB) WHERE a.ID = 0 RETURN e.s
---- 3



-STATEMENT ALTER TABLE hates DROP s;
---- ok
-STATEMENT MATCH (a:personA)-[e:hates]->(b:personB) RETURN e.s
---- error
Binder exception: Cannot find property s for e.
-STATEMENT ALTER TABLE hates RENAME TO likes;
---- ok
-STATEMENT CALL show_tables() RETURN *;
---- 5
0|personA|NODE|local(kuzu)|
1|personB|NODE|local(kuzu)|
2|personC|NODE|local(kuzu)|
6|knows|REL|local(kuzu)|
9|likes|REL|local(kuzu)|
-STATEMENT MATCH (a:personA)-[e:likes]->(b:personB) WHERE a.ID = 0 RETURN label(e), label(b), b.*
---- 3
likes|personB|2|Bob
likes|personB|3|Carol
likes|personB|5|Dan
-STATEMENT ALTER TABLE likes RENAME date TO s;
---- ok
-STATEMENT CALL table_info("likes") RETURN *;
---- 1
1|s|DATE|NULL|both

-CASE DMLCreateWithSRCandDEST
-STATEMENT CREATE (a);
---- error
Binder exception: Create node a with multiple node labels is not supported.
-STATEMENT CREATE (a {ID:1145})-[:likes]->(b {ID:1919});
---- error
Binder exception: Create node a with multiple node labels is not supported.
-STATEMENT CREATE (a:personA {ID:1145})-[:likes]->(b {ID:1919});
---- error
Binder exception: Create node b with multiple node labels is not supported.
-STATEMENT CREATE (a {ID:1145})-[:likes]->(b:personB {ID:1919});
---- error
Binder exception: Create node a with multiple node labels is not supported.
-STATEMENT CREATE (a:personA {ID:1145})-[:likes]->(b:personB {ID:1919});
---- ok
-STATEMENT MATCH (a)-[e:likes]-(b) WHERE b.ID = 1919 RETURN a.ID,b.ID,label(a),label(b),label(e);
---- 1
1145|1919|personA|personB|likes

-CASE COPYWithFROMTO
-STATEMENT create rel table test (FROM personA TO personA, FROM personA To personB, date DATE);
---- ok
-STATEMENT COPY test FROM '${KUZU_ROOT_DIRECTORY}/dataset/rel-group/edge.csv';
---- error
Binder exception: The table test has multiple FROM and TO pairs defined in the schema. A specific pair of FROM and TO options is expected when copying data into the test table.
-STATEMENT COPY test FROM '${KUZU_ROOT_DIRECTORY}/dataset/rel-group/edge.csv' (from = 'personA', to = 'personB');
---- ok
-STATEMENT MATCH (a:personA)-[e:test]->(b:personB) WHERE a.ID = 0 RETURN label(e), label(b), b.*
---- 3
test|personB|2|Bob
test|personB|3|Carol
test|personB|5|Dan
-STATEMENT CALL table_info('test') RETURN *;
---- 1
1|date|DATE|NULL|both

-CASE DropCheckpointedColumn
-SKIP_IN_MEM
-STATEMENT ALTER TABLE likes DROP date
---- ok
-STATEMENT MATCH (a:personA)-[e:likes]->(b:personB) WHERE a.ID = 0 RETURN e.date
---- error
Binder exception: Cannot find property date for e.
-STATEMENT CHECKPOINT
---- ok
-STATEMENT CALL FSM_INFO() RETURN SUM(num_pages) > 0
---- 1
True

# Note: FIX-ME.
-CASE ImportRELGROUPfromOldVersion
-SKIP
-STATEMENT create rel table group likes_import (FROM personA TO personB, FROM personB To personA, date DATE);
---- ok
-STATEMENT COPY likes_import_personA_personB FROM "${KUZU_ROOT_DIRECTORY}/dataset/rel-group/edge.csv";
---- ok
-STATEMENT MATCH (a:personA)-[e:likes_import]->(b:personB) WHERE a.ID = 0 RETURN label(e), label(b), b.*
---- 3
likes_import|personB|2|Bob
likes_import|personB|3|Carol
likes_import|personB|5|Dan
-STATEMENT MATCH (a)-[e:likes_import]-(b) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
6
