-DATASET CSV EMPTY

--

-CASE AlterRelGroupChildTable
-STATEMENT CREATE NODE TABLE PersonA (id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE NODE TABLE PersonB (id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE REL TABLE Knows(FROM PersonA TO PersonA, FROM PersonA TO PersonB, data STRING);
---- ok
-STATEMENT CREATE (:PersonA {id:0}), (:PersonB {id:0})
---- ok
-STATEMENT MATCH (p1:PersonA {id:0}), (p2:PersonB {id:0}) CREATE (p1)-[e:Knows]->(p2)
---- ok
-STATEMENT MATCH (p1 {id:0}), (p2 {id:0}) CREATE (p1)-[e:Knows]->(p2)
---- error
Binder exception: Create rel e bound by multiple node labels is not supported.
-STATEMENT MATCH (a)-[]->(b) RETURN a.id, b.id
---- 1
0|0

-STATEMENT ALTER TABLE Knows_PersonA_PersonB DROP data;
---- error
Runtime exception: Cannot alter table Knows_PersonA_PersonB because it is referenced by table Knows.
-STATEMENT ALTER TABLE Knows DROP data;
---- ok
-STATEMENT CALL table_info("Knows") RETURN *;
---- 0

-CASE DuplicateRelTable
-STATEMENT CREATE NODE TABLE PersonA (id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE NODE TABLE PersonB (id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE REL TABLE Know2 (FROM PersonA TO PersonA);
---- ok
-STATEMENT CREATE REL TABLE Know (FROM PersonB TO PersonB, FROM PersonB TO PersonA);
---- ok
-STATEMENT ALTER TABLE Know2 RENAME TO Know;
---- error
Binder exception: Table Know already exists.
-STATEMENT ALTER TABLE Know RENAME TO Know2;
---- error
Binder exception: Table Know2 already exists.
-STATEMENT CALL show_tables() RETURN *;
---- 4
0|Know|REL|local(kuzu)|
0|PersonA|NODE|local(kuzu)|
1|PersonB|NODE|local(kuzu)|
2|Know2|REL|local(kuzu)|

-CASE DuplicateFromToPairs
-STATEMENT CREATE NODE TABLE PersonA (id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE NODE TABLE PersonB (id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE REL TABLE Knows (FROM PersonA TO PersonA, From PersonA TO PersonA);
---- error
Binder exception: Found duplicate FROM-TO PersonA-PersonA pairs.
