-DATASET PARQUET large-array
--

-CASE CopyLargeArray
-STATEMENT MATCH (u:person) RETURN u.ID, u.embedding ORDER BY u.ID DESC LIMIT 1;
---- 1
9998|[0.123655,0.781263,0.001109,0.249284,0.469616,0.945860,0.364329,0.788855,0.009410,0.149256,0.592328,0.168283,0.063145,0.304603,0.195098,0.967029,0.716229,0.631408,0.576478,0.483858,0.614311,0.440887,0.394348,0.135743,0.597661,0.358071,0.024519,0.374152,0.557506,0.876006,0.612007,0.130599,0.679080,0.678651,0.673458,0.133532,0.505031,0.220965,0.026113,0.571795,0.426235,0.550285,0.047089,0.474228,0.841275,0.302041,0.482254,0.606756,0.812161,0.999015,0.907731,0.321990,0.148814,0.713319,0.244760,0.185409,0.826248,0.931503,0.486253,0.265485,0.430017,0.274838,0.403234,0.854725,0.868718,0.319589,0.739281,0.207641,0.072567,0.103014,0.314223,0.819861,0.099357,0.909448,0.228721,0.863032,0.625120,0.871700,0.149276,0.252710,0.186461,0.252335,0.349150,0.661578,0.054636,0.575431,0.793400,0.437550,0.991869,0.899740,0.933181,0.002855,0.587611,0.757471,0.455644,0.998326,0.511699,0.033962,0.255552,0.442520,0.703907,0.801576,0.454502,0.452512,0.615673,0.014512,0.361325,0.021650,0.021152,0.121675,0.783833,0.381653,0.290483,0.724366,0.714949,0.062113,0.818325,0.780339,0.541165,0.040977,0.189235,0.436049,0.815548,0.407596,0.904772,0.470955,0.085176,0.319802,0.639783,0.088433,0.341368,0.724548,0.412345,0.762805,0.891829,0.489405,0.563964,0.846203,0.548890,0.800415,0.143956,0.161062,0.709006,0.327651,0.479494,0.415464,0.418741,0.052670,0.925006,0.516234,0.932992,0.970318,0.633118,0.195480,0.702994,0.134372,0.078851,0.456076,0.859394,0.021032,0.807008,0.155791,0.557705,0.064758,0.455909,0.087403,0.475801]
-STATEMENT MATCH (u:person) RETURN SUM(list_sum(u.embedding));
---- 1
783313.291344
