-DATASET PARQUET large-array
--

-CASE CopyLargeArray
-STATEMENT MATCH (u:person) RETURN u.ID, u.embedding ORDER BY u.ID DESC LIMIT 5;
---- 5
9998|[0.123655,0.781263,0.001109,0.249284,0.469616,0.945860,0.364329,0.788855,0.009410,0.149256,0.592328,0.168283,0.063145,0.304603,0.195098,0.967029,0.716229,0.631408,0.576478,0.483858,0.614311,0.440887,0.394348,0.135743,0.597661,0.358071,0.024519,0.374152,0.557506,0.876006,0.612007,0.130599,0.679080,0.678651,0.673458,0.133532,0.505031,0.220965,0.026113,0.571795,0.426235,0.550285,0.047089,0.474228,0.841275,0.302041,0.482254,0.606756,0.812161,0.999015,0.907731,0.321990,0.148814,0.713319,0.244760,0.185409,0.826248,0.931503,0.486253,0.265485,0.430017,0.274838,0.403234,0.854725,0.868718,0.319589,0.739281,0.207641,0.072567,0.103014,0.314223,0.819861,0.099357,0.909448,0.228721,0.863032,0.625120,0.871700,0.149276,0.252710,0.186461,0.252335,0.349150,0.661578,0.054636,0.575431,0.793400,0.437550,0.991869,0.899740,0.933181,0.002855,0.587611,0.757471,0.455644,0.998326,0.511699,0.033962,0.255552,0.442520,0.703907,0.801576,0.454502,0.452512,0.615673,0.014512,0.361325,0.021650,0.021152,0.121675,0.783833,0.381653,0.290483,0.724366,0.714949,0.062113,0.818325,0.780339,0.541165,0.040977,0.189235,0.436049,0.815548,0.407596,0.904772,0.470955,0.085176,0.319802,0.639783,0.088433,0.341368,0.724548,0.412345,0.762805,0.891829,0.489405,0.563964,0.846203,0.548890,0.800415,0.143956,0.161062,0.709006,0.327651,0.479494,0.415464,0.418741,0.052670,0.925006,0.516234,0.932992,0.970318,0.633118,0.195480,0.702994,0.134372,0.078851,0.456076,0.859394,0.021032,0.807008,0.155791,0.557705,0.064758,0.455909,0.087403,0.475801]
9997|[0.395878,0.208006,0.944296,0.582960,0.829501,0.197763,0.836555,0.494485,0.883127,0.468361,0.429963,0.932385,0.388670,0.722808,0.011902,0.497883,0.404473,0.758575,0.925715,0.860364,0.827209,0.387374,0.217769,0.776317,0.754929,0.870325,0.742965,0.401621,0.035656,0.584220,0.383116,0.251341,0.159454,0.804763,0.644444,0.687431,0.058404,0.463544,0.125660,0.398208,0.353459,0.853849,0.010043,0.749390,0.042933,0.019310,0.908218,0.225583,0.148976,0.080336,0.996681,0.033069,0.364005,0.702923,0.255927,0.067393,0.408179,0.095115,0.192055,0.032754,0.607825,0.449315,0.468495,0.742139,0.927718,0.149334,0.115266,0.800247,0.487200,0.765832,0.327898,0.193086,0.496619,0.924801,0.586448,0.912464,0.160584,0.693468,0.892753,0.673937,0.397989,0.947249,0.038386,0.157632,0.360504,0.968522,0.388783,0.501907,0.588939,0.585843,0.478786,0.137543,0.380438,0.377798,0.011009,0.650566,0.806050,0.250486,0.318733,0.866679,0.840663,0.390053,0.787320,0.237134,0.871813,0.829325,0.546455,0.771129,0.050983,0.640328,0.047116,0.074964,0.627092,0.859837,0.750051,0.786542,0.074537,0.353424,0.630569,0.267844,0.445803,0.696266,0.240440,0.935255,0.079565,0.025390,0.923837,0.310275,0.704597,0.132101,0.799976,0.643917,0.417935,0.900891,0.601481,0.352683,0.432002,0.051434,0.454227,0.647152,0.374558,0.210245,0.176397,0.008456,0.073923,0.197744,0.696241,0.387330,0.226593,0.230154,0.617357,0.588507,0.252287,0.794669,0.394708,0.147794,0.413525,0.954340,0.668550,0.780168,0.851838,0.546310,0.522781,0.144741,0.159842,0.421316,0.569788]
9996|[0.517389,0.662311,0.362863,0.126341,0.117141,0.916835,0.504463,0.315440,0.251126,0.819210,0.164178,0.113160,0.578937,0.702424,0.684484,0.856235,0.637909,0.257458,0.456869,0.064865,0.476327,0.128469,0.094060,0.081531,0.723409,0.212070,0.077914,0.424171,0.299807,0.871041,0.226242,0.952969,0.831811,0.063122,0.362706,0.562270,0.882561,0.502280,0.238305,0.733037,0.293871,0.357773,0.475614,0.133047,0.907165,0.654302,0.503786,0.075999,0.705106,0.308085,0.453134,0.387438,0.125618,0.705369,0.719432,0.159772,0.058741,0.238325,0.606866,0.125196,0.032617,0.378195,0.391917,0.026417,0.115551,0.808973,0.220658,0.324715,0.794518,0.127301,0.094488,0.485575,0.150606,0.507751,0.605147,0.799585,0.657736,0.523580,0.153798,0.810377,0.968197,0.040903,0.472810,0.745249,0.279386,0.955623,0.420368,0.825885,0.824818,0.881172,0.241275,0.119538,0.449035,0.563437,0.069253,0.907918,0.752708,0.680742,0.925958,0.455660,0.507737,0.412146,0.195766,0.071857,0.974964,0.735084,0.632097,0.383065,0.796986,0.630507,0.756640,0.346812,0.398211,0.063106,0.298871,0.241039,0.671177,0.894865,0.198460,0.326375,0.702463,0.180018,0.812126,0.328709,0.990575,0.674891,0.413998,0.543945,0.103496,0.107385,0.132340,0.917667,0.206791,0.667173,0.127654,0.512872,0.201915,0.887941,0.656572,0.267536,0.167164,0.926963,0.750242,0.247785,0.532927,0.121128,0.370551,0.215443,0.190793,0.103999,0.298020,0.558315,0.132478,0.330532,0.707065,0.302263,0.499589,0.587140,0.796331,0.957450,0.127367,0.678839,0.970131,0.190477,0.661384,0.586701,0.591792]
9995|[0.868434,0.596806,0.747060,0.487307,0.675404,0.130144,0.839845,0.608758,0.688427,0.580831,0.538961,0.278368,0.323168,0.911164,0.193133,0.936003,0.483642,0.759959,0.223579,0.170303,0.797664,0.004911,0.254354,0.189814,0.089712,0.653663,0.705787,0.172530,0.599566,0.057592,0.680583,0.412712,0.076501,0.530027,0.546288,0.163325,0.781230,0.852104,0.483717,0.975451,0.098717,0.700676,0.797564,0.307380,0.530444,0.719706,0.049610,0.084789,0.121068,0.612502,0.732637,0.415540,0.061699,0.699801,0.391779,0.265275,0.243688,0.324398,0.282691,0.672665,0.692421,0.913350,0.596628,0.839157,0.068638,0.675049,0.411017,0.185634,0.240440,0.469224,0.164721,0.893642,0.025920,0.004076,0.512545,0.053063,0.996616,0.389258,0.113953,0.976959,0.037868,0.521630,0.807836,0.139678,0.744080,0.983361,0.728527,0.100247,0.321622,0.103823,0.973381,0.529746,0.859852,0.195842,0.344723,0.392217,0.688283,0.190460,0.999458,0.068562,0.532816,0.923707,0.592493,0.288396,0.119358,0.433593,0.379911,0.466562,0.323402,0.946674,0.383622,0.790997,0.532281,0.559613,0.928925,0.173780,0.398580,0.407130,0.571789,0.698866,0.010740,0.638537,0.510555,0.526955,0.917936,0.117513,0.136798,0.156818,0.703084,0.515444,0.035599,0.138669,0.654597,0.654750,0.769557,0.368574,0.708143,0.149901,0.592689,0.908435,0.071557,0.256745,0.034424,0.933849,0.928939,0.042558,0.660413,0.497466,0.834562,0.576167,0.989186,0.495554,0.802024,0.706194,0.206002,0.021416,0.726899,0.291184,0.903296,0.696840,0.366329,0.558055,0.774836,0.006391,0.783373,0.346061,0.233260]
9994|[0.047745,0.448163,0.711963,0.712860,0.665845,0.481637,0.210427,0.368021,0.639685,0.798112,0.548337,0.492456,0.958987,0.964181,0.204583,0.144219,0.158752,0.503014,0.358698,0.401271,0.271273,0.497799,0.788534,0.232910,0.731823,0.768835,0.154473,0.349851,0.789797,0.613369,0.803928,0.850226,0.629782,0.105209,0.493637,0.988977,0.124623,0.499830,0.457449,0.405833,0.750532,0.761146,0.174909,0.645454,0.783297,0.270309,0.821288,0.030701,0.408145,0.714216,0.909838,0.937339,0.638479,0.320120,0.915966,0.675301,0.835218,0.324924,0.484078,0.651419,0.242521,0.636703,0.855906,0.336818,0.354289,0.905442,0.669833,0.949340,0.319356,0.870510,0.768369,0.231978,0.467960,0.327324,0.427458,0.799146,0.808795,0.701016,0.747248,0.538950,0.353971,0.223090,0.382165,0.441070,0.035354,0.262612,0.648882,0.209170,0.353441,0.509377,0.037924,0.182542,0.092172,0.831285,0.933229,0.743989,0.817009,0.550978,0.528354,0.090503,0.034322,0.613562,0.590362,0.219156,0.353857,0.489512,0.326063,0.594912,0.290194,0.028911,0.205742,0.172150,0.552718,0.255628,0.622053,0.667631,0.120817,0.508928,0.417031,0.472726,0.738310,0.284242,0.250040,0.890837,0.803125,0.539270,0.221584,0.512085,0.713356,0.555267,0.134121,0.266580,0.663906,0.502675,0.227046,0.271587,0.607157,0.615078,0.480391,0.130869,0.119155,0.485337,0.057630,0.827498,0.650900,0.698283,0.753606,0.571399,0.134580,0.515084,0.298466,0.169711,0.112721,0.325988,0.772458,0.538863,0.128808,0.972115,0.413631,0.760863,0.652503,0.192944,0.546958,0.435923,0.669935,0.996473,0.882460]

-STATEMENT MATCH (u:person) RETURN COUNT(*), SUM(list_sum(u.embedding));
---- 1
9381|783313.291344
