-DATASET CSV tinysnb

--

-CASE Acc

-LOG AspIntersect
-STATEMENT MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person), (a)-[e3:knows]->(c)
            WHERE b.fName='Bob' AND a.fName='Alice'
            HINT (((a JOIN e1) JOIN b) MULTI_JOIN e2 MULTI_JOIN e3) JOIN c
            RETURN COUNT(*)
---- 1
2

-LOG AspBasic
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE a.age > 35 RETURN b.fName
---- 3
Alice
Bob
Dan

-LOG AspMultiLabel
-STATEMENT MATCH (a:person)-[e1:knows|:studyAt|:workAt]->(b:person:organisation) WHERE a.age > 35 RETURN b.fName, b.name
---- 4
Alice|
Bob|
Dan|
|CsWork

-LOG AspMultiKey
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person), (a)-[e3:knows]->(c) WHERE a.fName='Alice' RETURN b.fName, c.fName
---- 6
Bob|Carol
Bob|Dan
Carol|Bob
Carol|Dan
Dan|Bob
Dan|Carol

-LOG AspMultiMaskToOneScan
-STATEMENT MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person) WHERE a.fName='Alice' AND c.fName='Bob' RETURN b.fName
---- 2
Carol
Dan

-LOG AspOneMaskToMultiScan
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person), (a)-[e2:knows]->(b), (a)-[e3:knows]->(c:person)-[e4:knows]->(d:person) WHERE e1.date=date('1950-05-14') AND a.ID>0 AND c.fName='Bob' AND d.fName='Carol' RETURN a.fName, b.fName
---- 2
Carol|Bob
Dan|Bob
