-DATASET JSON CSV_TO_JSON(long-string-pk-tests)
-BUFFER_POOL_SIZE 512000000

--

-CASE CopyPLongStringPKJSON

-LOG LongStringPKTestJSON
-STATEMENT MATCH (a:Person)-[e:Knows]->(b:Person) WHERE a.name = "AAAAAAAAAAAAAAAAAAAA" RETURN COUNT(*)
---- 1
1
