-DATASET JSON CSV_TO_JSON(tinysnb)
--
-CASE Union
-LOG UnionAllTwoQueriesTest
-STATEMENT MATCH (p:person) RETURN p.age UNION ALL MATCH (p1:person) RETURN p1.age
-PARALLELISM 8
---- 16
20
20
20
20
25
25
30
30
35
35
40
40
45
45
83
83