-DATASET JSON CSV_TO_JSON(tinysnb)
-BUFFER_POOL_SIZE 512000000
--
-CASE Union
-LOG UnionAllTwoQueriesTest
-STATEMENT MATCH (p:person) RETURN p.age UNION ALL MATCH (p1:person) RETURN p1.age
-PARALLELISM 8
---- 16
20
20
20
20
25
25
30
30
35
35
40
40
45
45
83
83
-LOG UnionAllMultipleQueriesTest
-STATEMENT MATCH (p:person) RETURN p.age UNION ALL MATCH (p1:person) RETURN p1.age UNION ALL MATCH (p2:person) RETURN p2.age
-PARALLELISM 2
---- 24
20
20
20
20
20
20
25
25
25
30
30
30
35
35
35
40
40
40
45
45
45
83
83
83
-LOG UnionAllMultipleColumnsTest
-STATEMENT MATCH (p:person) RETURN p.age, p.eyeSight UNION ALL MATCH (p1:person) RETURN p1.age, p1.eyeSight
-PARALLELISM 3
---- 16
20|4.700000
20|4.700000
20|4.800000
20|4.800000
25|4.500000
25|4.500000
30|5.100000
30|5.100000
35|5.000000
35|5.000000
40|4.900000
40|4.900000
45|5.000000
45|5.000000
83|4.900000
83|4.900000
-LOG UnionTwoQueriesTest
-STATEMENT MATCH (a:person) RETURN a.age UNION MATCH (p:person) RETURN p.age
---- 7
20
25
30
35
40
45
83
# If an expression to union has different flat/unflat state in different single queries, we need to flatten that
# expression in all the single queries.
-LOG UnionAllFlatAndUnFlatColTest
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) RETURN a.age UNION ALL MATCH (a:person)-[e:knows]->(b:person) RETURN a.age UNION ALL MATCH (a:person)-[e:knows]->(b:person) RETURN a.age
---- 42
20
20
20
20
20
20
20
20
20
20
20
20
20
20
20
30
30
30
30
30
30
30
30
30
35
35
35
35
35
35
35
35
35
45
45
45
45
45
45
45
45
45
-LOG UnionAllWithTest
-STATEMENT MATCH (a:person)-[:knows]->(b:person) with b return b.age + 3 UNION ALL MATCH (a:person)-[e:knows]->(b:person) with a RETURN a.age
---- 28
20
20
20
20
20
23
23
23
28
30
30
30
33
33
33
35
35
35
38
38
38
43
45
45
45
48
48
48
-LOG UnionAllThreeHopsTest
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person) RETURN a.fName order by d.age desc, c.age asc, b.age asc, a.age desc limit 10 UNION ALL MATCH (p:person) RETURN p.fName
---- 18
Alice
Alice
Alice
Bob
Bob
Bob
Carol
Carol
Carol
Carol
Dan
Dan
Dan
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
-STATEMENT MATCH (a) RETURN a.* UNION ALL MATCH (b) RETURN b.*
---- ok

-CASE RelList
-STATEMENT MATCH (a:person)-[r:knows]->(b:person) RETURN r.comments
---- 14
[rnme,m8sihsdnf2990nfiwf]
[njnojppo9u0jkmf,fjiojioh9h9h89hph]
[ioji232,jifhe8w99u43434]
[2huh9y89fsfw23,23nsihufhw723]
[fwehu9h9832wewew,23u9h989sdfsss]
[fwh9y81232uisuiehuf,ewnuihxy8dyf232]
[fnioh8323aeweae34d,osd89e2ejshuih12]
[fwh983-sdjisdfji,ioh89y32r2huir]
[psh989823oaaioe,nuiuah1nosndfisf]
[fwewe]
[fewh9182912e3,h9y8y89soidfsf,nuhudf78w78efw,hioshe0f9023sdsd]
[23h9sdslnfowhu2932,shuhf98922323sf]
[ahu2333333333333,12weeeeeeeeeeeeeeeeee]
[peweeeeeeeeeeeeeeeee,kowje9w0eweeeeeeeee]

-CASE RelStruct
-STATEMENT MATCH (a:person)-[r:marries]->(b:person) RETURN r.note
---- 3

long long long string
short str
-STATEMENT MATCH (a:person)-[r:knows]->(b:person) RETURN r.summary
---- 14
{locations: , transfer: }
{locations: ['london','toronto'], transfer: {day: 2012-11-21, amount: [223,5230]}}
{locations: ['toronto','waterloo'], transfer: {day: 2021-01-02, amount: [100,200]}}
{locations: ['shanghai'], transfer: {day: 1990-09-10, amount: [10]}}
{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}
{locations: ['paris'], transfer: {day: 2011-05-01, amount: [2000,5340]}}
{locations: ['vancouver'], transfer: {day: 2020-01-01, amount: [120,50]}}
{locations: ['paris','beijing'], transfer: {day: 2011-03-11, amount: [2323,50]}}
{locations: [], transfer: {day: 1980-11-21, amount: [20,5]}}
{locations: ['shanghai','nanjing'], transfer: {day: 1998-11-12, amount: [22,53240]}}
{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}
{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}
{locations: ['toronto','thisisalongcityname'], transfer: {day: 1930-11-22, amount: [18,323]}}
{locations: ['waterloo'], transfer: {day: 2000-01-01, amount: [1000,5000]}}

-CASE RelMap
-STATEMENT MATCH (a:person)-[r:knows]->(b:person) RETURN r.someMap
---- 14
{a=b}
{c=d, e=f, 1=2}













-CASE RelUnion
-STATEMENT MATCH (a:person)-[r:knows]->(b:person) RETURN r.notes
---- 14
1
1
10
10
15
2
2020-10-10
4
4
8
nice weather
cool stuff found
matthew perry
happy new year
