-DATASET JSON tinysnb_json
-BUFFER_POOL_SIZE 512000000

--

-CASE JsonifyUnion
-STATEMENT MATCH (o:organisation) RETURN to_json(o.info);
---- 3
3.119999885559082
"abcd"
"2023-12-15"

# TODO: Re-enable this test after OnDiskGraph is reworked after MVCC.
#-CASE BasicAlgorithm
#
#-STATEMENT PROJECT GRAPH PK (person {age}, knows) CALL variable_length_path(PK, 1, 1) RETURN *;
#---- error
#Parser exception: Filtering or projecting properties in graph projection is not supported.
#-STATEMENT PROJECT GRAPH PK (person, knows)
#           MATCH (a:person) WHERE a.ID = 0
#           CALL single_sp_lengths(PK, a, 2, true)
#           RETURN a.fName, node.name, length;
#---- error
#Binder exception: Cannot find property name for node.
#-STATEMENT PROJECT GRAPH PK (person, knows)
#           MATCH (a:person) WHERE a.ID = 0
#           CALL single_sp_lengths(PK, a, 2, true)
#           RETURN a.fName, node.fName, length;
#---- 4
#Alice|Alice|0
#Alice|Bob|1
#Alice|Carol|1
#Alice|Dan|1
#-STATEMENT PROJECT GRAPH PK (person, organisation, workAt, knows)
#           MATCH (a:person) WHERE a.ID = 0
#           CALL single_sp_lengths(PK, a, 2, true)
#           RETURN a.fName, node.fName, node.name, length;
#---- 6
#Alice|Alice||0
#Alice|Bob||1
#Alice|Carol||1
#Alice|Dan||1
#Alice||CsWork|2
#Alice||DEsWork|2
#-STATEMENT PROJECT GRAPH PK (person, knows) CALL weakly_connected_component(PK, true) RETURN node.fName, group_id;
#---- 8
#Alice|0
#Bob|0
#Carol|0
#Dan|0
#Elizabeth|1
#Farooq|1
#Greg|1
#Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2
#-STATEMENT PROJECT GRAPH PK (person, organisation, knows, workAt) CALL weakly_connected_component(PK, true) RETURN node.fName, node.name, group_id;
#---- 11
#Alice||0
#Bob||0
#Carol||0
#Dan||0
#Elizabeth||1
#Farooq||1
#Greg||1
#Hubert Blaine Wolfeschlegelsteinhausenbergerdorff||2
#|ABFsUni|3
#|CsWork|0
#|DEsWork|0
#-STATEMENT PROJECT GRAPH PK (person, knows) CALL page_rank(PK, true) RETURN node.fName, rank;
#---- 8
#Alice|0.125000
#Bob|0.125000
#Carol|0.125000
#Dan|0.125000
#Elizabeth|0.022734
#Farooq|0.018750
#Greg|0.018750
#Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|0.018750
