-DATASET CSV tinysnb
--

-CASE CallStorageInfo
# Expected outputs depend on number of node groups
-SKIP_NODE_GROUP_SIZE_TESTS
-STATEMENT MATCH (p:person) RETURN COUNT(p)
---- 1
8
-STATEMENT CALL storage_info('person') RETURN COUNT(*)
---- 1
56
# TODO(Guodong/Sam): FIX-ME
#-STATEMENT CALL storage_info('knows') RETURN COUNT(*)
#---- 1
#252
-STATEMENT CALL storage_info('workAt') RETURN COUNT(*)
---- 1
28

-CASE ConstantNullInfo
-STATEMENT CALL storage_info('person') WHERE column_name='person_null' AND compression<>'CONSTANT' RETURN COUNT(*)
---- 1
0

-CASE DisableFloatListDataCompression
-STATEMENT CALL storage_info('meets') WHERE column_name='fwd_location_data' AND compression <> 'UNCOMPRESSED' RETURN COUNT(*);
---- 1
0
-STATEMENT CALL storage_info('meets') WHERE column_name='bwd_location_data' AND compression <> 'UNCOMPRESSED' RETURN COUNT(*);
---- 1
0
