-DATASET CSV empty
--

-CASE CopyNodeCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT COMMIT;
---- ok
-STATEMENT MATCH (p:person) return count(p);
---- 1
5
-STATEMENT MATCH (p:person) return p.age;
---- 5
20
20
30
35
45

-CASE CopyNodeCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return count(p);
---- 1
5
-STATEMENT MATCH (p:person) return p.age;
---- 5
20
20
30
35
45

-CASE CopyNodeRollback
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT ROLLBACK;
---- ok
-STATEMENT MATCH (p:person) return count(p);
---- 1
0

-CASE CopyNodeRollbackRecovery
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return count(p);
---- 1
0

-CASE CopyRelCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT create rel table knows (FROM person TO person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MANY);
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv"
---- ok
-STATEMENT COMMIT;
---- ok
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN COUNT(e);
---- 1
6
-STATEMENT MATCH (:person)-[e:knows]->(:person) return e.date;
---- 6
2021-06-30
2021-06-30
2021-06-30
2021-06-30
1950-05-14
1950-05-14

-CASE CopyRelCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT create rel table knows (FROM person TO person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MANY);
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv"
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN COUNT(e);
---- 1
6
-STATEMENT MATCH (:person)-[e:knows]->(:person) return e.date;
---- 6
2021-06-30
2021-06-30
2021-06-30
2021-06-30
1950-05-14
1950-05-14

-CASE CopyRelRollback
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT create rel table knows (FROM person TO person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MANY);
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv"
---- ok
-STATEMENT ROLLBACK;
---- ok
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN COUNT(e);
---- 1
0

-CASE CopyRelRollbackRecovery
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT create rel table knows (FROM person TO person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MANY);
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv"
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN COUNT(e);
---- 1
0

-CASE CopyRDFCommit
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT COMMIT;
---- ok
-STATEMENT MATCH (s)-[p:UniKG_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 8
http://kuzu.io/rdf-ex#Adam|http://kuzu.io/rdf-ex#livesIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Adam|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Karissa|http://kuzu.io/rdf-ex#bornIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Karissa|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Waterloo|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#City
http://kuzu.io/rdf-ex#Zhang|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#faculty
http://kuzu.io/rdf-ex#faculty|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person
http://kuzu.io/rdf-ex#student|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person

-CASE CopyRDFCommitRecovery
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (s)-[p:UniKG_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 8
http://kuzu.io/rdf-ex#Adam|http://kuzu.io/rdf-ex#livesIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Adam|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Karissa|http://kuzu.io/rdf-ex#bornIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Karissa|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Waterloo|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#City
http://kuzu.io/rdf-ex#Zhang|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#faculty
http://kuzu.io/rdf-ex#faculty|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person
http://kuzu.io/rdf-ex#student|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person

-CASE CopyRDFRollback
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT ROLLBACK;
---- ok
-STATEMENT MATCH (s)-[p:UniKG_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 0

-CASE CopyRDFRollbackRecovery
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (s)-[p:UniKG_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 0

-CASE CopyNodeRollbackDueToError
-STATEMENT CREATE NODE TABLE person (ID INT64, name STRING, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-test/copy-error/person.csv" (HEADER=true)
---- error
Copy exception: Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.
-STATEMENT MATCH (p:person) return count(*);
---- 1
0

-CASE CopyNodeRollbackAndManualCheckpoint
-STATEMENT CREATE NODE TABLE person (ID INT64, name STRING, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-test/copy-error/person.csv" (HEADER=true)
---- error
Copy exception: Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.
-STATEMENT MATCH (p:person) return count(*);
---- 1
0
-STATEMENT CALL CHECKPOINT() RETURN *;
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
0

-CASE CopyNodeRollbackAndManualCheckpointAndReloadDB
-STATEMENT CREATE NODE TABLE person (ID INT64, name STRING, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-test/copy-error/person.csv" (HEADER=true)
---- error
Copy exception: Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.
-STATEMENT MATCH (p:person) return count(*);
---- 1
0
-STATEMENT CALL CHECKPOINT() RETURN *;
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
0
-RELOADDB
-STATEMENT MATCH (p:person) return count(*);
---- 1
0

-CASE CopyNodeRollbackAndManualCheckpoint2
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- error
Copy exception: Found duplicated primary key value 0, which violates the uniqueness constraint of the primary key column.
-STATEMENT MATCH (p:person) return count(*);
---- 1
5
-STATEMENT CALL CHECKPOINT() RETURN *;
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
5

-CASE CopyNodeCommitNormalExecutionManualCheckpoint
-STATEMENT CREATE NODE TABLE person
            (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN,
            isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE,
            registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[],
            usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID,
            PRIMARY KEY (ID));
---- ok
-STATEMENT MATCH (p:person) return *
---- 0
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true);
---- ok
-STATEMENT MATCH (p:person) return p.age
---- 5
20
20
45
30
35
-STATEMENT CALL CHECKPOINT() RETURN *;
---- ok
-STATEMENT MATCH (p:person) return p.age
---- 5
20
20
45
30
35
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson2.csv" (HEADER=false);
---- ok
-STATEMENT MATCH (p:person) return p.age
---- 8
20
20
25
30
35
40
45
83
-STATEMENT CALL CHECKPOINT() RETURN *;
---- ok
-STATEMENT MATCH (p:person) return p.age
---- 8
20
20
25
30
35
40
45
83
-RELOADDB
-STATEMENT MATCH (p:person) return p.age
---- 8
20
20
25
30
35
40
45
83

-CASE CopyNodeAndDeleteAndManualCheckpoint
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
5
-STATEMENT MATCH (a:person) DELETE a;
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
0
-STATEMENT CALL CHECKPOINT() RETURN *;
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
0

-CASE CopyNodeAndDeleteAndManualCheckpointAndReloadDB
-STATEMENT CREATE NODE TABLE person (ID INT64, fName STRING, gender INT64, isStudent BOOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration INTERVAL, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv" (HEADER=true)
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
5
-STATEMENT MATCH (a:person) DELETE a;
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
0
-STATEMENT CALL CHECKPOINT() RETURN *;
---- ok
-STATEMENT MATCH (p:person) return count(*);
---- 1
0
-RELOADDB
-STATEMENT MATCH (p:person) return count(*);
---- 1
0
