-DATASET PARQUET EMPTY

--

-CASE DemoDBCopyFromParquet

-STATEMENT CREATE NODE TABLE User1(name INT64, age DOUBLE, PRIMARY KEY (name));
---- ok
-STATEMENT Copy User1 FROM "${KUZU_ROOT_DIRECTORY}/dataset/demo-db/parquet/user.parquet";
---- error
Binder exception: Expression name has data type STRING but expected INT64. Implicit cast is not supported.
-STATEMENT CREATE NODE TABLE User2(name STRING, age DOUBLE, PRIMARY KEY (name));
---- ok
-STATEMENT Copy User2 FROM "${KUZU_ROOT_DIRECTORY}/dataset/demo-db/parquet/user.parquet";
---- ok
-STATEMENT MATCH (a:User2) RETURN a.*;
---- 4
Adam|30.000000
Karissa|40.000000
Noura|25.000000
Zhang|50.000000
-STATEMENT CREATE REL TABLE Follows1(FROM User2 TO User2, since INT64[]);
---- ok
-STATEMENT Copy Follows1 FROM "${KUZU_ROOT_DIRECTORY}/dataset/demo-db/parquet/follows.parquet";
---- error
Binder exception: Expression since has data type INT64 but expected INT64[]. Implicit cast is not supported.
-STATEMENT CREATE REL TABLE Follows2(FROM User2 TO User2, since DOUBLE);
---- ok
-STATEMENT Copy Follows2 FROM "${KUZU_ROOT_DIRECTORY}/dataset/demo-db/parquet/follows.parquet";
---- ok
-STATEMENT MATCH (a:User2)-[e:Follows2]->(b:User2) RETURN a.name, b.name, e.since;
---- 4
Adam|Karissa|2020.000000
Adam|Zhang|2020.000000
Karissa|Zhang|2021.000000
Zhang|Noura|2022.000000
