-GROUP TinySnbUpdateTest
-DATASET tinysnb

--

-CASE SetPlay
-STATEMENT MATCH (a:movies) WHERE a.length=126 SET a.description = {rating: 1.1, views: 3, release: timestamp("2011-11-11 11:11:11"), film: date("1999-01-01")}
---- ok
-QUERY MATCH (a:movies) WHERE a.length RETURN a.description
---- 1
70