# description: distinct test

-NAME SingleNodeDistinctTest
-QUERY MATCH (a:person) RETURN DISTINCT a.gender
---- 2
1
2

-NAME OneHopDistinctTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN DISTINCT a.gender, b.isStudent
---- 4
1|False
1|True
2|False
2|True

-NAME TwoHopDistinctTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN DISTINCT a.ID + 1
---- 4
1
3
4
6
