-NAME SingleNodeAggTest
-QUERY MATCH (a:person) RETURN a.age, MIN(a.ID), AVG(a.eyeSight), COUNT(*)
---- 7
20|5|4.750000|2
25|8|4.500000|1
30|2|5.100000|1
35|0|5.000000|1
40|9|4.900000|1
45|3|5.000000|1
83|10|4.900000|1

-NAME SingleNodeAggTest2
-QUERY MATCH (a:person) RETURN a.unstrDateProp1, SUM(a.unstrNumericProp), COUNT(*)
---- 2
1900-01-01||1
1950-01-01|99|2

-NAME OneHopAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN a.age, a.gender, COUNT(*)
---- 5
20|1|2
20|2|3
30|2|3
35|1|3
45|1|3

-NAME OneHopAggTest2
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN a.unstrNumericProp, SUM(a.unstrNumericProp2)
---- 3
47|60
52|
68.000000|

-NAME TwoHopAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN a.gender, COUNT(*)
---- 2
1|18
2|18


