-NAME SingleNodeAggTest
-QUERY MATCH (a:person) RETURN a.age, MIN(a.ID), AVG(a.eyeSight), COUNT(*)
---- 7
20|5|4.750000|2
25|8|4.500000|1
30|2|5.100000|1
35|0|5.000000|1
40|9|4.900000|1
45|3|5.000000|1
83|10|4.900000|1

-NAME OneHopAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN a.age, a.gender, COUNT(*)
---- 5
20|1|2
20|2|3
30|2|3
35|1|3
45|1|3

-NAME TwoHopAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN a.gender, COUNT(*)
---- 2
1|18
2|18


