# description: aggregation without groups and distinct

-NAME StructuredDateArithmeticAddInt
-QUERY MATCH (a:person) RETURN a.birthdate + 32
---- 8
1900-02-02
1900-02-02
1940-07-24
1950-08-24
1980-11-27
1980-11-27
1980-11-27
1990-12-29

-NAME SimpleCountTest
-QUERY MATCH (a:person) RETURN COUNT(a.age), COUNT(a.unstrNumericProp)
---- 1
3|8

-NAME SimpleSumTest
-QUERY MATCH (a:person) RETURN SUM(a.age), SUM(a.eyeSight), SUM(a.unstrNumericProp)
---- 1
167.000000|38.900000|298

-NAME SimpleSumWithterTest
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN SUM(a.age), SUM(a.eyeSight)
---- 1
14.100000|85

-NAME SimpleSumWithFilterTest2
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN SUM(a.age+10), SUM(a.age*2)
---- 1
170|115

-NAME SimpleAvgTest
-QUERY MATCH (a:person) RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
4.862500|37.250000

-NAME SimpleAvgWithFilterTest
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
4.700000|28.333333

#-NAME SimpleMinMaxTest
#-QUERY MATCH (a:person) RETURN MIN(a.age), MAX(a.age), MIN(a.isStudent), MAX(a.isStudent), MIN(a.eyeSight), MAX(a.eyeSight), MIN(a.birthdate), MAX(a.birthdate)
#---- 1
#1990-11-27|1900-01-01|5.100000|False|4.500000|83|20|True
