# description: test node ID comparison

-NAME TwoHopKnowsIDEqualTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) WHERE id(a) = id(c) RETURN COUNT(*)
---- 1
12

-NAME TwoHopKnowsIDNotEqualTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) WHERE id(a) <> id(c) RETURN COUNT(*)
---- 1
24

-NAME TwoHopKnowsIDGreaterThanTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) > id(b) RETURN COUNT(*)
---- 1
6

-NAME TwoHopKnowsIDGreaterThanEqualsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) WHERE id(a) >= id(c) RETURN COUNT(*)
---- 1
24

-NAME TwoHopKnowsIDLessThanTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) < id(b) RETURN COUNT(*)
---- 1
8

-NAME TwoHopKnowsIDLessThanEqualsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) WHERE id(a) <= id(c) RETURN COUNT(*)
---- 1
24

-NAME SymmetricTwoHop
-QUERY MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person) WHERE b.fName = 'Bob' AND e1.date = e2.date AND id(a) <> id(c) RETURN COUNT(*)
---- 1
2

-NAME RelIDComparison1
-QUERY MATCH (a:person)<-[r1:knows]-(b:person)-[r2:knows]->(c:person) WHERE r1._id = r2._id RETURN COUNT(*)
---- 1
14

-NAME RelIDComparison2
-QUERY MATCH (a:person)<-[r1:knows]-(b:person)-[r2:knows]->(c:person) WHERE r1._id <> r2._id RETURN COUNT(*)
---- 1
26
