# description: load csv test

-NAME LOADCSVOneHopTest
-QUERY LOAD CSV WITH HEADERS FROM "dataset/tinysnb/params.csv" AS csvLine MATCH (a:person)-[:knows]->(:person) WHERE a.age = csvLine[0] RETURN COUNT(*)
---- 3

-NAME LOADCSVSingleNodeTest
-QUERY LOAD CSV WITH HEADERS FROM "dataset/tinysnb/params.csv" AS csvLine MATCH (a:person) WHERE a.age = csvLine[0] RETURN COUNT(*)
---- 2
