# description: matching paths

-INPUT dataset/tinysnb/
-OUTPUT test/unittest_temp/
-PARALLELISM 1

-NAME OneHopKnowsFilteredTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.gender = 1 AND b.gender = 2 RETURN COUNT(*)
---- 6

-NAME OneHopKnowsFilteredTest2
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.age > 22 RETURN COUNT(*)
---- 9

-NAME OneHopKnowsFilteredTest3
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE (a.gender/2 <= 0.5) AND (b.gender*3.5 = 7.0) RETURN COUNT(*)
---- 6

-NAME OneHopKnowsFilteredTest4
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE (a.gender/2 <= 0.5) WITH b WHERE b.gender*3.5 = 7.0 RETURN COUNT(*)
---- 6

-NAME TwoHopKnowsFilteredTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) WHERE a.age = c.age RETURN COUNT(*)
---- 12

-NAME TwoHopKnowsFilteredTest2
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WITH b, a.age AS foo MATCH (b)-[e2:knows]->(c:person) WHERE foo = c.age RETURN COUNT(*)
---- 12

-NAME TwoHopKnowsFilteredTest3
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WITH b AS d, a.age AS foo MATCH (d)-[e2:knows]->(a:person) WHERE foo = a.age RETURN COUNT(*)
---- 12

-NAME TwoHopKnowsFilteredTest4
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WITH b AS d, a.age * 2.0 AS foo MATCH (d)-[e2:knows]->(a:person) WHERE foo = a.age * 2.0 RETURN COUNT(*)
---- 12
