# description: matching stars

-INPUT dataset/tinysnb/
-OUTPUT test/unittest_temp/
-PARALLELISM 1

-NAME TwoHopKnowsFilteredTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person), (a:person)-[e2:knows]->(c:person) WHERE e1.date = e2.date RETURN COUNT(*)
---- 24

-NAME TwoHopKnowsFilteredTwoQueryPartsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WITH * MATCH (a)-[e2:knows]->(c:person) WHERE e1.date = e2.date RETURN COUNT(*)
---- 24
