# description: matching nodes

-INPUT dataset/tinysnb/
-OUTPUT test/unittest_temp/
-PARALLELISM 1

-NAME StrVarAndStrLiteralConcat
-QUERY MATCH (a:person) WHERE a.fName + 'xyz' = 'Farooqxyz' RETURN COUNT(*)
---- 1

-NAME StrVarAndStrLiteralConcat2
-QUERY MATCH (a:person) WHERE 'xyz'+ a.fName = 'xyzFarooq' RETURN COUNT(*)
---- 1

-NAME StrVarAndStrLiteralConcat3
-QUERY MATCH (a:person) WHERE 'Farooqxyz' = a.fName + 'xyz' RETURN COUNT(*)
---- 1

-NAME StrVarAndStrLiteralConcat4
-QUERY MATCH (a:person) WHERE 'xyzFarooq' = 'xyz' + a.fName RETURN COUNT(*)
---- 1

-NAME StrVarAndIntLiteralConcat
-QUERY MATCH (a:person) WHERE a.fName + 10 = 'Farooq10' RETURN COUNT(*)
---- 1

-NAME StrVarAndIntLiteralConcat2
-QUERY MATCH (a:person) WHERE 'Farooq10' = a.fName + 10 RETURN COUNT(*)
---- 1

-NAME IntLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE 10 + a.fName = '10Farooq' RETURN COUNT(*)
---- 1

-NAME IntLiteralAndStrVarConcat2
-QUERY MATCH (a:person) WHERE '10Farooq' = 10 + a.fName RETURN COUNT(*)
---- 1

-NAME StrVarAndBoolLiteralConcat
-QUERY MATCH (a:person) WHERE a.fName + true = 'FarooqTrue' RETURN COUNT(*)
---- 1

-NAME StrVarAndBoolLiteralConcat2
-QUERY MATCH (a:person) WHERE 'FarooqTrue' = a.fName + true RETURN COUNT(*)
---- 1

-NAME BoolLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE false + a.fName = 'FalseFarooq' RETURN COUNT(*)
---- 1

-NAME BoolLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE 'FalseFarooq' = FALse + a.fName RETURN COUNT(*)
---- 1

-NAME StrVarAndDoubleLiteralConcat
-QUERY MATCH (a:person) WHERE a.fName + 11.7 = 'Farooq11.700000' RETURN COUNT(*)
---- 1

-NAME StrVarAndIntegerVarConcat
-QUERY MATCH (a:person) WHERE a.fName + a.age = 'Farooq25' RETURN COUNT(*)
---- 1

-NAME StrVarAndIntegerVarConcat2
-QUERY MATCH (a:person) WHERE 'Farooq25' = a.fName + a.age RETURN COUNT(*)
---- 1

-NAME IntegerVarAndStrVarConcat
-QUERY MATCH (a:person) WHERE a.age + a.fName = '25Farooq' RETURN COUNT(*)
---- 1

-NAME IntegerVarAndStrVarConcat2
-QUERY MATCH (a:person) WHERE '25Farooq' = a.age + a.fName RETURN COUNT(*)
---- 1
