# description: matching nodes

-NAME StrVarAndStrLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, 'xyz') = 'Farooqxyz' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndStrLiteralConcat2
-QUERY MATCH (a:person) WHERE concat('xyz', a.fName) = 'xyzFarooq' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndStrLiteralConcat3
-QUERY MATCH (a:person) WHERE 'Farooqxyz' = concat(a.fName, 'xyz') RETURN COUNT(*)
---- 1
1

-NAME StrVarAndStrLiteralConcat4
-QUERY MATCH (a:person) WHERE 'xyzFarooq' = concat('xyz', a.fName) RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(10)) = 'Farooq10' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntLiteralConcat2
-QUERY MATCH (a:person) WHERE 'Farooq10' = concat(a.fName, string(10)) RETURN COUNT(*)
---- 1
1

-NAME IntLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE concat(string(10), a.fName) = '10Farooq' RETURN COUNT(*)
---- 1
1

-NAME IntLiteralAndStrVarConcat2
-QUERY MATCH (a:person) WHERE '10Farooq' = concat(string(10), a.fName) RETURN COUNT(*)
---- 1
1

-NAME StrVarAndBoolLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(true)) = 'FarooqTrue' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndBoolLiteralConcat2
-QUERY MATCH (a:person) WHERE 'FarooqTrue' = concat(a.fName, string(true)) RETURN COUNT(*)
---- 1
1

-NAME BoolLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE concat(string(false), a.fName) = 'FalseFarooq' RETURN COUNT(*)
---- 1
1

-NAME BoolLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE 'FalseFarooq' = concat(string(FALse), a.fName) RETURN COUNT(*)
---- 1
1

-NAME StrVarAndDoubleLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(11.7)) = 'Farooq11.700000' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntegerVarConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(a.age)) = 'Farooq25' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntegerVarConcat2
-QUERY MATCH (a:person) WHERE 'Farooq25' = concat(a.fName, string(a.age)) RETURN COUNT(*)
---- 1
1

-NAME IntegerVarAndStrVarConcat
-QUERY MATCH (a:person) WHERE concat(string(a.age), a.fName) = '25Farooq' RETURN COUNT(*)
---- 1
1

-NAME IntegerVarAndStrVarConcat2
-QUERY MATCH (a:person) WHERE '25Farooq' = concat(string(a.age), a.fName) RETURN COUNT(*)
---- 1
1

-NAME DateVarAndStrVarConcatStructured
-QUERY MATCH (a:person) WHERE '1900-01-01Alice' = concat(string(a.birthdate), a.fName) RETURN COUNT(*)
---- 1
1

-NAME UnstrDateVarAndStrVarConcatUnstructured
-QUERY MATCH (a:person) WHERE '1950-01-01Carol' = concat(a.unstrDateProp1, a.fName) RETURN COUNT(*)
---- 1
1

-NAME TimestampVarAndStrVarConcatStructured
-QUERY MATCH (a:person) WHERE '2011-08-20 11:25:30Alice' = concat(string(a.registerTime), a.fName) RETURN COUNT(*)
---- 1
1

-NAME UnstrTimestampVarAndStrVarConcatUnstructured
-QUERY MATCH (a:person) WHERE '1962-05-22 13:11:22.562Greg' = concat(a.unstrTimestampProp1, a.fName) RETURN COUNT(*)
---- 1
1