# description: matching nodes

-NAME PersonUnstrFilteredTest1
-QUERY MATCH (a:person) WHERE a.unstrNumericProp > 48 RETURN COUNT(*)
---- 2

-NAME PersonUnstrFilteredTest2
-QUERY MATCH (a:person) WHERE a.unstrNumericProp <= 68 RETURN COUNT(*)
---- 3

-NAME PersonUnstrFilteredTest3
-QUERY MATCH (a:person) WHERE a.unstrNumericProp = 52 RETURN COUNT(*)
---- 1

-NAME PersonUnstrFilteredTest4
-QUERY MATCH (a:person) WHERE 10 + a.unstrNumericProp = 57 RETURN COUNT(*)
---- 1

-NAME PersonUnstrFilteredTest5
-QUERY MATCH (a:person) WHERE a.unstrNumericProp + a.unstrNumericProp2 = 67 RETURN COUNT(*)
---- 1

-NAME PersonUnstrFilteredTest6
-QUERY MATCH (a:person) WHERE a.unstrNumericProp - 10 > a.unstrNumericProp2 RETURN COUNT(*)
---- 1

-NAME PersonUnstrFilteredTest7
-QUERY MATCH (a:person) WHERE 'abc ' + a.unstrNumericProp = 'abc 52' RETURN COUNT(*)
---- 1

-NAME PersonUnstrFilteredTest8
-QUERY MATCH (a:person) WHERE a.unstrNumericProp2 + ' abcdefghijklm' = '20 abcdefghijklm' RETURN COUNT(*)
---- 1

-NAME PersonUnstrFilteredTest9
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.unstrNumericProp > b.unstrNumericProp RETURN COUNT(*)
---- 1
