-NAME q1
-QUERY MATCH (:hits) RETURN COUNT(*);
---- 1
99997497
