# Skipped due to OOM
-NAME q10
-QUERY MATCH (h:hits) RETURN h.RegionID, SUM(h.AdvEngineID), COUNT(*) AS c, AVG(h.ResolutionWidth), COUNT(DISTINCT h.UserID) ORDER BY c DESC LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
107|120470|1516690|1548.602897|272448
169|100887|3320229|1465.907373|604583
184|55526|1755192|1506.808297|322661
208|285925|4261812|1285.259325|831676
229|2077656|18295832|1506.085243|2845673
2|441662|6687587|1479.838654|1081016
32|81498|1843518|1538.037657|216010
34|161779|1792369|1548.360152|299479
42|108820|1542717|1587.108521|243181
51|98212|1435578|1579.886035|211505
