# Skipped due to OOM
-NAME q11
-QUERY MATCH (h:hits) WHERE h.MobilePhoneModel <> '' RETURN h.MobilePhoneModel, COUNT(DISTINCT h.UserID) AS u ORDER BY u DESC LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
3110000|1871
A500|16046
GT-I9500|1598
GT-P7300B|1907
N8-00|5565
ONE TOUCH 6030A|2759
eagle75|1492
iPad|1090347
iPhone|45758
iPho|3300
