-NAME q13
-QUERY MATCH (h:hits) WHERE h.SearchPhrase <> '' RETURN h.SearchPhrase, COUNT(*) AS c ORDER BY c DESC LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
galaxy table|16746
албатрутдин|34675
дружке помещение|17284
карелки|70263
мангу в зарабей грама|19195
сколько мытищи|12317
смотреть онлайн бесплатно|21647
смотреть онлайн|24580
смотреть|19707
экзоидные|16620
