-NAME q15
-QUERY MATCH (h:hits) WHERE h.SearchPhrase <> '' RETURN h.SearchEngineID, h.SearchPhrase, COUNT(*) AS c ORDER BY c DESC LIMIT 10;
---- 10
2|албатрутдин|13716
2|дружке помещение|11946
2|карелки|46258
2|мангу в зарабей грама|18871
2|смотреть онлайн бесплатно|14909
2|смотреть онлайн|16905
2|смотреть|13108
2|экзоидные|13414
3|албатрутдин|16748
3|карелки|12815
