-NAME q16
-QUERY MATCH (h:hits) RETURN h.UserID, COUNT(*) ORDER BY COUNT(*) DESC LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
1090981537032625664|6197
1313338681122957056|29097
1907779576417363456|25333
2305303682471783424|10597
5730251990344211456|6019
6018350421959114752|6678
7280399273658729472|6411
770542365400669056|4906
7982623143712728064|7584
835157184735512960|5211
