-NAME q18
-QUERY MATCH (h:hits) RETURN h.UserID, h.SearchPhrase, COUNT(*) LIMIT 10;
---- 10
-8488273173461460992||2
-8514752263171433472||41
110168928926046624|кинопоиск расписания|1
1375458558971979008||9
1375537539899691008|инстанец жизнь|1
1814252434386357248||1
1815393289342223616||11
2968441617996337664||4
7508088692646918144||2
7513039686231853056||15
