-NAME q20
-QUERY MATCH (h:hits) WHERE h.UserID = 435090932899640449 RETURN h.UserID;
---- 4
435090932899640449
435090932899640449
435090932899640449
435090932899640449
