-NAME q27
-QUERY MATCH (h:hits) WHERE h.SearchPhrase <> '' RETURN h.SearchPhrase ORDER BY h.EventTime, h.SearchPhrase LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
galaxy s4 zoom фильм
авом констеть ребенка краево
анапа оперевянные волшебную
брита ганам котлы на шерлок
компьютерапии серия нарий
ночно китая женщины
отдыха чем прокат
расписание мультиварка для
симптомы регистратов
фильм небольшой бизнеса североятно
