-NAME q28
-QUERY MATCH (h:hits) WHERE h.URL <> '' WITH h.CounterID as id, AVG(SIZE(h.URL)) as l, COUNT(*) as c WHERE c > 100000 RETURN id, l, c ORDER BY l DESC LIMIT 25;
---- 25
114157|139.118189|216408
122612|230.684416|3574007
146891|74.130115|605286
1634|187.956263|323229
186300|82.059371|802561
188878|90.263809|311998
191697|85.035511|124664
196239|95.013987|163797
199550|106.891796|7115413
220992|103.758678|494614
230962|74.732235|169223
233773|453.162778|2938865
234004|198.089366|238660
245438|261.555958|2510103
249603|90.009341|120325
256004|121.861003|858171
38|73.967976|507770
3922|85.886398|8527069
515|123.966224|146907
62|91.942688|738150
77639|74.656317|253961
786|180.360091|120528
95427|116.919213|374306
96948|92.113461|396093
97467|82.762636|131178
