-NAME q29
-SKIP
-QUERY MATCH (h:hits) WHERE h.Referer <> '' WITH REGEXP_REPLACE(h.Referer, '^https?://(?:www\\.)?([^/]+)/.*$', '\\1') as k, AVG(SIZE(h.Referer)) as l, COUNT(*) as c, MIN(h.Referer) as r WHERE c > 100000 RETURN k, l, c, r ORDER BY l DESC;
-SKIP_COMPARE_RESULT
---- 1
