-NAME q31
-QUERY MATCH (h:hits) WHERE h.SearchPhrase <> '' RETURN h.SearchEngineID, h.ClientIP, COUNT(*) as c, SUM(h.IsRefresh), AVG(h.ResolutionWidth) order by c DESC LIMIT 10;
---- 10
2|-1743596151|1080|24|1559.809259
2|-1870623097|1102|31|1555.658802
2|-1945757555|1105|30|1557.387330
2|-265917476|1058|32|1556.200378
2|-465813166|1082|30|1541.253235
2|-497906719|1140|36|1543.414035
2|-631062503|1083|31|1581.817175
2|-807147100|1144|35|1553.198427
2|1138507705|1633|35|1408.012247
2|1740861572|1331|28|1577.945905
