-NAME q32
-QUERY MATCH (h:hits) WHERE h.SearchPhrase <> '' RETURN h.WatchID, h.ClientIP, COUNT(*) as c, SUM(h.IsRefresh), AVG(h.ResolutionWidth) order by c DESC LIMIT 10;
---- 10
4623195578698549248|120985313|1|0|1368.000000
4987103495559654400|1197128449|1|0|1638.000000
5119387885995177984|-1861350339|1|0|1996.000000
5119566844721801216|1423101416|1|0|1368.000000
5273876886283410432|-2041902320|1|0|1828.000000
6132518112945110016|-1140388648|1|0|1996.000000
7350883302794766336|-836781614|1|0|1638.000000
8002371613096159232|1671471531|1|0|1638.000000
8410881608486488064|1136794598|1|0|1996.000000
8626202172156524544|1248342330|1|0|1638.000000
