-NAME q33
-QUERY MATCH (h:hits) RETURN h.WatchID, h.ClientIP, COUNT(*) as c, SUM(h.IsRefresh), AVG(h.ResolutionWidth) ORDER BY c DESC LIMIT 10;
---- 10
5890901000654778368|1940569553|1|1|1750.000000
6655575552203051008|1611957945|2|0|1638.000000
7169513251176572928|-193046031|1|1|1368.000000
7224410078130478080|-776509581|2|0|1368.000000
7813852690724718592|2049502088|1|0|1828.000000
7872290283381123072|1420902299|1|0|1604.000000
7904046282518428672|1509330109|2|0|1368.000000
8515822419571041280|2106420022|1|0|1638.000000
8566928176839891968|-1402644643|2|0|1368.000000
8824323193115776000|-1262139876|1|0|1750.000000
