-NAME q34
-QUERY MATCH (h:hits) RETURN h.URL, COUNT(*) as c ORDER BY c DESC LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
http://auto_fiat_dlya-bluzki%2F8536.30.18&he=900&with|507995
http://bdsm_po_yers=0&with_video|791465
http://kinopoisk.ru/vladimir.irr.ru|354690
http://kinopoisk.ru|1625250
http://liver.ru/belgorod/page/1006.jки/доп_приборы|3288173
http://liver.ru/place_rukodel=365115eb7bbb90|359893
http://smeshariki.ru/region|514984
http://tienskaia-moda|289355
http://video.yandex.ru/search/?jenre=50&s_yers|318979
http://video.yandex|582400
