-NAME q4
-QUERY MATCH (h:hits) RETURN AVG(h.UserID);
---- 1
2528953029789715968.000000
