-NAME q40
-QUERY MATCH (h:hits) WHERE h.CounterID = 62 AND h.EventDate >= '2013-07-01' AND h.EventDate <= '2013-07-31' AND h.IsRefresh = 0 RETURN h.TraficSourceID, h.SearchEngineID, h.AdvEngineID, CASE WHEN (h.SearchEngineID = 0 AND h.AdvEngineID = 0) THEN h.Referer ELSE '' END AS Src, h.URL AS Dst, COUNT(*) AS PageViews ORDER BY PageViews DESC SKIP 1000 LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
-1|0|0|http://state=19945206/foto-4/login-2006/makumiroshoowbiz/down%2Fholodilnik.ru/76/~54|http://irr.ru/index.php?showalbum/login-leniya7777294,938303130|15
-1|0|0|http://state=19945206/foto-4/login-2006/makumirostova.ru/a-album/login.2/secondary/search|http://irr.ru/index.php?showalbum/login-leniya7777294,938303130|15
-1|0|0|http://state=19945206/foto-4/login-2491724/?bundlers/search?text|http://irr.ru/index.php?showalbum/login-kapusta-advertising/idShare/hayya-523015][]=7011791_0,15|15
-1|0|0|http://state=19945206/foto-4/login-verb=1&prepairs=0&city[1|http://irr.ru/index.php?showalbum/lounona-muzhchin-kupaljinik-chernyj-odnoe/sankt|15
-1|0|0|http://state=19945206/foto-4/login.1Uv1UfqCA8SonYC4BQ&usg=AFQjCNGB3pBUuKY1jJPP34DYBA|http://irr.ru/index.php?showalbum/login-tank-sale/search%3Fmode=&page_type|15
-1|0|0|http://state=19945206/foto-4/loginskikh-viana.irr.ru/GameMain.aspx?sle=1/house.ru/yandsearch?text=все серии&sa=t&rct=j&q=аэратор&item.aspx?sort_key=9582&text=meiz/Stoimost-iAQ4MyP5gLAD&url=wwww.migom.by/?crnd=59039395&op_category_id=&maxprice=2&state=200&custom=0&doorov_i_magicbay.ru/moscow/90/incidential/BuyCongrad.irr.ru/men.aspx?group_cod_1s=1680&bpp=6&currency=RUR/keywords=блокарнизе 2000024879166191/offe.aspx|http://irr.ru/index.php?showalbum/login-kapusta-advertist/?act=full&Form.aspx?group_cod|15
1|0|0|http://mysw.info/node/215455&text|http://irr.ru/index.php?showalbum/logabass.ru/cation&op_categoriya%2Ford-antent3.adfox.ru/leche_sig=b52a8s8gE|15
1|0|0|http://mysw.info/node/215455&text|http://irr.ru/index.php?showalbum/logabass.ru/cation&op_category&op_page4/#67|15
1|0|0|http://mysw.info/node/215455&text|http://irr.ru/index.php?showalbum/logabass.ru/cation&op_category_id=9584%26pz%3D0%26ntype|15
1|0|0|http://mysw.info/node/215455&text|http://irr.ru/index.php?showalbum/login-3284][11]=6625f3634571&state=0&expand_search=0&damagecache/wm/2013&price_do=50000&page/1772,903742726108784&op_uid|15
