-NAME q6
-QUERY MATCH (h:hits) RETURN COUNT(DISTINCT h.SearchPhrase);
---- 1
6019102
