-NAME q9
-QUERY MATCH (h:hits) RETURN h.RegionID, COUNT(DISTINCT h.UserID) AS u ORDER BY u DESC LIMIT 10;
-SKIP_COMPARE_RESULT
---- 10
107|272448
158|307152
169|604583
184|322661
208|831676
229|2845673
2|1081016
34|299479
42|243181
55|286525
