# description: extending frontiers.

-NAME FourHopThreeKnowsOneStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person)-[e4:studyAt]->(e:organisation) RETURN COUNT(*)
---- 54

-NAME KnowsOneToTwoHopTest
-QUERY MATCH (a:person)-[:knows*1..2]->(b:person) RETURN COUNT(*)
---- 50

-NAME KnowsTwoToFourHopTest
-QUERY MATCH (a:person)-[:knows*2..4]->(b:person) RETURN COUNT(*)
---- 468

-NAME KnowsKnows2To4HopTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows*2..4]->(c:person) RETURN COUNT(*)
---- 1404
