# description: matching paths

-NAME MultiQueryOneHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WITH b.age AS m RETURN m
---- 14

-NAME MultiQueryTwoHopKnowsTest
-QUERY MATCH (a:person)-[:knows]->(b:person) WITH b AS m WITH m AS n MATCH (n)-[e2:knows]->(c:person) RETURN COUNT(*)
---- 36

-NAME MultiQueryThreeHopTwoKnowsOneWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WITH * MATCH (b)-[e2:knows]->(c:person)-[e3:workAt]->(d:organisation) RETURN COUNT(*)
---- 18

-NAME OpenWedgeKnowsTest3
-QUERY MATCH (b:person)<-[e1:knows]-(a:person) WITH a AS k MATCH (k)-[e2:knows]->(c:person),(k)-[e3:knows]->(d:person) RETURN COUNT(*)
---- 116
