# description: matching nodes

-NAME PersonNodesTest
-QUERY MATCH (a:person) RETURN COUNT(*)
---- 1
8

-NAME OrganizationNodesTest
-QUERY MATCH (a:organisation) RETURN COUNT(*)
---- 1
3
