# description: matching nodes

-INPUT dataset/tinysnb/
-OUTPUT test/unittest_temp/
-PARALLELISM 1

-NAME PersonNodesTest
-QUERY MATCH (a:person) RETURN COUNT(*)
---- 7

-NAME OrganizationNodesTest
-QUERY MATCH (a:organisation) RETURN COUNT(*)
---- 3
