# description: matching paths

-NAME OneHopKnowsTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN COUNT(*)
---- 14

-NAME OneHopStudyAtTest
-QUERY MATCH (a:person)-[e1:studyAt]->(b:organisation) RETURN COUNT(*)
---- 3

-NAME OneHopWorkAtTest
-QUERY MATCH (a:person)-[e1:workAt]->(b:organisation) RETURN COUNT(*)
---- 3

-NAME TwoHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) RETURN COUNT(*)
---- 36

-NAME TwoHopKnowsStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 7

-NAME TwoHopKnowsWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 6

-NAME ThreeHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person) RETURN COUNT(*)
---- 108

-NAME ThreeHopTwoKnowsOneStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:studyAt]->(d:organisation) RETURN COUNT(*)
---- 18

-NAME ThreeHopTwoKnowsOneWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:workAt]->(d:organisation) RETURN COUNT(*)
---- 18

-NAME FourHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person)-[e4:knows]->(e:person) RETURN COUNT(*)
---- 324

-NAME FourHopThreeKnowsOneStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person)-[e4:studyAt]->(e:organisation) RETURN COUNT(*)
---- 54

#-NAME FiveHopKnowsTest
#-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person)-[e4:knows]->(e:person)-[e5:knows]->(f:person) RETURN COUNT(*)
#---- 972
#FiveHopKnowsTest