# description: matching paths

-NAME OneHopKnowsTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN COUNT(*)
---- 1
14

-NAME OneHopStudyAtTest
-QUERY MATCH (a:person)-[e1:studyAt]->(b:organisation) RETURN COUNT(*)
---- 1
3

-NAME OneHopWorkAtTest
-QUERY MATCH (a:person)-[e1:workAt]->(b:organisation) RETURN COUNT(*)
---- 1
3

-NAME TwoHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) RETURN COUNT(*)
---- 1
36

-NAME TwoHopKnowsStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 1
7

-NAME TwoHopKnowsWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 1
6

-NAME ThreeHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person) RETURN COUNT(*)
---- 1
108

-NAME ThreeHopTwoKnowsOneStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:studyAt]->(d:organisation) RETURN COUNT(*)
---- 1
18

-NAME ThreeHopTwoKnowsOneWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:workAt]->(d:organisation) RETURN COUNT(*)
---- 1
18

-NAME FourHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person)-[e4:knows]->(e:person) RETURN COUNT(*)
---- 1
324

-NAME FourHopThreeKnowsOneStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person)-[e4:studyAt]->(e:organisation) RETURN COUNT(*)
---- 1
54

