# description: matching stars

-NAME OpenWedgeKnowsTest1
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:knows]->(c:person) RETURN COUNT(*)
---- 40

-NAME OpenWedgeKnowsStudyAtTest
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 6

-NAME OpenWedgeKnowsWorkAtTest
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 8

-NAME OpenWedgeKnowsTest2
-QUERY MATCH (b:person)-[e1:knows]->(a:person)<-[e2:knows]-(c:person) RETURN COUNT(*)
---- 38

-NAME OpenWedgeStudyAtTest
-QUERY MATCH (b:organisation)<-[e1:studyAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 3

-NAME OpenWedgeWorkAtTest1
-QUERY MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 3

-NAME OpenWedgeWorkAtTest2
-QUERY MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 0

-NAME OpenWedgeKnowsTest3
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:knows]->(c:person),(a)-[e3:knows]->(d:person) RETURN COUNT(*)
---- 116

-NAME OpenWedgeKnowsTest4
-QUERY MATCH (b:person)-[e1:knows]->(a:person)<-[e2:knows]-(c:person),(a)<-[e3:knows]-(d:person) RETURN COUNT(*)
---- 110

-NAME OpenTwoHopWedgeKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person),(a:person)-[e3:knows]->(d:person)-[e4:knows]->(e:person) RETURN COUNT(*)
---- 324

-NAME OpenTwoHopWedgeKnowsTest3
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WITH * MATCH (b)-[e2:knows]->(c:person) WITH * MATCH (a)-[e3:knows]->(d:person)-[e4:knows]->(e:person) RETURN COUNT(*)
---- 324
