-NAME q14
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) WHERE comment.length < 3 RETURN count(*)
---- 1
18338496