-NAME q18
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) WHERE substr(comment.browserUsed, 1, 2) = 'Ch' RETURN count(*)
---- 1
61911128