-NAME zonemap-node
-QUERY MATCH (c:Comment) WHERE c.length > 2000 RETURN *;
---- 0
