-NAME zonemap-node
-COMPARE_RESULT 1
-QUERY MATCH (c:Comment) WHERE c.length > 2000 RETURN *;
---- 0
