-NAME zonemap-rel
-QUERY MATCH (a:person)-[l:likes_comment]->(b:comment) WHERE l.creationDate > timeStamp("2025-09-13 09:35:59.391") RETURN *;
---- 0
