# description: handling of date properties

-NAME DateLiteralEqualityComparison
-QUERY MATCH (a:person) WHERE a.birthdate = date('1900-1-1') RETURN COUNT(*)
---- 1
2

-NAME DateLiteralGreaterThanComparison
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE b.birthdate > date('1970-09-11') RETURN COUNT(*)
---- 1
2

-NAME DateLiteralLessThanComparison
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.date < date('1960-09-11') RETURN COUNT(*)
---- 1
6

-NAME StructuredDateComparisonAcrossNodesEquality
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.birthdate = b.birthdate RETURN COUNT(*)
---- 1
4

-NAME StructuredDateComparisonAcrossNodesNonEquality
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.birthdate <> b.birthdate RETURN COUNT(*)
---- 1
10

-NAME StructuredDateComparisonAcrossNodesLessThan
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.birthdate < b.birthdate RETURN COUNT(*)
---- 1
5

-NAME StructuredDateComparisonAcrossNodesLessThanOrEqualTo
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.birthdate <= b.birthdate RETURN COUNT(*)
---- 1
9

-NAME StructuredDateComparisonAcrossNodesGreaterThan
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.birthdate > b.birthdate RETURN COUNT(*)
---- 1
5

-NAME StructuredDateComparisonAcrossNodesGreaterThanOrEqualTo
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.birthdate >= b.birthdate RETURN COUNT(*)
---- 1
9

-NAME StructuredDateComparisonAcrossEdges
-QUERY MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person) WHERE e1.date = e2.date AND id(a) <> id(c) RETURN COUNT(*)
---- 1
10

#  For the below query, these are the 3 edges that should pass the filter: (1) 5, 2,1950-05-14 (5's birthday is 1950-7-23)
#  (2-3) 7,8,1905-12-12 and 7,9,1905-12-12 (7's birthday is 1980-10-26)
-NAME StructuredDateComparisonAcrossEdgeAndNode
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.birthdate > e1.date  RETURN COUNT(*)
---- 1
3

-NAME UnstructuredStructuredDateComparison
-QUERY MATCH (a:person) WHERE a.birthdate = a.unstrDateProp1 RETURN COUNT(*)
---- 1
1

-NAME TwoUnstructuredDateComparison
-QUERY MATCH (a:person) WHERE a.unstrDateProp1 <> a.unstrDateProp2 RETURN COUNT(*)
---- 1
2

-NAME TwoUnstructuredDateComparison
-QUERY MATCH (a:person) WHERE a.unstrDateProp1 >= a.unstrDateProp2 RETURN COUNT(*)
---- 1
1

-NAME UnstructuredDateLiteralComparison
-QUERY MATCH (a:person) WHERE a.unstrDateProp1 <= date('1990-02-02') RETURN COUNT(*)
---- 1
3

-NAME StructuredDateArithmeticAddInt
-QUERY MATCH (a:person) RETURN a.birthdate + 32
---- 8
1900-02-02
1900-02-02
1940-07-24
1950-08-24
1980-11-27
1980-11-27
1980-11-27
1990-12-29

-NAME UnstructuredDateArithmeticAddInt
-QUERY MATCH (a:person) RETURN a.unstrDateProp1 + 41
---- 8





1900-02-11
1950-02-11
1950-02-11

-NAME StructuredDateArithmeticAddInterval1
-QUERY MATCH (a:person) WHERE a.birthdate <> date('1900-01-01') RETURN a.birthdate + interval('2 years 3 months 4 days')
---- 6
1942-09-26
1952-10-27
1983-01-30
1983-01-30
1983-01-30
1993-03-03

-NAME StructuredDateArithmeticAddInterval2
-QUERY MATCH (a:person) WHERE a.birthdate <> date('1900-01-01') RETURN a.birthdate + interval('47 hours 60 minutes')
---- 6
1940-06-24
1950-07-25
1980-10-28
1980-10-28
1980-10-28
1990-11-29

-NAME UnstructuredDateArithmeticAddInterval
-QUERY MATCH (a:person) RETURN a.unstrDateProp2 + interval('20 years 3 days 32 minutes 10512 ms')
---- 8





1940-01-04
1970-01-04
1990-01-04

-NAME structuredDateArithmeticSubtractInt
-QUERY MATCH (a:person) WHERE a.birthdate <> date('1900-01-01') RETURN a.birthdate - 25
---- 6
1940-05-28
1950-06-28
1980-10-01
1980-10-01
1980-10-01
1990-11-02

-NAME UnstructuredDateArithmeticSubtractInt
-QUERY MATCH (a:person) RETURN a.unstrDateProp1 - 25
---- 8





1899-12-07
1949-12-07
1949-12-07

-NAME StructuredDateArithmeticSubtractInterval
-QUERY MATCH (a:person) WHERE a.birthdate <> date('1900-01-01') RETURN a.birthdate - interval('4 years 11 months 31 days 100 seconds')
---- 6
1935-06-21
1945-07-23
1975-10-26
1975-10-26
1975-10-26
1985-11-26

-NAME UnstructuredDateArithmeticSubtractInterval
-QUERY MATCH (a:person) RETURN a.unstrDateProp1 - interval('15 month 32 days 30 minutes 40 minute')
---- 8





1898-08-30
1948-08-30
1948-08-30

-NAME StructuredDateArithmeticSubtractDate
-QUERY MATCH (a:person) RETURN a.birthdate - date('1920-03-21')
---- 8
-7384
-7384
11081
22134
22134
22134
25818
7398

-NAME UnstructuredDateArithmeticSubtractDate
-QUERY MATCH (a:person) RETURN a.unstrDateProp1 - date('1921-05-04')
---- 8





-7793
10469
10469

-NAME StructuredDateMixedArithmeticOperations
-QUERY MATCH (a:person) RETURN a.birthdate + 10 - interval('4 years 2 months 3 days') - 20 - date('1912-04-12');
---- 8
-6019
-6019
8763
12446
23499
23499
23499
27183

-NAME UnstructuredDateMixedArithmeticOperations
-QUERY MATCH (a:person) RETURN a.unstrDateProp1 + 100 - interval('11 months 12 days') - 10 - date('1945-04-12');
---- 8





-16794
1468
1468

-NAME StructuredDateConcatenateString
-QUERY MATCH (a:person) RETURN concat(concat('Birthdate: ', string(a.birthdate)), ' test')
---- 8
Birthdate: 1900-01-01 test
Birthdate: 1900-01-01 test
Birthdate: 1940-06-22 test
Birthdate: 1950-07-23 test
Birthdate: 1980-10-26 test
Birthdate: 1980-10-26 test
Birthdate: 1980-10-26 test
Birthdate: 1990-11-27 test

-NAME UnstructuredDateConcatenateString
-QUERY MATCH (a:person) RETURN concat(concat('unstrDate: ', a.unstrDateProp1), ' test')
---- 8





unstrDate: 1900-01-01 test
unstrDate: 1950-01-01 test
unstrDate: 1950-01-01 test

-NAME CastToDate
-QUERY MATCH (a:organisation) RETURN date(a.unstrStringProp)
---- 3


1900-01-01
