# description: handling of list properties

-NAME NodeLISTStructuredPropertiesTest
-QUERY MATCH (a:person) RETURN a.workedHours, a.usedNames, a.courseScoresPerTerm
---- 8
[1,9]|[Wolfeschlegelstein,Daniel]|[[7,4],[8,8],[9]]
[10,11,12,3,4,5,6,7]|[Ad,De,Hi,Kye,Orlan]|[[7],[10],[6,7]]
[10,5]|[Aida]|[[10,8],[6,7,8]]
[12,8]|[Bobby]|[[8,9],[9,10]]
[1]|[Grad]|[[10]]
[2]|[Ein]|[[6],[7],[8]]
[3,4,5,6,7]|[Fesdwe]|[[8]]
[4,5]|[Carmen,Fred]|[[8,10]]

-NAME RelLISTPropertyTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN e.comments
---- 14
[rnme,m8sihsdnf2990nfiwf]
[njnojppo9u0jkmf,fjiojioh9h9h89hph]
[ioji232,jifhe8w99u43434]
[2huh9y89fsfw23,23nsihufhw723]
[fwehu9h9832wewew,23u9h989sdfsss]
[fwh9y81232uisuiehuf,ewnuihxy8dyf232]
[fnioh8323aeweae34d,osd89e2ejshuih12]
[fwh983-sdjisdfji,ioh89y32r2huir]
[psh989823oaaioe,nuiuah1nosndfisf]
[fwewe]
[fewh9182912e3,h9y8y89soidfsf,nuhudf78w78efw,hioshe0f9023sdsd]
[23h9sdslnfowhu2932,shuhf98922323sf]
[ahu2333333333333,12weeeeeeeeeeeeeeeeee]
[peweeeeeeeeeeeeeeeee,kowje9w0eweeeeeeeee]
