-DATASET CSV empty
--

-CASE AzureExtensionNotLoaded
-STATEMENT CREATE NODE TABLE Test AS LOAD FROM "az://kuzu-test/vPerson.csv" (file_format='azure') RETURN *;
---- error
Binder exception: Cannot load from file type azure. If this file type is part of a kuzu extension please load the extension then try again.

-CASE AzureScan
-STATEMENT LOAD EXTENSION '${KUZU_ROOT_DIRECTORY}/extension/azure/build/libazure.kuzu_extension';
---- ok
-STATEMENT CALL current_setting('AZURE_CONNECTION_STRING') return *;
---- ok
-STATEMENT CREATE NODE TABLE Person AS LOAD FROM "az://kuzu-test/vPerson.csv" (file_format='azure') RETURN *;
---- ok
-STATEMENT MATCH (a:Person) RETURN a.fname, a.ISStudent, a.age;
---- 5
Alice|True|35
Bob|True|30
Carol|False|45
Dan|False|20
Elizabeth|False|20
-STATEMENT COPY Person FROM (LOAD FROM "az://kuzu-test/vPerson2.csv" (file_format='azure') RETURN *);
---- ok
-STATEMENT MATCH (a:Person) RETURN a.fname, a.Gender, a.isWorker;
---- 8
Alice|1|False
Bob|2|False
Carol|1|True
Dan|2|True
Elizabeth|1|True
Farooq|2|False
Greg|2|False
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2|True
-STATEMENT CREATE REL TABLE Knows (FROM Person TO Person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MANY);
---- ok
-STATEMENT COPY Knows FROM (LOAD FROM "az://kuzu-test/eKnows.csv" (file_format='azure') RETURN *);
---- ok
-STATEMENT MATCH (a:Person)-[e:Knows]->(b:Person) RETURN a.fname, b.fname;
---- 6
Alice|Dan
Alice|Carol
Alice|Bob
Bob|Dan
Bob|Carol
Bob|Alice
