-NAME q20
-QUERY MATCH (comment:Comment) RETURN MIN(comment.locationIP)
---- 1
1.0.0.0