-NAME q21
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) RETURN LENGTH(MIN(comment.content))
---- 1
1756