-NAME q22
-COMPARE_RESULT 1
-QUERY MATCH (post:Post) RETURN MIN(post.language)
---- 1
ar