-NAME q22
-QUERY MATCH (post:Post) RETURN MIN(post.language)
---- 1
ar