-GROUP TCKTemporal8
-DATASET CSV tck

--


#  Should add or subtract duration to or from date
-CASE Scenario1
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {dur: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 2})});
-STATEMENT WITH date({year: 1984, month: 10, day: 11}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1997-03-25'|'1972-04-27'

#  Should add or subtract duration to or from date
-CASE Scenario2
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {dur: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT WITH date({year: 1984, month: 10, day: 11}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1984-10-28'|'1984-09-25'

#  Should add or subtract duration to or from date
-CASE Scenario3
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {dur: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT WITH date({year: 1984, month: 10, day: 11}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1997-10-11'|'1971-10-12'

#  Should add or subtract duration to or from local time
-CASE Scenario4
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {dur: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 2})});
-STATEMENT WITH localtime({hour: 12, minute: 31, second: 14, nanosecond: 1}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'04:44:24.000000003'|'20:18:03.999999999'

#  Should add or subtract duration to or from local time
-CASE Scenario5
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {dur: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT WITH localtime({hour: 12, minute: 31, second: 14, nanosecond: 1}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'04:20:24.000000001'|'20:42:04.000000001'

#  Should add or subtract duration to or from local time
-CASE Scenario6
-STATEMENT CREATE (:Duration {dur: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT WITH localtime({hour: 12, minute: 31, second: 14, nanosecond: 1}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'22:29:27.500000004'|'02:33:00.499999998'
-STATEMENT CREATE (:Duration {dur: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 2})});
-STATEMENT WITH time({hour: 12, minute: 31, second: 14, nanosecond: 1, timezone: '+01:00'}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'04:44:24.000000003+01:00'|'20:18:03.999999999+01:00'

-STATEMENT CREATE (:Duration {dur: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT WITH time({hour: 12, minute: 31, second: 14, nanosecond: 1, timezone: '+01:00'}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'04:20:24.000000001+01:00'|'20:42:04.000000001+01:00'

-STATEMENT CREATE (:Duration {dur: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT WITH time({hour: 12, minute: 31, second: 14, nanosecond: 1, timezone: '+01:00'}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'22:29:27.500000004+01:00'|'02:33:00.499999998+01:00'

-STATEMENT CREATE (:Duration {dur: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 2})});
-STATEMENT WITH localdatetime({year: 1984, month: 10, day: 11, hour: 12, minute: 31, second: 14, nanosecond: 1}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1997-03-26T04:44:24.000000003'|'1972-04-26T20:18:03.999999999'

-STATEMENT CREATE (:Duration {dur: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT WITH localdatetime({year: 1984, month: 10, day: 11, hour: 12, minute: 31, second: 14, nanosecond: 1}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1984-10-29T04:20:24.000000001'|'1984-09-24T20:42:04.000000001'

-STATEMENT CREATE (:Duration {dur: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT WITH localdatetime({year: 1984, month: 10, day: 11, hour: 12, minute: 31, second: 14, nanosecond: 1}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1997-10-11T22:29:27.500000004'|'1971-10-12T02:33:00.499999998'

-STATEMENT CREATE (:Duration {dur: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 2})});
-STATEMENT WITH datetime({year: 1984, month: 10, day: 11, hour: 12, minute: 31, second: 14, nanosecond: 1, timezone: '+01:00'}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1997-03-26T04:44:24.000000003+01:00'|'1972-04-26T20:18:03.999999999+01:00'

-STATEMENT CREATE (:Duration {dur: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT WITH datetime({year: 1984, month: 10, day: 11, hour: 12, minute: 31, second: 14, nanosecond: 1, timezone: '+01:00'}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1984-10-29T04:20:24.000000001+01:00'|'1984-09-24T20:42:04.000000001+01:00'

-STATEMENT CREATE (:Duration {dur: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT WITH datetime({year: 1984, month: 10, day: 11, hour: 12, minute: 31, second: 14, nanosecond: 1, timezone: '+01:00'}) AS x
           MATCH (d:Duration)
           RETURN x + d.dur AS sum, x - d.dur AS diff;
## Outcome: the result should be, in any order:
---- 1
'1997-10-11T22:29:27.500000004+01:00'|'1971-10-12T02:33:00.499999998+01:00'

#  Should add or subtract durations
-CASE Scenario16
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})})
           CREATE (:Duration2 {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P24Y10M28DT32H26M20.000000002S'|'PT0S'

#  Should add or subtract durations
-CASE Scenario17
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})})
           CREATE (:Duration2 {date: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P12Y6MT32H2M20.000000001S'|'P12Y4M28DT24M0.000000001S'

#  Should add or subtract durations
-CASE Scenario18
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})})
           CREATE (:Duration2 {date: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P25Y4M43DT50H11M23.500000004S'|'P-6M-15DT-17H-45M-3.500000002S'

#  Should add or subtract durations
-CASE Scenario19
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})})
           CREATE (:Duration2 {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P12Y6MT32H2M20.000000001S'|'P-12Y-4M-28DT-24M-0.000000001S'

#  Should add or subtract durations
-CASE Scenario20
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})})
           CREATE (:Duration2 {date: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P2M-28DT31H38M20S'|'PT0S'

#  Should add or subtract durations
-CASE Scenario21
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})})
           CREATE (:Duration2 {date: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P13Y15DT49H47M23.500000003S'|'P-12Y-10M-43DT-18H-9M-3.500000003S'

#  Should add or subtract durations
-CASE Scenario22
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})})
           CREATE (:Duration2 {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P25Y4M43DT50H11M23.500000004S'|'P6M15DT17H45M3.500000002S'

#  Should add or subtract durations
-CASE Scenario23
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})})
           CREATE (:Duration2 {date: duration({months: 1, days: -14, hours: 16, minutes: -12, seconds: 70})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P13Y15DT49H47M23.500000003S'|'P12Y10M43DT18H9M3.500000003S'

#  Should add or subtract durations
-CASE Scenario24
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration1 {date: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})})
           CREATE (:Duration2 {date: duration({years: 12.5, months: 5.5, days: 14.5, hours: 16.5, minutes: 12.5, seconds: 70.5, nanoseconds: 3})});
-STATEMENT MATCH (dur:Duration1), (dur2: Duration2)
           RETURN dur.date + dur2.date AS sum, dur.date - dur2.date AS diff;
## Outcome: the result should be, in any order:
---- 1
'P25Y10M58DT67H56M27.000000006S'|'PT0S'

#  Should multiply or divide durations by numbers
-CASE Scenario25
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})});
-STATEMENT MATCH (d:Duration)
           RETURN d.date * 1 AS prod, d.date / 1 AS div;
## Outcome: the result should be, in any order:
---- 1
'P12Y5M14DT16H13M10.000000001S'|'P12Y5M14DT16H13M10.000000001S'

#  Should multiply or divide durations by numbers
-CASE Scenario26
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})});
-STATEMENT MATCH (d:Duration)
           RETURN d.date * 2 AS prod, d.date / 2 AS div;
## Outcome: the result should be, in any order:
---- 1
'P24Y10M28DT32H26M20.000000002S'|'P6Y2M22DT13H21M8S'

#  Should multiply or divide durations by numbers
-CASE Scenario27
## VERIFY
-STATEMENT CREATE NODE TABLE A(ID SERIAL, name STRING, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE (:Duration {date: duration({years: 12, months: 5, days: 14, hours: 16, minutes: 12, seconds: 70, nanoseconds: 1})});
-STATEMENT MATCH (d:Duration)
           RETURN d.date * 0.5 AS prod, d.date / 0.5 AS div;
## Outcome: the result should be, in any order:
---- 1
'P6Y2M22DT13H21M8S'|'P24Y10M28DT32H26M20.000000002S'