-DATASET CSV empty

--

-DEFINE_STATEMENT_BLOCK POPULATE_DATASET_TINYSNB [
-STATEMENT create node table person (ID INt64, fName StRING, gender INT64, isStudent BoOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration interval, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID));
---- ok
-STATEMENT create node table organisation (ID INT64, name STRING, orgCode INT64, mark DOUBLE, score INT64, history STRING, licenseValidInterval INTERVAL, rating DOUBLE, state STRUCT(revenue INT16, location STRING[], stock STRUCT(price INT64[], volume INT64)), info UNION(price FLOAT, movein DATE, note STRING),PRIMARY KEY (ID));
---- ok
-STATEMENT create node table movies (name STRING, length INT32, note STRING, description STRUCT(rating DOUBLE, stars INT8, views INT64, release TIMESTAMP, release_ns TIMESTAMP_NS, release_ms TIMESTAMP_MS, release_sec TIMESTAMP_SEC, release_tz TIMESTAMP_TZ, film DATE, u8 UINT8, u16 UINT16, u32 UINT32, u64 UINT64, hugedata INT128), content BYTEA, audience MAP(STRING, INT64), grade union(credit boolean, grade1 double, grade2 int64), PRIMARY KEY (name));
---- ok
-STATEMENT create rel table knows (FROM person TO person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MAnY);
---- ok
-STATEMENT create rel table studyAt (FROM person TO organisation, year INT64, places STRING[], length INT16, level INT8, code UINT64, temperature UINT32, ulength UINT16, ulevel UINT8, hugedata INT128, MANY_ONe);
---- ok
-STATEMENT create rel table workAt (FROM person TO organisation, year INT64, grading DOUBLE[2], rating float, MANY_ONE);
---- ok
-STATEMENT create rel table meets (FROM person TO person, location FLOAT[2], times INT, data BYTEA, MANY_ONE);
---- ok
-STATEMENT create rel table marries (FROM person TO person, usedAddress STRING[], address INT16[2], note STRING, ONE_ONE);
---- ok
-STATEMENT LOAD WITH HEADERS (ID INt64, fName StRING, gender INT64, isStudent BoOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration interval, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID)
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv"
           CREATE (:person{ID:ID, fName:fName, gender:gender, isStudent:isStudent, isWorker:isWorker, age:age, eyeSight:eyeSight, birthdate:birthdate, registerTime:registerTime, lastJobDuration:lastJobDuration, workedHours:workedHours, usedNames:usedNames, courseScoresPerTerm:courseScoresPerTerm, grades:grades, height:height, u:u});
---- ok
-STATEMENT LOAD WITH HEADERS (ID INt64, fName StRING, gender INT64, isStudent BoOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration interval, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID)
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson2.csv"
           CREATE (:person{ID:ID, fName:fName, gender:gender, isStudent:isStudent, isWorker:isWorker, age:age, eyeSight:eyeSight, birthdate:birthdate, registerTime:registerTime, lastJobDuration:lastJobDuration, workedHours:workedHours, usedNames:usedNames, courseScoresPerTerm:courseScoresPerTerm, grades:grades, height:height, u:u});
---- ok
-STATEMENT LOAD WITH HEADERS (ID INT64, name STRING, orgCode INT64, mark DOUBLE, score INT64, history STRING, licenseValidInterval INTERVAL, rating DOUBLE, state STRUCT(revenue INT16, location STRING[], stock STRUCT(price INT64[], volume INT64)), info UNION(price FLOAT, movein DATE, note STRING))
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vOrganisation.csv"
           CREATE (:organisation{ID:ID, name:name, orgCode:orgCode, mark:mark, score:score, history:history, licenseValidInterval:licenseValidInterval, rating:rating, state:state, info:info});
---- ok
-STATEMENT LOAD WITH HEADERS (name STRING, length INT32, note STRING, description STRUCT(rating DOUBLE, stars INT8, views INT64, release TIMESTAMP, release_ns TIMESTAMP_NS, release_ms TIMESTAMP_MS, release_sec TIMESTAMP_SEC, release_tz TIMESTAMP_TZ, film DATE, u8 UINT8, u16 UINT16, u32 UINT32, u64 UINT64, hugedata INT128), content BYTEA, audience MAP(STRING, INT64), grade union(credit boolean, grade1 double, grade2 int64))
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vMovies.csv"
           CREATE (:movies{name:name, length:length, note:note, description:description, content:content, audience:audience, grade:grade});
---- ok
-STATEMENT LOAD WITH HEADERS (p1ID INT64, p2ID INT64, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING))
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv" 
           MATCH (p1:person), (p2:person) WHERE p1.ID = p1ID AND p2.ID = p2ID
           CREATE (p1)-[:knows{date:date, meetTime:meetTime, validInterval:validInterval, comments:comments, summary:summary, notes:notes, someMap:someMap}]->(p2);
---- ok
-STATEMENT LOAD WITH HEADERS (p1ID INT64, p2ID INT64, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING))
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows_2.csv"
           MATCH (p1:person), (p2:person) WHERE p1.ID = p1ID AND p2.ID = p2ID
           CREATE (p1)-[:knows{date:date, meetTime:meetTime, validInterval:validInterval, comments:comments, summary:summary, notes:notes, someMap:someMap}]->(p2);
---- ok
-STATEMENT LOAD WITH HEADERS (p1ID INT64, o2ID INT64, year INT64, places STRING[], length INT16, level INT8, code UINT64, temperature UINT32, ulength UINT16, ulevel UINT8, hugedata INT128)
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eStudyAt.csv"
           MATCH (p1:person), (o2:organisation) WHERE p1.ID = p1ID AND o2.ID = o2ID
           CREATE (p1)-[:studyAt{year:year, places:places, length:length, level:level, code:code, temperature:temperature, ulength:ulength, ulevel:ulevel, hugedata:hugedata}]->(o2);
---- ok
-STATEMENT LOAD WITH HEADERS (p1ID INT64, o2ID INT64, year INT64, grading DOUBLE[2], rating float)
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eWorkAt.csv" 
           MATCH (p1:person), (o2:organisation) WHERE p1.ID = p1ID AND o2.ID = o2ID
           CREATE (p1)-[:workAt{year:year, grading:grading, rating:rating}]->(o2);
---- ok
-STATEMENT LOAD WITH HEADERS (p1ID INT64, p2ID INT64, location FLOAT[2], times INT, data BYTEA)
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eMeets.csv"
           MATCH (p1:person), (p2:person) WHERE p1.ID = p1ID AND p2.ID = p2ID
           CREATE (p1)-[:meets{location:location, times:times, data:data}]->(p2);
---- ok
-STATEMENT LOAD WITH HEADERS (p1ID INT64, p2ID INT64, usedAddress STRING[], address INT16[2], note STRING)
           FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eMarries.csv" 
           MATCH (p1:person), (p2:person) WHERE p1.ID = p1ID AND p2.ID = p2ID
           CREATE (p1)-[:marries{usedAddress:usedAddress, address:address, note:note}]->(p2);
---- ok
]

-CASE LocalTableScan
-STATEMENT BEGIN TRANSACTION;
---- ok
-INSERT_STATEMENT_BLOCK POPULATE_DATASET_TINYSNB
-STATEMENT MATCH (p:person) RETURN p.*;
---- 8
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11
2|Bob|2|True|False|30|5.100000|1900-01-01|2008-11-03 15:25:30.000526|10 years 5 months 13:00:00.000024|[12,8]|[Bobby]|[[8,9],[9,10]]|[98,42,93,88]|0.990000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a12
3|Carol|1|False|True|45|5.000000|1940-06-22|1911-08-20 02:32:21|48:24:11|[4,5]|[Carmen,Fred]|[[8,10]]|[91,75,21,95]|1.000000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a13
5|Dan|2|False|True|20|4.800000|1950-07-23|2031-11-30 12:25:30|10 years 5 months 13:00:00.000024|[1,9]|[Wolfeschlegelstein,Daniel]|[[7,4],[8,8],[9]]|[76,88,99,89]|1.300000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a14
7|Elizabeth|1|False|True|20|4.700000|1980-10-26|1976-12-23 11:21:42|48:24:11|[2]|[Ein]|[[6],[7],[8]]|[96,59,65,88]|1.463000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a15
8|Farooq|2|True|False|25|4.500000|1980-10-26|1972-07-31 13:22:30.678559|00:18:00.024|[3,4,5,6,7]|[Fesdwe]|[[8]]|[80,78,34,83]|1.510000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a16
9|Greg|2|False|False|40|4.900000|1980-10-26|1976-12-23 04:41:42|10 years 5 months 13:00:00.000024|[1]|[Grad]|[[10]]|[43,83,67,43]|1.600000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a17
10|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2|False|True|83|4.900000|1990-11-27|2023-02-21 13:25:30|3 years 2 days 13:02:00|[10,11,12,3,4,5,6,7]|[Ad,De,Hi,Kye,Orlan]|[[7],[10],[6,7]]|[77,64,100,54]|1.323000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a18
-STATEMENT MATCH (p1:person)-[k:knows]->(p2:person) RETURN p1.ID,p2.ID,k.*;
---- 14
0|2|2021-06-30|1986-10-21 21:08:31.521|10 years 5 months 13:00:00.000024|[rnme,m8sihsdnf2990nfiwf]|{locations: ['toronto','waterloo'], transfer: {day: 2021-01-02, amount: [100,200]}}|1|{a=b}
0|3|2021-06-30|1946-08-25 19:07:22|20 years 30 days 48:00:00|[njnojppo9u0jkmf,fjiojioh9h9h89hph]|{locations: , transfer: }|2020-10-10|{c=d, e=f, 1=2}
0|5|2021-06-30|2012-12-11 20:07:22|10 days|[ioji232,jifhe8w99u43434]|{locations: ['shanghai'], transfer: {day: 1990-09-10, amount: [10]}}|nice weather|
2|0|2021-06-30|1946-08-25 19:07:22|10 years 5 months 13:00:00.000024|[2huh9y89fsfw23,23nsihufhw723]|{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}|4|
2|3|1950-05-14|1946-08-25 19:07:22|00:23:00|[fwehu9h9832wewew,23u9h989sdfsss]|{locations: ['paris'], transfer: {day: 2011-05-01, amount: [2000,5340]}}|cool stuff found|
2|5|1950-05-14|2012-12-11 20:07:22|20 years 30 days 48:00:00|[fwh9y81232uisuiehuf,ewnuihxy8dyf232]|{locations: ['vancouver'], transfer: {day: 2020-01-01, amount: [120,50]}}|matthew perry|
3|0|2021-06-30|2002-07-31 11:42:53.12342|40 days 30:00:00|[fnioh8323aeweae34d,osd89e2ejshuih12]|{locations: ['london','toronto'], transfer: {day: 2012-11-21, amount: [223,5230]}}|10|
3|2|1950-05-14|2007-02-12 12:11:42.123|00:28:00.03|[fwh983-sdjisdfji,ioh89y32r2huir]|{locations: ['paris','beijing'], transfer: {day: 2011-03-11, amount: [2323,50]}}|1|
3|5|2000-01-01|1998-10-02 13:09:22.423|00:00:00.3|[psh989823oaaioe,nuiuah1nosndfisf]|{locations: [], transfer: {day: 1980-11-21, amount: [20,5]}}|2|
5|0|2021-06-30|1936-11-02 11:02:01|00:00:00.00048|[fwewe]|{locations: ['shanghai','nanjing'], transfer: {day: 1998-11-12, amount: [22,53240]}}|15|
5|2|1950-05-14|1982-11-11 13:12:05.123|00:23:00|[fewh9182912e3,h9y8y89soidfsf,nuhudf78w78efw,hioshe0f9023sdsd]|{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}|happy new year|
5|3|2000-01-01|1999-04-21 15:12:11.42|48:00:00.052|[23h9sdslnfowhu2932,shuhf98922323sf]|{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}|4|
7|8|1905-12-12|2025-01-01 11:22:33.52|00:47:58|[ahu2333333333333,12weeeeeeeeeeeeeeeeee]|{locations: ['toronto','thisisalongcityname'], transfer: {day: 1930-11-22, amount: [18,323]}}|8|
7|9|1905-12-12|2020-03-01 12:11:41.6552|00:47:58|[peweeeeeeeeeeeeeeeee,kowje9w0eweeeeeeeee]|{locations: ['waterloo'], transfer: {day: 2000-01-01, amount: [1000,5000]}}|10|

-CASE LocalTableDetachDelele
-STATEMENT BEGIN TRANSACTION;
---- ok
-INSERT_STATEMENT_BLOCK POPULATE_DATASET_TINYSNB
-STATEMENT MATCH (p:person) WHERE p.ID = 0 DETACH DELETE p;
---- ok
-STATEMENT MATCH (p1:person)-[k:knows]->(p2:person) RETURN p1.ID,p2.ID,k.*;
---- 8
2|3|1950-05-14|1946-08-25 19:07:22|00:23:00|[fwehu9h9832wewew,23u9h989sdfsss]|{locations: ['paris'], transfer: {day: 2011-05-01, amount: [2000,5340]}}|cool stuff found|
2|5|1950-05-14|2012-12-11 20:07:22|20 years 30 days 48:00:00|[fwh9y81232uisuiehuf,ewnuihxy8dyf232]|{locations: ['vancouver'], transfer: {day: 2020-01-01, amount: [120,50]}}|matthew perry|
3|2|1950-05-14|2007-02-12 12:11:42.123|00:28:00.03|[fwh983-sdjisdfji,ioh89y32r2huir]|{locations: ['paris','beijing'], transfer: {day: 2011-03-11, amount: [2323,50]}}|1|
3|5|2000-01-01|1998-10-02 13:09:22.423|00:00:00.3|[psh989823oaaioe,nuiuah1nosndfisf]|{locations: [], transfer: {day: 1980-11-21, amount: [20,5]}}|2|
5|2|1950-05-14|1982-11-11 13:12:05.123|00:23:00|[fewh9182912e3,h9y8y89soidfsf,nuhudf78w78efw,hioshe0f9023sdsd]|{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}|happy new year|
5|3|2000-01-01|1999-04-21 15:12:11.42|48:00:00.052|[23h9sdslnfowhu2932,shuhf98922323sf]|{locations: ['paris'], transfer: {day: 2000-01-01, amount: [20,5000]}}|4|
7|8|1905-12-12|2025-01-01 11:22:33.52|00:47:58|[ahu2333333333333,12weeeeeeeeeeeeeeeeee]|{locations: ['toronto','thisisalongcityname'], transfer: {day: 1930-11-22, amount: [18,323]}}|8|
7|9|1905-12-12|2020-03-01 12:11:41.6552|00:47:58|[peweeeeeeeeeeeeeeeee,kowje9w0eweeeeeeeee]|{locations: ['waterloo'], transfer: {day: 2000-01-01, amount: [1000,5000]}}|10|
