-DATASET TTL EMPTY

--

-CASE RenameRDFTableCommit
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE UniKG RENAME TO UniRDF;
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (s)-[p:UniRDF_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 8
http://kuzu.io/rdf-ex#Adam|http://kuzu.io/rdf-ex#livesIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Adam|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Karissa|http://kuzu.io/rdf-ex#bornIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Karissa|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Waterloo|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#City
http://kuzu.io/rdf-ex#Zhang|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#faculty
http://kuzu.io/rdf-ex#faculty|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person
http://kuzu.io/rdf-ex#student|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person

-CASE RenameRDFTableCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE UniKG RENAME TO UniRDF;
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (s)-[p:UniRDF_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 8
http://kuzu.io/rdf-ex#Adam|http://kuzu.io/rdf-ex#livesIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Adam|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Karissa|http://kuzu.io/rdf-ex#bornIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Karissa|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Waterloo|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#City
http://kuzu.io/rdf-ex#Zhang|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#faculty
http://kuzu.io/rdf-ex#faculty|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person
http://kuzu.io/rdf-ex#student|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person

-CASE RenameRDFTableRollback
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE UniKG RENAME TO UniRDF;
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (s)-[p:UniKG_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 8
http://kuzu.io/rdf-ex#Adam|http://kuzu.io/rdf-ex#livesIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Adam|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Karissa|http://kuzu.io/rdf-ex#bornIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Karissa|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Waterloo|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#City
http://kuzu.io/rdf-ex#Zhang|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#faculty
http://kuzu.io/rdf-ex#faculty|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person
http://kuzu.io/rdf-ex#student|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person

-CASE RenameRDFTableRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT CREATE RDFGraph UniKG;
---- ok
-STATEMENT COPY UniKG FROM "${KUZU_ROOT_DIRECTORY}/dataset/rdf/doc/uni.ttl";
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE UniKG RENAME TO UniRDF;
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (s)-[p:UniKG_rt]->(o) RETURN s.iri, p.iri, o.iri;
---- 8
http://kuzu.io/rdf-ex#Adam|http://kuzu.io/rdf-ex#livesIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Adam|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Karissa|http://kuzu.io/rdf-ex#bornIn|http://kuzu.io/rdf-ex#Waterloo
http://kuzu.io/rdf-ex#Karissa|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#student
http://kuzu.io/rdf-ex#Waterloo|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#City
http://kuzu.io/rdf-ex#Zhang|http://www.w3.org/1999/02/22-rdf-syntax-ns#type|http://kuzu.io/rdf-ex#faculty
http://kuzu.io/rdf-ex#faculty|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person
http://kuzu.io/rdf-ex#student|http://www.w3.org/2000/01/rdf-schema#subClassOf|http://kuzu.io/rdf-ex#person
