-DATASET CSV EMPTY

--

-CASE DeleteALPException
-STATEMENT CREATE NODE TABLE person (id INT64, PRIMARY KEY (id));
---- ok
-STATEMENT CREATE REL TABLE knows (FROM person TO person, val DOUBLE);
---- ok
-STATEMENT CREATE (a:person {ID: 88})
---- ok
-STATEMENT CREATE (a:person {ID: 77})
---- ok
-STATEMENT CREATE (a:person {ID: 66})
---- ok
-STATEMENT CREATE (a:person {ID: 55})
---- ok
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 77 AND b.ID = 88 CREATE (a)-[e:knows {val:5.1}]->(b) RETURN COUNT(*);
---- 1
1
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 77 AND b.ID = 66 CREATE (a)-[e:knows {val:123456789.123}]->(b) RETURN COUNT(*);
---- 1
1
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 77 AND b.ID = 55 CREATE (a)-[e:knows {val:1.2}]->(b) RETURN COUNT(*);
---- 1
1
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 66 AND b.ID = 55 CREATE (a)-[e:knows {val:2.3}]->(b) RETURN COUNT(*);
---- 1
1
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) RETURN a.ID, b.ID, e.val;
---- 4
77|88|5.100000
77|66|123456789.123000
77|55|1.200000
66|55|2.300000
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE b.ID = 66 DETACH DELETE b;
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) RETURN a.ID, b.ID, e.val;
---- 2
77|88|5.100000
77|55|1.200000

-CASE DetachDeleteSingleDirectionRelStorage
-STATEMENT create node table person (ID INt64, fName StRING, gender INT64, isStudent BoOLEAN, isWorker BOOLEAN, age INT64, eyeSight DOUBLE, birthdate DATE, registerTime TIMESTAMP, lastJobDuration interval, workedHours INT64[], usedNames STRING[], courseScoresPerTerm INT64[][], grades INT64[4], height float, u UUID, PRIMARY KEY (ID))
---- ok
-STATEMENT create rel table knows (FROM person TO person, date DATE, meetTime TIMESTAMP, validInterval INTERVAL, comments STRING[], summary STRUCT(locations STRING[], transfer STRUCT(day DATE, amount INT64[])), notes UNION(firstmet DATE, type INT16, comment STRING), someMap MAP(STRING, STRING), MANY_MAnY) WITH (storage_direction = 'fwd')
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson.csv";
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/vPerson2.csv";
---- ok
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/tinysnb/eKnows.csv";
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 0 DETACH DELETE a;
---- error
Runtime exception: Cannot detach delete from node table 'person' as it has connected edges in rel table 'knows' (detach delete only supports deleting from rel tables with storage direction 'both').
