-DATASET CSV ldbc-sf01
--

# FIX-ME(Guodong): https://github.com/kuzudb/kuzu/issues/4271
-CASE DeleteLikeComment1
-SKIP
-STATEMENT MATCH (n:Person)-[e:likes_Comment]->(m:Comment) WHERE n.id=6597069767457 RETURN COUNT(*);
---- 1
66
-STATEMENT MATCH (n:Person)-[e:likes_Comment]->(m:Comment) WHERE n.id=6597069767457 AND m.id=412317167195 DELETE e;
---- ok
-STATEMENT MATCH (n:Person)-[e:likes_Comment]->(m:Comment) WHERE n.id=6597069767457 RETURN COUNT(*);
---- 1
65
-STATEMENT MATCH (n:Person)-[e:likes_Comment]->(m:Comment) WHERE n.id=6597069767457 DELETE e;
---- ok
-STATEMENT MATCH (n:Person)-[e:likes_Comment]->(m:Comment) WHERE n.id=6597069767457 HINT n JOIN (e JOIN m) RETURN COUNT(*);
---- 1
0
-STATEMENT MATCH (n:Person)-[e:likes_Comment]->(m:Comment) WHERE n.id=6597069767457 HINT (n JOIN e) JOIN m RETURN COUNT(*);
---- 1
0
