-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE Acc

-LOG AspBasic
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE a.age > 35 RETURN b.fName
-ENCODED_JOIN HJ(b._ID){E(b)S(a._ID)}{S(b._ID)}
---- 3
Alice
Bob
Dan

-LOG AspMultiLabel
-STATEMENT MATCH (a:person)-[e1:knows|:studyAt|:workAt]->(b:person:organisation) WHERE a.age > 35 RETURN b.fName, b.name
-ENCODED_JOIN HJ(b._ID){E(b)S(a._ID)}{S(b._ID)}
---- 4
Alice|
Bob|
Dan|
|CsWork

-LOG AspMultiKey
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person), (a)-[e3:knows]->(c) WHERE a.fName='Alice' RETURN b.fName, c.fName
#-ENCODED_JOIN HJ(c._ID,b._ID){E(b)E(c)S(a._ID)}{HJ(b._id){S(b._ID)}{E(b)S(c._ID)}}
-ENUMERATE
---- 6
Bob|Carol
Bob|Dan
Carol|Bob
Carol|Dan
Dan|Bob
Dan|Carol

-LOG AspMultiMaskToOneScan
-STATEMENT MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person) WHERE a.fName='Alice' AND c.fName='Bob' RETURN b.fName
#-ENCODED_JOIN HJ(b._ID){E(b)S(a._ID)}{HJ(b._ID){E(b)S(c._ID)}{S(b._ID)}}
-ENUMERATE
---- 2
Carol
Dan

-LOG AspOneMaskToMultiScan
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person), (a)-[e2:knows]->(b), (a)-[e3:knows]->(c:person)-[e4:knows]->(d:person) WHERE e1.date=date('1950-05-14') AND a.ID>0 AND c.fName='Bob' AND d.fName='Carol' RETURN a.fName, b.fName
-ENUMERATE
---- 2
Carol|Bob
Dan|Bob

-LOG AspIntersect
-STATEMENT MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person), (a)-[e3:knows]->(c) WHERE b.fName='Bob' AND a.fName='Alice' RETURN COUNT(*)
-ENUMERATE
---- 1
2
