-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE Acc

-NAME AspBasic
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.age > 35 RETURN b.fName
-ENCODED_JOIN HJ(b._id){E(b)S(a)}{S(b)}
---- 3
Alice
Bob
Dan

-NAME AspMultiLabel
-QUERY MATCH (a:person)-[e1:knows|:studyAt|:workAt]->(b:person:organisation) WHERE a.age > 35 RETURN b.fName, b.name
-ENCODED_JOIN HJ(b._id){E(b)S(a)}{S(b)}
---- 4
Alice|
Bob|
Dan|
|CsWork

-NAME AspMultiKey
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person), (a)-[e3:knows]->(c) WHERE a.fName='Alice' RETURN b.fName, c.fName
#-ENCODED_JOIN HJ(c._id,b._id){E(b)E(c)S(a)}{HJ(b._id){S(b)}{E(b)S(c)}}
-ENUMERATE
---- 6
Bob|Carol
Bob|Dan
Carol|Bob
Carol|Dan
Dan|Bob
Dan|Carol

-NAME AspMultiMaskToOneScan
-QUERY MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person) WHERE a.fName='Alice' AND c.fName='Bob' RETURN b.fName
#-ENCODED_JOIN HJ(b._id){E(b)S(a)}{HJ(b._id){E(b)S(c)}{S(b)}}
-ENUMERATE
---- 2
Carol
Dan

-NAME AspOneMaskToMultiScan
-QUERY MATCH (a:person)-[e1:knows]->(b:person), (a)-[e2:knows]->(b), (a)-[e3:knows]->(c:person)-[e4:knows]->(d:person) WHERE e1.date=date('1950-05-14') AND a.ID>0 AND c.fName='Bob' AND d.fName='Carol' RETURN a.fName, b.fName
-ENUMERATE
---- 2
Carol|Bob
Dan|Bob

-NAME AspIntersect
-QUERY MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person), (a)-[e3:knows]->(c) WHERE b.fName='Bob' AND a.fName='Alice' RETURN COUNT(*)
-ENUMERATE
---- 1
2
