-NAME WSHORTEST
-QUERY MATCH (a{id:6})-[e* ALL WSHORTEST(weight)]->(b) RETURN cost(e) as cost order by cost desc limit 10;
---- 10
12.300781
12.300781
12.250000
12.250000
11.382812
11.382812
11.382812
11.382812
11.343750
11.343750
