-NAME q03
-QUERY MATCH (comment:Comment) RETURN MIN(concat(comment.browserUsed, 'hh'))
---- 1
Chromehh