-NAME q03
-COMPARE_RESULT 1
-QUERY MATCH (comment:Comment) RETURN MIN(concat(comment.browserUsed, 'hh'))
---- 1
Chromehh