-NAME q06
-QUERY MATCH (comment:Comment) RETURN MIN(comment.browserUsed contains 'ed')
---- 1
False