-NAME SingleNodeAggTest
-QUERY MATCH (a:person) RETURN a.age, MIN(a.ID), AVG(a.eyeSight), COUNT(*)
---- 7
20|5|4.750000|2
25|8|4.500000|1
30|2|5.100000|1
35|0|5.000000|1
40|9|4.900000|1
45|3|5.000000|1
83|10|4.900000|1

-NAME InMemOverflowBufferTest
-QUERY MATCH (a:person) RETURN a.fName as name, COUNT(*) order by name desc
-PARALLELISM 1
---- 8
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|1
Greg|1
Farooq|1
Elizabeth|1
Dan|1
Carol|1
Bob|1
Alice|1

-NAME SingleNodeDistinctTest
-QUERY MATCH (a:person) RETURN DISTINCT a.gender
---- 2
1
2

-NAME OneHopAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN a.age, a.gender, COUNT(*)
-ENUMERATE
--PARALLELISM 2
---- 5
20|1|2
20|2|3
30|2|3
35|1|3
45|1|3

-NAME OneHopHashAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN a.gender, COUNT(*), SUM(b.age)
--PARALLELISM 3
-ENUMERATE
---- 2
1|8|245
2|6|210

-NAME TwoHopAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN a.gender, COUNT(*), COUNT(DISTINCT b.age)
--PARALLELISM 5
-ENUMERATE
---- 2
1|18|4
2|18|4

-NAME OneHopAggFlatUnflatVecTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN a.ID, b.gender, sum(b.age)
-PARALLELISM 6
-ENUMERATE
---- 9
0|1|45
0|2|50
2|1|80
2|2|20
3|1|35
3|2|50
5|1|80
5|2|30
7|2|65

-NAME OneHopAggFlatUnflatVecWithNonHashKeyTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN a.ID, a.gender, b.gender, sum(b.age)
-ENUMERATE
---- 9
0|1|1|45
0|1|2|50
2|2|1|80
2|2|2|20
3|1|1|35
3|1|2|50
5|2|1|80
5|2|2|30
7|1|2|65

-NAME OneHopDistinctTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN DISTINCT a.gender, b.isStudent
-ENUMERATE
---- 4
1|False
1|True
2|False
2|True

-NAME TwoHopDistinctTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN DISTINCT a.ID + 1
-ENUMERATE
---- 4
1
3
4
6
