-NAME MultiLabelAggTest
-QUERY MATCH (a:person)-[e:marries|:mixed]->(b:person)-[:knows|:mixed]->(c:person) WHERE b.ID >= 7 RETURN b.ID, COUNT(*), SUM(a.ID + c.ID)
---- 2
7|3|29
8|1|10

-NAME MultiLabelAggTest2
-QUERY MATCH (a:person)<-[e1:marries|:mixed|studyAt]-(b:person)-[e2:knows]->(c:person) WHERE b.ID = 7 RETURN ID(e1), COUNT(*), MIN(e2.date)
---- 2
7:3|2|1905-12-12
8:2|2|1905-12-12

-NAME MultiLabelAggTest3
-QUERY MATCH (a:person)-[e1:marries|:mixed|studyAt]->(b:person) RETURN e1.year, COUNT(*)
---- 8
|3
1930|1
1945|1
2088|1
2066|1
2120|1
2022|1
2020|1

-NAME MultiLabelAggTest4
-QUERY MATCH (a:person)-[e1:mixed]->(b:person:organisation) RETURN b.age, COUNT(*)
-ENUMERATE
---- 4
20|2
30|2
45|3
|3

