-NAME OneHopSimpleAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN COUNT(a.ID), MIN(a.fName), MAX(c.ID)
-PARALLELISM 8
-ENUMERATE
---- 1
36|Alice|5

-NAME SimpleAvgTest
-QUERY MATCH (a:person) RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
37.250000|4.862500

-NAME SimpleCountTest
-QUERY MATCH (a:person) RETURN COUNT(a.age) + 1
---- 1
9

-NAME SimpleCountTest2
-QUERY MATCH (a:person)-[e1:knows]->(:person) RETURN COUNT(e1)
---- 1
14

-NAME SimpleSumTest
-QUERY MATCH (a:person) RETURN SUM(a.age), SUM(a.eyeSight)
---- 1
298|38.900000

-NAME SimpleSumTest2
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN SUM(a.age+10), SUM(a.age*2)
---- 1
115|170

-NAME SimpleSumTest3
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN SUM(a.age+10) > SUM(a.age*2)
---- 1
False

-NAME SimpleAvgTest
-QUERY MATCH (a:person) RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
37.250000|4.862500

-NAME SimpleAvgTest2
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
28.333333|4.700000

-NAME SimpleMinMaxTest
-QUERY MATCH (a:person) RETURN MIN(a.age), MAX(a.age), MIN(a.isStudent), MAX(a.isStudent), MIN(a.eyeSight), MAX(a.eyeSight), MIN(a.birthdate), MAX(a.birthdate)
---- 1
20|83|False|True|4.500000|5.100000|1900-01-01|1990-11-27

-NAME TwoHopTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN SUM(b.age), MIN(b.ID), AVG(b.eyeSight)
-ENUMERATE
---- 1
455|0|4.935714
