-NAME OneHopSimpleAggTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN COUNT(a.ID), MIN(a.fName), MAX(c.ID)
-PARALLELISM 8
-ENUMERATE
---- 1
36|Alice|5

-NAME SimpleAvgTest
-QUERY MATCH (a:person) RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
37.250000|4.862500

-NAME SimpleCountTest
-QUERY MATCH (a:person) RETURN COUNT(a.age) + 1
---- 1
9

-NAME SimpleCountTest2
-QUERY MATCH (a:person)-[e1:knows]->(:person) RETURN COUNT(e1)
---- 1
14

-NAME SimpleSumTest
-QUERY MATCH (a:person) RETURN SUM(a.age), SUM(a.eyeSight)
---- 1
298|38.900000

-NAME SimpleSumTest2
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN SUM(a.age+10), SUM(a.age*2)
---- 1
115|170

-NAME SimpleSumTest3
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN SUM(a.age+10) > SUM(a.age*2)
---- 1
False

-NAME SimpleAvgTest
-QUERY MATCH (a:person) RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
37.250000|4.862500

-NAME SimpleAvgTest2
-QUERY MATCH (a:person) WHERE a.birthdate = date('1980-10-26') RETURN AVG(a.age), AVG(a.eyeSight)
---- 1
28.333333|4.700000

-NAME SimpleMinMaxTest
-QUERY MATCH (a:person) RETURN MIN(a.age), MAX(a.age), MIN(a.isStudent), MAX(a.isStudent), MIN(a.eyeSight), MAX(a.eyeSight), MIN(a.birthdate), MAX(a.birthdate)
---- 1
20|83|False|True|4.500000|5.100000|1900-01-01|1990-11-27

-NAME TwoHopTest
-QUERY MATCH (a:person)-[:knows]->(b:person) RETURN SUM(b.age), MIN(b.ID), AVG(b.eyeSight)
-ENUMERATE
---- 1
455|0|4.935714

-NAME SimpleCollectINT64Test
-QUERY MATCH (p:person) RETURN collect(p.age)
---- 1
[35,30,45,20,20,25,40,83]

-NAME SimpleCollectSTRINGTest
-QUERY MATCH (p:person) RETURN collect(p.fName)
---- 1
[Alice,Bob,Carol,Dan,Elizabeth,Farooq,Greg,Hubert Blaine Wolfeschlegelsteinhausenbergerdorff]

-NAME SimpleCollectLISTOfINT64Test
-QUERY MATCH (p:person) RETURN collect(p.workedHours)
---- 1
[[10,5],[12,8],[4,5],[1,9],[2],[3,4,5,6,7],[1],[10,11,12,3,4,5,6,7]]

-NAME SimpleCollectLISTOfSTRINGTest
-QUERY MATCH (p:person) RETURN collect(p.usedNames)
---- 1
[[Aida],[Bobby],[Carmen,Fred],[Wolfeschlegelstein,Daniel],[Ein],[Fesdwe],[Grad],[Ad,De,Hi,Kye,Orlan]]

-NAME SimpleCollectLISTOfLISTOfINT64Test
-QUERY MATCH (p:person) RETURN collect(p.courseScoresPerTerm)
---- 1
[[[10,8],[6,7,8]],[[8,9],[9,10]],[[8,10]],[[7,4],[8,8],[9]],[[6],[7],[8]],[[8]],[[10]],[[7],[10],[6,7]]]

-NAME SimpleCollectLISTOfINT64MultiThreadTest
-QUERY MATCH (p:person) RETURN collect(p.workedHours)
-PARALLELISM 8
---- 1
[[10,5],[12,8],[4,5],[1,9],[2],[3,4,5,6,7],[1],[10,11,12,3,4,5,6,7]]
