# description: subquery test

-NAME Test1
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person) RETURN COUNT(*) } RETURN COUNT(*)
---- 5

-NAME Test2
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:studyAt]->(b:organisation) RETURN COUNT(*) } RETURN COUNT(*)
---- 3

-NAME Test3
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person) WHERE EXISTS { MATCH (b)-[:workAt]->(c:organisation) RETURN COUNT(*) } RETURN COUNT(*) } RETURN COUNT(*)
---- 4