# description: subquery test

-NAME ExistSubqueryTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person) RETURN a.id } RETURN COUNT(*)
---- 1
5

-NAME ExistSubqueryTest2
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person) WHERE b.fName='Farooq' RETURN a.id } RETURN COUNT(*)
---- 1
1

-NAME ExistSubqueryTest3
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE EXISTS { MATCH (a)-[:studyAt]->(c:organisation) RETURN a.id } OR b.fName='Greg'  RETURN COUNT(*)
---- 1
7

-NAME ExistSubqueryTest4
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person) WHERE a.fName='Alice' RETURN a.id } RETURN COUNT(*)
---- 1
1

-NAME NotExistSubqueryTest
-QUERY MATCH (a:person) WHERE NOT EXISTS { MATCH (a)-[:knows]->(b:person) RETURN a.id } RETURN COUNT(*)
---- 1
3

-NAME ExistSubqueryMultiPartCyclicTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person) WITH a, b AS c MATCH (c)-[:knows]->(a) RETURN a.id } RETURN COUNT(*)
---- 1
4

-NAME ExistsSubqueryColExtendTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:studyAt]->(b:organisation) RETURN a.id } RETURN COUNT(*)
---- 1
3

-NAME ExistsSubqueryORTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:studyAt]->(b:organisation) RETURN a.id } OR EXISTS { MATCH (a)-[:workAt]->(c:organisation) RETURN a.id } RETURN COUNT(*)
---- 1
6

-NAME NestedSubqueryTest
-QUERY MATCH (a:person) WHERE EXISTS { MATCH (a)-[:knows]->(b:person) WHERE EXISTS { MATCH (b)-[:workAt]->(c:organisation) RETURN b.id } RETURN a.id } RETURN COUNT(*)
---- 1
4

-NAME ExistSubqueryAliasTest1
-QUERY MATCH (a:person) WITH a, a.fName AS newName WHERE EXISTS { MATCH (a)-[:knows]->(b:person) WHERE newName='Alice' RETURN a.id } RETURN COUNT(*)
---- 1
1

-NAME ExistSubqueryAliasTest2
-QUERY MATCH (a:person) WITH a AS k MATCH (k)-[:knows]->(b:person) WHERE EXISTS { MATCH (k)-[:studyAt]->(c:organisation) RETURN c.id } OR b.fName='Greg'  RETURN COUNT(*)
---- 1
7
