-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE Union

-NAME UnionAllTwoQueriesTest
-QUERY MATCH (p:person) RETURN p.age UNION ALL MATCH (p1:person) RETURN p1.age
-PARALLELISM 8
---- 16
20
20
20
20
25
25
30
30
35
35
40
40
45
45
83
83

-NAME UnionAllMultipleQueriesTest
-QUERY MATCH (p:person) RETURN p.age UNION ALL MATCH (p1:person) RETURN p1.age UNION ALL MATCH (p2:person) RETURN p2.age
-PARALLELISM 2
---- 24
20
20
20
20
20
20
25
25
25
30
30
30
35
35
35
40
40
40
45
45
45
83
83
83

-NAME UnionAllMultipleColumnsTest
-QUERY MATCH (p:person) RETURN p.age, p.eyeSight UNION ALL MATCH (p1:person) RETURN p1.age, p1.eyeSight
-PARALLELISM 3
---- 16
20|4.700000
20|4.700000
20|4.800000
20|4.800000
25|4.500000
25|4.500000
30|5.100000
30|5.100000
35|5.000000
35|5.000000
40|4.900000
40|4.900000
45|5.000000
45|5.000000
83|4.900000
83|4.900000

-NAME UnionTwoQueriesTest
-QUERY MATCH (a:person) RETURN a.age UNION MATCH (p:person) RETURN p.age
---- 7
20
25
30
35
40
45
83

# If an expression to union has different flat/unflat state in different single queries, we need to flatten that
# expression in all the single queries.
-NAME UnionAllFlatAndUnFlatColTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN a.age UNION ALL MATCH (a:person)-[e:knows]->(b:person) RETURN a.age UNION ALL MATCH (a:person)-[e:knows]->(b:person) RETURN a.age
-ENUMERATE
---- 42
20
20
20
20
20
20
20
20
20
20
20
20
20
20
20
30
30
30
30
30
30
30
30
30
35
35
35
35
35
35
35
35
35
45
45
45
45
45
45
45
45
45

-NAME UnionAllWithTest
-QUERY MATCH (a:person)-[:knows]->(b:person) with b return b.age + 3 UNION ALL MATCH (a:person)-[e:knows]->(b:person) with a RETURN a.age
-ENUMERATE
---- 28
20
20
20
20
20
23
23
23
28
30
30
30
33
33
33
35
35
35
38
38
38
43
45
45
45
48
48
48

-NAME UnionAllThreeHopsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person) RETURN a.fName order by d.age desc, c.age asc, b.age asc, a.age desc limit 10 UNION ALL MATCH (p:person) RETURN p.fName
-ENUMERATE
---- 18
Alice
Alice
Alice
Bob
Bob
Bob
Carol
Carol
Carol
Carol
Dan
Dan
Dan
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
