-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE OptionalMatchMultiLabel

-NAME MultiLabelTest1
-QUERY MATCH (a:organisation) OPTIONAL MATCH (a)<-[:knows|:studyAt]-(b:person) RETURN COUNT(*)
---- 1
5

-NAME MultiLabelTest2
-QUERY MATCH (a:organisation:person) OPTIONAL MATCH (a)-[:studyAt|:workAt]->(b:person:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
11
