-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE OptionalMatchMultiLabel

-DEBUG_LOG MultiLabelTest1
-STATEMENT MATCH (a:organisation) OPTIONAL MATCH (a)<-[:knows|:studyAt]-(b:person) RETURN COUNT(*)
---- 1
5

-DEBUG_LOG MultiLabelTest2
-STATEMENT MATCH (a:organisation:person) OPTIONAL MATCH (a)-[:studyAt|:workAt]->(b:person:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
11
