-GROUP UpdateRelTest_updateRelsTwoHop
-DATASET CSV rel-update-tests
--

-CASE updateRelsTwoHopCommitNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT COMMIT
---- ok 
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
300|

-CASE updateRelsTwoHopCommitRecovery
-STATEMENT BEGIN TRANSACTION
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
300|

-CASE updateRelsTwoHopRollbackNormalExecution
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT Rollback
---- ok 
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
0|1145

-CASE updateRelsTwoHopRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 SET e1.length = 300, e2.length = null
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok 
-RELOADDB
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (p0:person)-[e1:knows]->(p1:person)-[e2:knows]->(p2:person) WHERE p0.ID = 1 AND p2.ID = 1145 RETURN e1.length, e2.length
---- 1
0|1145
