-GROUP LongStringPKTest
-TEST LongStringPKTest
-DATASET long-string-pk-tests

--

-NAME LongStringPKTest
-QUERY MATCH (a:Person)-[e:Knows]->(b:Person) WHERE a.name = "AAAAAAAAAAAAAAAAAAAA" RETURN COUNT(*)
---- 1
1
