-DATASET CSV tinysnb
--

-CASE DropRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE AddNodeTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE (:person {ID: 11});
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11|1
-STATEMENT MATCH (p:person) RETURN sum(p.test);
---- 1
9

-CASE AddNodeTablePropertyCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE (:person {ID: 11});
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11|1
-STATEMENT MATCH (p:person) RETURN sum(p.test);
---- 1
9

-CASE AddNodeTablePropertyRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11

-CASE AddNodeTablePropertyRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11

-CASE AddRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (p:person), (o:organisation) WHERE p.ID = 5 AND o.ID = 6 CREATE (p)-[:studyAt {year: 2000, places: [], length: 4, level: 4, code: 9223372036854775807, temperature: 32799, ulength: 33767, ulevel: 249, hugedata: 1844674407370955161811111110}]->(o);
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111, test: 1}->(1:0)
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN sum(s.test);
---- 1
4

-CASE AddRelTablePropertyCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (p:person), (o:organisation) WHERE p.ID = 5 AND o.ID = 6 CREATE (p)-[:studyAt {year: 2000, places: [], length: 4, level: 4, code: 9223372036854775807, temperature: 32799, ulength: 33767, ulevel: 249, hugedata: 1844674407370955161811111110}]->(o);
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111, test: 1}->(1:0)
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN sum(s.test);
---- 1
4

-CASE AddRelTablePropertyRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE AddRelTablePropertyRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, location: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, location: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE CommentRelTableCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1
Study at information

-CASE CommentRelTableCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1
Study at information

-CASE CommentRelTableRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1


-CASE CommentRelTableRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1


# TODO(issue #3502): Function write status check
-CASE SequenceReadTrxError
-SKIP
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION READ ONLY;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT CREATE SEQUENCE after;
---- error
Can not execute a write query inside a read-only transaction.
-STATEMENT RETURN currval('before');
---- 1
1
-STATEMENT RETURN nextval('before');
---- error
Can not execute a write query inside a read-only transaction.

-CASE SequenceTestCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE next;
---- ok
-STATEMENT RETURN nextval('next');
---- 1
1
-STATEMENT Commit;
---- ok
-STATEMENT RETURN currval('next');
---- 1
1

-CASE SequenceTestCommitRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE after;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT RETURN nextval('after');
---- 1
1
-STATEMENT Commit;
---- ok
-RELOADDB
-STATEMENT RETURN currval('before');
---- 1
1
-STATEMENT RETURN currval('after');
---- 1
1

-CASE SequenceTestRollback
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE after;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT RETURN nextval('after');
---- 1
1
-STATEMENT Rollback;
---- ok
-STATEMENT RETURN currval('before');
---- error
Catalog exception: currval: sequence "before" is not yet defined. To define the sequence, call nextval first.
-STATEMENT RETURN currval('after');
---- error
Catalog exception: after does not exist in catalog.

-CASE SequenceTestRollbackRecovery
-STATEMENT CALL auto_checkpoint=false;
---- ok
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE after;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT RETURN nextval('after');
---- 1
1
-STATEMENT Rollback;
---- ok
-RELOADDB
-STATEMENT RETURN currval('before');
---- error
Catalog exception: currval: sequence "before" is not yet defined. To define the sequence, call nextval first.
-STATEMENT RETURN currval('after');
---- error
Catalog exception: after does not exist in catalog.
