-DATASET CSV tinysnb
--

-CASE DropRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temprature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

# TODO(FIX-ME): Alter table has bugs under recovery.
-CASE DropRelTablePropertyRecovery
-SKIP
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temprature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)
