-DATASET CSV tinysnb
--

-CASE DropRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE AddRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 40
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111, test: 40}->(1:0)

-CASE AddRelTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 40
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111, test: 40}->(1:0)

-CASE AddRelTablePropertyRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 40
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE AddRelTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 40
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, location: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, location: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE CommentRelTableCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1
Study at information

-CASE CommentRelTableCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT COMMIT_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1
Study at information

-CASE CommentRelTableRollbackCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1


-CASE CommentRelTableRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT ROLLBACK_SKIP_CHECKPOINT
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1


# TODO(issue #3502): Function write status check
-CASE SequenceReadTrxError
-SKIP
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION READ ONLY;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT CREATE SEQUENCE after;
---- error
Can not execute a write query inside a read-only transaction.
-STATEMENT RETURN currval('before');
---- 1
1
-STATEMENT RETURN nextval('before');
---- error
Can not execute a write query inside a read-only transaction.

-CASE SequenceTestCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE next;
---- ok
-STATEMENT RETURN nextval('next');
---- 1
1
-STATEMENT Commit;
---- ok
-STATEMENT RETURN currval('next');
---- 1
1

-CASE SequenceTestCommitRecovery
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE after;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT RETURN nextval('after');
---- 1
1
-STATEMENT Commit_skip_checkpoint;
---- ok
-RELOADDB
-STATEMENT RETURN currval('before');
---- 1
1
-STATEMENT RETURN currval('after');
---- 1
1

-CASE SequenceTestRollback
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE after;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT RETURN nextval('after');
---- 1
1
-STATEMENT Rollback;
---- ok
-STATEMENT RETURN currval('before');
---- error
Catalog exception: currval: sequence "before" is not yet defined. To define the sequence, call nextval first.
-STATEMENT RETURN currval('after');
---- error
Catalog exception: after does not exist in catalog.

-CASE SequenceTestRollbackRecovery
-STATEMENT CREATE SEQUENCE before;
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE SEQUENCE after;
---- ok
-STATEMENT RETURN nextval('before');
---- 1
1
-STATEMENT RETURN nextval('after');
---- 1
1
-STATEMENT Rollback_skip_checkpoint;
---- ok
-RELOADDB
-STATEMENT RETURN currval('before');
---- error
Catalog exception: currval: sequence "before" is not yet defined. To define the sequence, call nextval first.
-STATEMENT RETURN currval('after');
---- error
Catalog exception: after does not exist in catalog.
