-DATASET CSV tinysnb
--

-CASE DropNodeTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person DROP fName
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE DropNodeTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person DROP fName
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE DropNodeTablePropertyRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person DROP fName
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE DropNodeTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person DROP fName
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE DropRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE DropRelTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt DROP places
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE AddNodeTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE (:person {ID: 11});
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11|1
-STATEMENT MATCH (p:person) RETURN sum(p.test);
---- 1
9

-CASE AddNodeTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE (:person {ID: 11});
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11|1
-STATEMENT MATCH (p:person) RETURN sum(p.test);
---- 1
9

-CASE AddNodeTablePropertyRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11

-CASE AddNodeTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN p.* ORDER BY p.ID LIMIT 1
---- 1
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|[96,54,86,92]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11

-CASE AddRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (p:person), (o:organisation) WHERE p.ID = 5 AND o.ID = 6 CREATE (p)-[:studyAt {year: 2000, places: [], length: 4, level: 4, code: 9223372036854775807, temperature: 32799, ulength: 33767, ulevel: 249, hugedata: 1844674407370955161811111110}]->(o);
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111, test: 1}->(1:0)
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN sum(s.test);
---- 1
4

-CASE AddRelTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT MATCH (p:person), (o:organisation) WHERE p.ID = 5 AND o.ID = 6 CREATE (p)-[:studyAt {year: 2000, places: [], length: 4, level: 4, code: 9223372036854775807, temperature: 32799, ulength: 33767, ulevel: 249, hugedata: 1844674407370955161811111110}]->(o);
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111, test: 1}->(1:0)
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN sum(s.test);
---- 1
4

-CASE AddRelTablePropertyRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE AddRelTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt Add test INT64 DEFAULT 1
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameNodeTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME fName TO pName;
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, pName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameNodeTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME fName TO pName;
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, pName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameNodeTablePropertyRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME fName TO pName;
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameNodeTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME fName TO pName;
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameRelTablePropertyCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, location: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, location: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTablePropertyRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME places TO location;
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameNodeTableCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME TO vPerson;
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:vPerson) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: vPerson, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameNodeTableCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME TO vPerson;
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (p:vPerson) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: vPerson, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameNodeTableRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME TO vPerson;
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameNodeTableRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE person RENAME TO vPerson;
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) RETURN * ORDER BY p.ID LIMIT 1;
---- 1
{_ID: 0:0, _LABEL: person, ID: 0, fName: Alice, gender: 1, isStudent: True, isWorker: False, age: 35, eyeSight: 5.000000, birthdate: 1900-01-01, registerTime: 2011-08-20 11:25:30, lastJobDuration: 3 years 2 days 13:02:00, workedHours: [10,5], usedNames: [Aida], courseScoresPerTerm: [[10,8],[6,7,8]], grades: [96,54,86,92], height: 1.731000, u: a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11}

-CASE RenameRelTableCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME TO eStudyAt;
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (:person)-[s:eStudyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: eStudyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTableCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME TO eStudyAt;
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:eStudyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: eStudyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTableRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME TO eStudyAt;
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE RenameRelTableRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE studyAt RENAME TO eStudyAt;
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN * ORDER BY s.year DESC LIMIT 1
---- 1
(0:0)-{_LABEL: studyAt, _ID: 4:0, year: 2021, places: [wwAewsdndweusd,wek], length: 5, level: 5, code: 9223372036854775808, temperature: 32800, ulength: 33768, ulevel: 250, hugedata: 1844674407370955161811111111}->(1:0)

-CASE CommentRelTableCommit
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1
Study at information

-CASE CommentRelTableCommitRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1
Study at information

-CASE CommentRelTableRollback
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1

-CASE CommentRelTableRollbackRecovery
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT COMMENT ON TABLE studyAt IS 'Study at information';
---- ok
-STATEMENT ROLLBACK
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() WHERE name = 'studyAt' RETURN comment;
---- 1

# The following are tests for add column different data types
-CASE AddInt64PropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64
---- ok
-STATEMENT COMMIT
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return Count(p.random)
---- 1
0

-CASE AddInt64PropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return Count(p.random)
---- 1
0

-CASE AddInt64PropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddInt64PropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddArrayPropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random DOUBLE[5]
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return Count(p.random)
---- 1
0

-CASE AddArrayPropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random DOUBLE[5]
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return Count(p.random)
---- 1
0

-CASE AddArrayPropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random DOUBLE[5]
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddArrayPropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random DOUBLE[5]
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddStringPropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddStringPropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddStringPropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING
---- ok
-STATEMENT Rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddStringPropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListPropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[]
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddListPropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[]
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddListPropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[]
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListPropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[]
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStringPropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[]
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddListOfStringPropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[]
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddListOfStringPropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[]
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStringPropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[]
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStructPropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[]
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddListOfStructPropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[]
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddListOfStructPropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[]
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStructPropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[]
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddMapPropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64)
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddMapPropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64)
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddMapPropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64)
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddMapPropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64)
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddStructPropertyWithoutDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64)
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddStructPropertyWithoutDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64)
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- ok

-CASE AddStructPropertyWithoutDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64)
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddStructPropertyWithoutDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64)
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddInt64PropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64 default 21
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
21

-CASE AddInt64PropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64 default 21
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
21

-CASE AddInt64PropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64 default 21
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddInt64PropertyWithDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64 default 21
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddStringPropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random String default 'long long string'
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
long long string

-CASE AddStringPropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random String default 'long long string'
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
long long string

-CASE AddStringPropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random String default 'long long string'
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddStringPropertyWithDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random String default 'long long string'
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfInt64PropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[] default [142,123,789]
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
[142,123,789]

-CASE AddListOfInt64PropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[] default [142,123,789]
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
[142,123,789]

-CASE AddListOfInt64PropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[] default [142,123,789]
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfInt64PropertyWithDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random INT64[] default [142,123,789]
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStringPropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[] default ['142','short','long long long string']
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
[142,short,long long long string]

-CASE AddListOfStringPropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[] default ['142','short','long long long string']
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
[142,short,long long long string]

-CASE AddListOfStringPropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[] default ['142','short','long long long string']
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStringPropertyWithDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[] default ['142','short','long long long string']
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfListOfStringPropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[][] default [['142','51'],['short','long','123'],['long long long string','short short short short','short']]
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random LIMIT 1
---- 1
[[142,51],[short,long,123],[long long long string,short short short short,short]]

-CASE AddListOfListOfStringPropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[][] default [['142','51'],['short','long','123'],['long long long string','short short short short','short']]
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random LIMIT 1
---- 1
[[142,51],[short,long,123],[long long long string,short short short short,short]]

-CASE AddListOfListOfStringPropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[][] default [['142','51'],['short','long','123'],['long long long string','short short short short','short']]
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) return p.random LIMIT 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfListOfStringPropertyWithDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRING[][] default [['142','51'],['short','long','123'],['long long long string','short short short short','short']]
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random LIMIT 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStructPropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[] default [{revenue: 144, ages: [3.200000,7.200000]}]
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
[{revenue: 144, ages: [3.200000,7.200000]}]

-CASE AddListOfStructPropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[] default [{revenue: 144, ages: [3.200000,7.200000]}]
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
[{revenue: 144, ages: [3.200000,7.200000]}]

-CASE AddListOfStructPropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[] default [{revenue: 144, ages: [3.200000,7.200000]}]
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddListOfStructPropertyWithDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(revenue int64, ages double[])[] default [{revenue: 144, ages: [3.200000,7.200000]}]
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddMapPropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64[]) default map(['key3'],[[3,2,1]])
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
{key3=[3,2,1]}

-CASE AddMapPropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64[]) default map(['key3'],[[3,2,1]])
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
{key3=[3,2,1]}

-CASE AddMapPropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64[]) default map(['key3'],[[3,2,1]])
---- ok
-STATEMENT rollback
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddMapPropertyWithDefaultRollbackRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random MAP(STRING, INT64[]) default map(['key3'],[[3,2,1]])
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddStructPropertyWithDefaultCommit
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64) default {price: [5,3,2], volume: 24}
---- ok
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
{price: [5,3,2], volume: 24}

-CASE AddStructPropertyWithDefaultCommitRecovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64) default {price: [5,3,2], volume: 24}
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- 1
{price: [5,3,2], volume: 24}

-CASE AddStructPropertyWithDefaultRollback
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64) default {price: [5,3,2], volume: 24}
---- ok
-STATEMENT ROLLBACK
---- ok
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.

-CASE AddStructPropertyWithDefaultRollbackReovery
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT ALTER TABLE person ADD random STRUCT(price INT64[], volume INT64) default {price: [5,3,2], volume: 24}
---- ok
-STATEMENT ROLLBACK;
---- ok
-RELOADDB
-STATEMENT MATCH (p:person) return p.random limit 1
---- error
Binder exception: Cannot find property random for p.
