-NAME interactive_short_query_1
-COMPARE_RESULT 1
-QUERY MATCH (n:Person)-[:personIsLocatedIn]->(p:Place) WHERE n.ID = 933 RETURN n.firstName AS firstName, n.lastName AS lastName,n.birthday AS birthday, n.locationIP AS locationIP, n.browserUsed AS browserUsed,p.ID AS cityId,n.gender AS gender,n.creationDate AS creationDate
---- 1
1980-02-01|1980-02-01
