-NAME interactive_short_query_5
-COMPARE_RESULT 1
-QUERY MATCH (c:Comment {ID: 2061584302085})-[:commentHasCreator]->(p:Person) RETURN p.ID AS personId, p.firstName AS firstName, p.lastName AS lastName;
---- 1
1980-02-01|1980-02-01
