-NAME q29
-QUERY MATCH (a:Person)-[:knows]->(b:Person) RETURN MIN(a.birthday), MIN(b.birthday)
---- 1
1980-02-01|1980-02-01
