-NAME q30
-QUERY MATCH (a:Person)-[:knows]->(b:Person)-[:knows]->(c:Person) RETURN MIN(a.birthday), MIN(b.birthday), MIN(c.birthday)
---- 1
1980-02-01|1980-02-01|1980-02-01
