-NAME q29
-COMPARE_RESULT 1
-QUERY MATCH (a:Person)-[:knows]->(b:Person) WHERE a.ID=0 RETURN MIN(a.birthday), MIN(b.birthday)
-ENCODED_JOIN HJ(b){E(b)S(a)}{S(b)}
---- 1
1989-12-03|1980-03-31