-NAME SelectiveTwoHopJoin
-COMPARE_RESULT 1
-QUERY MATCH (a:Person)-[:knows]->(b:Person)-[:knows]->(c:person) WHERE a.ID=933 RETURN MIN(a.birthday), MIN(b.birthday), MIN(c.birthday)
---- 1
1989-12-03|1980-03-31|1980-02-01
