-DATASET CSV copy-fault-tests/duplicate-ids

--

-CASE DuplicateIntIDsError
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/duplicate-ids/vPerson.csv"
---- error
Copy exception: Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.

-CASE DuplicateStringIDsError
-STATEMENT COPY org FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/duplicate-ids/vOrg.csv"
---- error
Copy exception: Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.

-CASE DuplicateIntIDsIgnoreErrors
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/duplicate-ids/vPerson.csv"(IGNORE_ERRORS=true)
---- 2
3 tuples have been copied to the person table.
1 warnings encountered during copy. Use 'CALL show_warnings() RETURN *' to view the actual warnings. Query ID: 2
-STATEMENT MATCH (p:person) RETURN p.*
---- 3
10|Guodong
24|Semih
31|Xiyang
-STATEMENT CALL show_warnings() RETURN message
---- 1
Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.

-CASE ManyDuplicateIntIDsIgnoreErrors
-STATEMENT CALL warning_limit=2
---- ok
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/duplicate-ids/vPersonManyDuplicates.csv"(IGNORE_ERRORS=true)
---- 2
2 tuples have been copied to the person table.
28 warnings encountered during copy. Use 'CALL show_warnings() RETURN *' to view the actual warnings. Query ID: 3
-STATEMENT MATCH (p:person) RETURN p.*
---- 2
10|a
11|aa
-STATEMENT CALL show_warnings() RETURN message
---- 2
Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.
Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.

-CASE DuplicateStringIDsIgnoreErrors
-STATEMENT COPY org FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/duplicate-ids/vOrg.csv"(IGNORE_ERRORS=true)
---- 2
3 tuples have been copied to the org table.
1 warnings encountered during copy. Use 'CALL show_warnings() RETURN *' to view the actual warnings. Query ID: 2
-STATEMENT MATCH (o:org) RETURN o.*
---- 3
10|Guodong
24|Semih
31|Xiyang
-STATEMENT CALL show_warnings() RETURN message
---- 1
Found duplicated primary key value 10, which violates the uniqueness constraint of the primary key column.
