-DATASET CSV copy-fault-tests/null-pk

--

-CASE NullPrimaryKeyInNodeFile
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson.csv"
---- error
Copy exception: Found NULL, which violates the non-null constraint of the primary key column.

-CASE NullPrimaryKeyInMultiNodeFiles
-STATEMENT COPY person FROM ["${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson.csv", "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson2.csv"]
---- error
Copy exception: Found NULL, which violates the non-null constraint of the primary key column.

-CASE NullPrimaryKeyInNodeFileIgnoreErrors
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson.csv"(IGNORE_ERRORS=true)
---- 2
2 tuples have been copied to the person table.
1 warnings encountered during copy. Use 'CALL show_warnings() RETURN *' to view the actual warnings. Query ID: 3
-STATEMENT MATCH (p:person) RETURN p.fName
---- 2
alice
bob
-STATEMENT CALL show_warnings() RETURN query_id, message, file_path, skipped_line_or_record, line_number
---- 1
3|Found NULL, which violates the non-null constraint of the primary key column.|${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson.csv||2

-CASE NullPrimaryKeyInMultiNodeFilesIgnoreErrors
-STATEMENT COPY person FROM ["${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson.csv", "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson2.csv"](IGNORE_ERRORS=true)
---- 2
5 tuples have been copied to the person table.
2 warnings encountered during copy. Use 'CALL show_warnings() RETURN *' to view the actual warnings. Query ID: 3
-STATEMENT CALL show_warnings() RETURN query_id, message, file_path, skipped_line_or_record, line_number
---- 2
3|Found NULL, which violates the non-null constraint of the primary key column.|${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson.csv||2
3|Found NULL, which violates the non-null constraint of the primary key column.|${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson2.csv||3

-CASE NullPrimaryKeyInMultiNodeFilesIgnoreErrorsWarningLimit
-STATEMENT CALL warning_limit=1;
---- ok
-STATEMENT COPY person FROM ["${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson.csv", "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson2.csv"](IGNORE_ERRORS=true)
---- 2
5 tuples have been copied to the person table.
2 warnings encountered during copy. Use 'CALL show_warnings() RETURN *' to view the actual warnings. Query ID: 4
-STATEMENT CALL show_warnings() RETURN query_id, message
---- 1
4|Found NULL, which violates the non-null constraint of the primary key column.

-CASE NullPrimaryKeyInRelFile
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson-valid.csv"
---- ok
-STATEMENT COPY movie FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vMovie.csv"
---- ok
-STATEMENT COPY like FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/eLikes.csv"
---- error
Copy exception: Found NULL, which violates the non-null constraint of the primary key column.

-CASE NullPrimaryKeyInRelFileIgnoreErrors
-STATEMENT COPY person FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vPerson-valid.csv"
---- ok
-STATEMENT COPY movie FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/vMovie.csv"
---- ok
-STATEMENT COPY like FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/eLikes.csv"(IGNORE_ERRORS=true)
---- 2
3 tuples have been copied to the like table.
1 warnings encountered during copy. Use 'CALL show_warnings() RETURN *' to view the actual warnings. Query ID: 5
-STATEMENT CALL show_warnings() RETURN message, file_path, line_number, skipped_line_or_record
---- 1
Found NULL, which violates the non-null constraint of the primary key column.|${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/null-pk/eLikes.csv|3|,0
