-DATASET CSV tinysnb

--

-CASE TinySnbTests

-LOG NodeRelTest
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) RETURN OFFSET(ID(coalesce(NULL, NULL, a))), OFFSET(ID(coalesce(NULL, e, NULL))), OFFSET(ID(coalesce(b, NULL)));
---- 14
0|0|1
0|1|2
0|2|3
1|3|0
1|4|2
1|5|3
2|6|0
2|7|1
2|8|3
3|9|0
3|10|1
3|11|2
4|12|5
4|13|6

-LOG DifferentStateTest
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE coalesce(NULL, b.isStudent) MATCH (b)-[s:studyAt]->(c:organisation) RETURN b.fName, c.name;
---- 7
Alice|ABFsUni
Alice|ABFsUni
Alice|ABFsUni
Bob|ABFsUni
Bob|ABFsUni
Bob|ABFsUni
Farooq|ABFsUni

-STATEMENT MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) WHERE ifnull(b.isStudent, a.isStudent) RETURN coalesce(NULL, a.fName, c.fName);
---- 18
Alice
Carol
Dan
Bob
Carol
Dan
Alice
Carol
Dan
Bob
Carol
Dan
Alice
Carol
Dan
Bob
Carol
Dan
