-NAME interactive_complex_query_11
-COMPARE_RESULT 1
-QUERY MATCH (person:Person {ID: 933})-[:knows*1..2]->(friend:Person) WHERE person.ID <> friend.ID WITH DISTINCT friend MATCH (friend)-[workAt:workAt]->(company:Organisation)-[:organisationIsLocatedIn]->(:Place {name: 'Hungary'}) WHERE workAt.workFrom < 2011 RETURN friend.ID AS personId, friend.firstName AS personFirstName, friend.lastName AS personLastName, company.name AS organizationName, workAt.workFrom AS organizationWorkFromYear ORDER BY organizationWorkFromYear ASC, personId ASC, organizationName DESC LIMIT 10
---- 1
1980-02-01|1980-02-01
