-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FilterMultiLabel

-LOG MultiLabelOneHopTest1
-STATEMENT MATCH (a:person)-[e:knows|:marries]->(b:person) WHERE e.date=date('2021-06-30') RETURN COUNT(*)
-ENUMERATE
---- 1
6

#-LOG MultiLabelTwoHopTest1
#-STATEMENT MATCH (a:person)<-[e:knows|:meets]-(b:person)-[:knows|:meets]->(c:person) WHERE b.ID = 7 AND a.ID = c.ID RETURN COUNT(*)
#-ENUMERATE
#---- 1
#3

#-LOG MultiLabelTwoHopTest2
#-STATEMENT MATCH (a:person)<-[e1:knows|:meets]-(b:person)-[e2:knows|:meets]->(c:person) WHERE b.ID = 0 AND ID(e1)<>ID(e2) RETURN COUNT(*)
#-ENUMERATE
#---- 1
#12
