-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FilterNode

-DEBUG_LOG PersonNodesAgeFilteredTest1
-QUERY MATCH (a:person) WHERE a.age <= 25 RETURN COUNT(*)
---- 1
3

-DEBUG_LOG PersonNodesAgeFilteredTest2
-QUERY MATCH (a:person) WHERE a.age < 25 RETURN COUNT(*)
---- 1
2

-DEBUG_LOG PersonNodesAgeFilteredTest3
-QUERY MATCH (a:person) WHERE a.age >= 25 RETURN COUNT(*)
---- 1
6

-DEBUG_LOG PersonNodesAgeFilteredTest4
-QUERY MATCH (a:person) WHERE a.age > 25 RETURN COUNT(*)
---- 1
5

-DEBUG_LOG PersonNodesAgeFilteredTest5
-QUERY MATCH (a:person {age:25}) RETURN COUNT(*)
---- 1
1

-DEBUG_LOG PersonNodesAgeFilteredTest6
-QUERY MATCH (a:person) WHERE a.age <> 25 RETURN COUNT(*)
---- 1
7

-DEBUG_LOG PersonNodesAgeFilteredTest7
-QUERY MATCH (a:person) WHERE a.age IS NULL RETURN COUNT(*)
---- 1
0

-DEBUG_LOG PersonNodesAgeFilteredTest8
-QUERY MATCH (a:person) WHERE a.age IS NOT NULL RETURN COUNT(*)
---- 1
8

-DEBUG_LOG SingletonKnowsFilteredTest
-QUERY MATCH (a:person) WHERE a.gender * 2.1 = 2.1 * a.gender RETURN COUNT(*)
---- 1
8

-DEBUG_LOG PersonNodesIsStudentFilteredTest
-QUERY MATCH (a:person) WHERE a.isStudent RETURN COUNT(*)
---- 1
3

-DEBUG_LOG PersonNodesIsWorkerFilteredTest
-QUERY MATCH (a:person {isWorker:true}) RETURN COUNT(*)
---- 1
4

-DEBUG_LOG PersonNodesIsWorkerFilteredTest1
-QUERY MATCH (a:person) WHERE a.isWorker AND a.isStudent RETURN COUNT(*)
---- 1
0

-DEBUG_LOG PersonNodesIsWorkerFilteredTest2
-QUERY MATCH (a:person) WHERE a.isWorker OR a.isStudent RETURN COUNT(*)
---- 1
7

-DEBUG_LOG PersonNodesIsWorkerFilteredTest3
-QUERY MATCH (a:person) WHERE a.isWorker XOR a.isStudent RETURN COUNT(*)
---- 1
7

-DEBUG_LOG PersonNodesIsWorkerFilteredTest4
-QUERY MATCH (a:person) WHERE NOT a.isWorker RETURN COUNT(*)
---- 1
4

-DEBUG_LOG OrganisationNodesMarkFilteredTest
-QUERY MATCH (a:organisation) WHERE a.mark >= 3.7 RETURN COUNT(*)
---- 1
3

-DEBUG_LOG PersonNodesGenderFilteredTest1
-QUERY MATCH (a:person) WHERE (a.gender/2 <= 0.5) RETURN COUNT(*)
---- 1
3

-DEBUG_LOG PersonNodesGenderFilteredTest2
-QUERY MATCH (a:person) WHERE (a.gender*3.5 = 7.0) RETURN COUNT(*)
---- 1
5

-DEBUG_LOG PersonNodesFNameFilteredTest1
-QUERY MATCH (a:person) WHERE a.fName = 'Farooq' RETURN COUNT(*)
---- 1
1

-DEBUG_LOG PersonNodesFNameFilteredTest2
-QUERY MATCH (a:person) WHERE a.fName <> 'Farooq' RETURN COUNT(*)
---- 1
7

-DEBUG_LOG PersonNodesFNameFilteredTest3
-QUERY MATCH (a:person) WHERE a.fName < 'Carom' RETURN COUNT(*)
---- 1
3

-DEBUG_LOG PersonNodesFNameFilteredTest4
-QUERY MATCH (a:person) WHERE a.fName >= 'Eliz' RETURN COUNT(*)
---- 1
4

-DEBUG_LOG FilterNullTest1
-QUERY MATCH (a:person) WHERE a.age <= null RETURN COUNT(*)
---- 1
0

-DEBUG_LOG FilterNullTest2
-QUERY MATCH (a:person) WHERE a.age + null <= 200 RETURN COUNT(*)
---- 1
0

-DEBUG_LOG FilterNullTest3
-QUERY MATCH (a:person) WHERE a.isStudent OR null RETURN COUNT(*)
---- 1
3

#-DEBUG_LOG nodeCrossProduct
#-QUERY MATCH (a:person), (b:person {ID:a.ID}) WHERE a.ID < 4 RETURN COUNT(*)
#-ENUMERATE
#---- 1
#3

#-DEBUG_LOG nodeCrossProduct
#-QUERY MATCH (a:person {ID:1000}), (b:person) RETURN COUNT(*)
#-ENUMERATE
#---- 1
#0
