-NAME PersonNodesAgeFilteredTest1
-QUERY MATCH (a:person) WHERE a.age <= 25 RETURN COUNT(*)
---- 1
3

-NAME PersonNodesAgeFilteredTest2
-QUERY MATCH (a:person) WHERE a.age < 25 RETURN COUNT(*)
---- 1
2

-NAME PersonNodesAgeFilteredTest3
-QUERY MATCH (a:person) WHERE a.age >= 25 RETURN COUNT(*)
---- 1
6

-NAME PersonNodesAgeFilteredTest4
-QUERY MATCH (a:person) WHERE a.age > 25 RETURN COUNT(*)
---- 1
5

-NAME PersonNodesAgeFilteredTest5
-QUERY MATCH (a:person) WHERE a.age = 25 RETURN COUNT(*)
---- 1
1

-NAME PersonNodesAgeFilteredTest6
-QUERY MATCH (a:person) WHERE a.age <> 25 RETURN COUNT(*)
---- 1
7

-NAME PersonNodesAgeFilteredTest7
-QUERY MATCH (a:person) WHERE a.age IS NULL RETURN COUNT(*)
---- 1
0

-NAME PersonNodesAgeFilteredTest8
-QUERY MATCH (a:person) WHERE a.age IS NOT NULL RETURN COUNT(*)
---- 1
8

-NAME SingletonKnowsFilteredTest
-QUERY MATCH (a:person) WHERE a.gender * 2.1 = 2.1 * a.gender RETURN COUNT(*)
---- 1
8

-NAME PersonNodesIsStudentFilteredTest
-QUERY MATCH (a:person) WHERE a.isStudent RETURN COUNT(*)
---- 1
3

-NAME PersonNodesIsWorkerFilteredTest
-QUERY MATCH (a:person) WHERE a.isWorker = true RETURN COUNT(*)
---- 1
4

-NAME PersonNodesIsWorkerFilteredTest1
-QUERY MATCH (a:person) WHERE a.isWorker AND a.isStudent RETURN COUNT(*)
---- 1
0

-NAME PersonNodesIsWorkerFilteredTest2
-QUERY MATCH (a:person) WHERE a.isWorker OR a.isStudent RETURN COUNT(*)
---- 1
7

-NAME PersonNodesIsWorkerFilteredTest3
-QUERY MATCH (a:person) WHERE a.isWorker XOR a.isStudent RETURN COUNT(*)
---- 1
7

-NAME PersonNodesIsWorkerFilteredTest4
-QUERY MATCH (a:person) WHERE NOT a.isWorker RETURN COUNT(*)
---- 1
4

-NAME OrganisationNodesMarkFilteredTest
-QUERY MATCH (a:organisation) WHERE a.mark >= 3.7 RETURN COUNT(*)
---- 1
3

-NAME PersonNodesGenderFilteredTest1
-QUERY MATCH (a:person) WHERE (a.gender/2 <= 0.5) RETURN COUNT(*)
---- 1
3

-NAME PersonNodesGenderFilteredTest2
-QUERY MATCH (a:person) WHERE (a.gender*3.5 = 7.0) RETURN COUNT(*)
---- 1
5

-NAME PersonNodesFNameFilteredTest1
-QUERY MATCH (a:person) WHERE a.fName = 'Farooq' RETURN COUNT(*)
---- 1
1

-NAME PersonNodesFNameFilteredTest2
-QUERY MATCH (a:person) WHERE a.fName <> 'Farooq' RETURN COUNT(*)
---- 1
7

-NAME PersonNodesFNameFilteredTest3
-QUERY MATCH (a:person) WHERE a.fName < 'Carom' RETURN COUNT(*)
---- 1
3

-NAME PersonNodesFNameFilteredTest4
-QUERY MATCH (a:person) WHERE a.fName >= 'Eliz' RETURN COUNT(*)
---- 1
4

-NAME FilterNullTest1
-QUERY MATCH (a:person) WHERE a.age <= null RETURN COUNT(*)
---- 1
0

-NAME FilterNullTest2
-QUERY MATCH (a:person) WHERE a.age + null <= 200 RETURN COUNT(*)
---- 1
0

-NAME FilterNullTest3
-QUERY MATCH (a:person) WHERE a.isStudent OR null RETURN COUNT(*)
---- 1
3

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME PersonUnstrFilteredTest1
#-QUERY MATCH (a:person) WHERE a.unstrNumericProp > 48 RETURN COUNT(*)
#---- 1
#2

#-NAME PersonUnstrFilteredTest2
#-QUERY MATCH (a:person) WHERE a.unstrNumericProp <= 68 RETURN COUNT(*)
#---- 1
#3

#-NAME PersonUnstrFilteredTest3
#-QUERY MATCH (a:person) WHERE a.unstrNumericProp = 52 RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest4
#-QUERY MATCH (a:person) WHERE 10 + a.unstrNumericProp = 57 RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest5
#-QUERY MATCH (a:person) WHERE a.unstrNumericProp + a.unstrNumericProp2 = 67 RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest6
#-QUERY MATCH (a:person) WHERE a.unstrNumericProp - 10 > a.unstrNumericProp2 RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest7
#-QUERY MATCH (a:person) WHERE concat('abc ', string(a.unstrNumericProp)) = 'abc 52' RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest8
#-QUERY MATCH (a:person) WHERE concat(a.unstrNumericProp2, ' abcdefghijklm') = '20 abcdefghijklm' RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest10
#-QUERY MATCH (a:person) WHERE '47Bob' = concat(string(a.unstrNumericProp), a.fName) RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest11
#-QUERY MATCH (a:person) WHERE concat(string(a.unstrDateProp1), a.fName) = '1950-01-01Bob' RETURN COUNT(*)
#---- 1
#1

#-NAME PersonUnstrFilteredTest12
#-QUERY MATCH (a:person) WHERE a.unstrDateProp1 IS NULL RETURN COUNT(*)
#---- 1
#5

#-NAME PersonUnstrFilteredTest13
#-QUERY MATCH (a:person) WHERE a.unstrDateProp1 IS NOT NULL RETURN COUNT(*)
#---- 1
#3

#-NAME PersonUnstrFilteredTest14
#-QUERY MATCH (a:person) WHERE a.unstrTimestampProp1 IS NULL RETURN COUNT(*)
#---- 1
#4

#-NAME PersonUnstrFilteredTest15
#-QUERY MATCH (a:person) WHERE a.unstrTimestampProp2  IS NOT NULL RETURN COUNT(*)
#---- 1
#2
