-NAME OneHopKnowsFilteredTest3
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE (a.gender/2 <= 0.5) AND (b.gender*3.5 = 7.0) RETURN COUNT(*)
---- 1
6

-NAME TwoHopKnowsIDLessThanTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) < id(b) RETURN COUNT(*)
---- 1
8

-NAME OneHopKnowsFilteredTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.gender = 1 AND b.gender = 2 RETURN COUNT(*)
-ENUMERATE
---- 1
6

-NAME OneHopKnowsFilteredTest2
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.age > 22 RETURN COUNT(*)
-ENUMERATE
---- 1
9

-NAME OneHopOrgCodeFilter
-QUERY MATCH (a:person)-[e1:studyAt]->(b:organisation) WHERE b.orgCode > 100 RETURN COUNT(*)
-ENUMERATE
---- 1
3

-NAME OneHopKnowsIDGreaterThanTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) > id(b) RETURN COUNT(*)
-ENUMERATE
---- 1
6

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME PersonUnstrFilteredTest9
#-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.unstrNumericProp > b.unstrNumericProp RETURN COUNT(*)
#-ENUMERATE
#---- 1
#1

-NAME OneHopCrossProduct
-QUERY MATCH (a:person), (c:person)-[:knows]->(d:person) WHERE a.age = 30 AND d.fName='Greg' RETURN a.ID, c.ID
-ENUMERATE
---- 1
2|7
