-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FilterOneHop

-NAME OneHopKnowsFilteredTest3
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE (a.gender/2 <= 0.5) AND (b.gender*3.5 = 7.0) RETURN COUNT(*)
---- 1
6

-NAME TwoHopKnowsIDLessThanTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) < id(b) RETURN COUNT(*)
---- 1
8

-NAME OneHopKnowsFilteredTest
-QUERY MATCH (a:person {gender:1})-[e:knows]->(b:person{gender:2}) RETURN COUNT(*)
-ENUMERATE
---- 1
6

-NAME OneHopKnowsFilteredTest2
-QUERY MATCH (a:person)-[e:knows]->(b:person) WHERE a.age > 22 RETURN COUNT(*)
-ENUMERATE
---- 1
9

-NAME OneHopOrgCodeFilter
-QUERY MATCH (a:person)-[e1:studyAt]->(b:organisation) WHERE b.orgCode > 100 RETURN COUNT(*)
-ENUMERATE
---- 1
3

-NAME OneHopKnowsIDGreaterThanTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) > id(b) RETURN COUNT(*)
-ENUMERATE
---- 1
6

#-NAME OneHopCrossProduct
#-QUERY MATCH (a:person {age:30}), (c:person)-[:knows]->(d:person{fName:'Greg'}) RETURN a.ID, c.ID
#-ENUMERATE
#---- 1
#2|7

#-NAME EdgeFilter
#-QUERY MATCH (a:person)-[e1:knows {date:date('1905-12-12')}]->(b:person) RETURN a.ID, b.ID
#-ENUMERATE
#---- 2
#7|8
#7|9
