-DATASET CSV tinysnb

--

-CASE FunctionCase

-LOG CaseNull

-STATEMENT RETURN CASE NULL  WHEN NULL THEN "Null value" ELSE "Not null value" END;
---- 1
Null value
-STATEMENT return case 25 when 25 then null else 25 end;
---- 1

-STATEMENT return case 25 when 24 then NULL else 25 end;
---- 1
25
-STATEMENT return case 25 when 24 then 25 else NULL end;
---- 1

-LOG CaseFold
-STATEMENT RETURN CASE WHEN 4 % 2 = 0 THEN 100 ELSE 50 END
---- 1
100

-LOG CaseIntTest
-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN CASE a.age WHEN 35 THEN a.age + 1 ELSE 0 END
---- 4
36
0
0
0

-LOG CaseStringTest
-STATEMENT MATCH (a:person) WHERE a.ID > 6 RETURN CASE WHEN true THEN a.fName ELSE 'a' END
---- 4
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-LOG CaseDoubleTest
-STATEMENT MATCH (a:person) WHERE a.ID < 6 RETURN CASE WHEN a.eyeSight > 4.9 THEN a.eyeSight ELSE 1.0 END + 2.0
---- 4
3.000000
7.000000
7.000000
7.100000

-LOG CaseListTest
-STATEMENT MATCH (a:person) WHERE a.ID > 6 RETURN CASE WHEN size(a.workedHours) = 1 THEN a.courseScoresPerTerm END
---- 4


[[10]]
[[6],[7],[8]]

-LOG CaseIntTest
-STATEMENT MATCH (a:person) WHERE CASE a.fName WHEN 'Bob' THEN a.isStudent WHEN 'Carol' THEN NOT a.isStudent END RETURN a.fName
---- 2
Bob
Carol

-LOG Case2HopTest
-STATEMENT MATCH (a:person)-[:knows]->(b:person) RETURN CASE a.age WHEN 35 THEN b.fName ELSE "abcdefghijklmnopq" END
---- 14
Bob
Carol
Dan
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq
abcdefghijklmnopq

-LOG Case2HopTest2
-STATEMENT MATCH (a:person)-[:knows]->(b:person) WHERE a.ID = 0 RETURN CASE WHEN (a.ID = 0 AND b.ID = 2) THEN a.ID WHEN true THEN b.ID ELSE 111 END
---- 3
0
3
5
