-DATASET CSV tck

--

-CASE Range
-STATEMENT CREATE NODE TABLE A(ID SERIAL, AGE INT64, NAME STRING, NUMBER INT32, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE REL TABLE T(FROM A TO A);
---- ok
-STATEMENT CREATE ({AGE: 1, NAME: "Alice", NUMBER: 1})-[]->({AGE: 2, NAME: "Alice", NUMBER: 2});
---- ok
-STATEMENT CREATE ({AGE: 0, NAME:"Alice", NUMBER:3});
---- ok
-STATEMENT MATCH (a) RETURN range(a.AGE, 3);
---- 3
[1,2,3]
[2,3]
[0,1,2,3]
-STATEMENT MATCH(a) RETURN range(1, a.AGE, 1);
---- 3
[1]
[1,2]
[]
-STATEMENT MATCH(a) RETURN range(a.ID, a.ID, 1);
---- 3
[0]
[1]
[2]
#-STATEMENT MATCH (a)--() RETURN range(a.AGE, a.AGE, a.AGE);
#---- 2
#[1]
#[2]
#-STATEMENT MATCH (a)--() RETURN range(1, 5, a.AGE);
#---- 2
#[1,2,3,4,5]
#[1,3,5]
-STATEMENT MATCH (a) RETURN range(a.NUMBER, a.AGE, -1);
---- 3
[1]
[2]
[3,2,1,0]
-STATEMENT MATCH (a) RETURN range(-4, a.AGE, a.NUMBER);
---- 3
[-4,-3,-2,-1,0,1]
[-4,-2,0,2]
[-4,-1]
#-STATEMENT MATCH (b)--() RETURN range(b.AGE, 4, b.NUMBER);
#---- 2
#[1,2,3,4]
#[2,4]
-STATEMENT MATCH (a) RETURN range(a.NUMBER, 5, a.AGE);
---- error
Runtime exception: Step of range cannot be 0.
-STATEMENT MATCH (a) RETURN range(a.NAME, 4, 1);
---- error
Binder exception: Cannot match a built-in function for given function RANGE(STRING,INT64,INT64). Supported inputs are
(INT128,INT128) -> LIST
(INT128,INT128,INT128) -> LIST
(INT64,INT64) -> LIST
(INT64,INT64,INT64) -> LIST
(INT32,INT32) -> LIST
(INT32,INT32,INT32) -> LIST
(INT16,INT16) -> LIST
(INT16,INT16,INT16) -> LIST
(INT8,INT8) -> LIST
(INT8,INT8,INT8) -> LIST
(SERIAL,SERIAL) -> LIST
(SERIAL,SERIAL,SERIAL) -> LIST
(UINT64,UINT64) -> LIST
(UINT64,UINT64,UINT64) -> LIST
(UINT32,UINT32) -> LIST
(UINT32,UINT32,UINT32) -> LIST
(UINT16,UINT16) -> LIST
(UINT16,UINT16,UINT16) -> LIST
(UINT8,UINT8) -> LIST
(UINT8,UINT8,UINT8) -> LIST
-STATEMENT RETURN range(4, 3);
---- 1
[]
-STATEMENT RETURN range(0, 0);
---- 1
[0]
-STATEMENT RETURN range(1, 5);
---- 1
[1,2,3,4,5]
-STATEMENT RETURN range(To_INT32(-3), TO_INT32(0));
---- 1
[-3,-2,-1,0]
-STATEMENT RETURN range(To_INT16(-3), TO_INT16(0));
---- 1
[-3,-2,-1,0]
-STATEMENT RETURN range(To_INT8(-3), TO_INT16(0));
---- 1
[-3,-2,-1,0]
-STATEMENT RETURN range(To_INT8(-3), TO_INT8(0));
---- 1
[-3,-2,-1,0]
-STATEMENT RETURN range(4, 4, 2);
---- 1
[4]
-STATEMENT RETURN range(4, 4, -2);
---- 1
[4]
-STATEMENT RETURN range(5, 1, -1);
---- 1
[5,4,3,2,1]
-STATEMENT RETURN range(5, 1, -2);
---- 1
[5,3,1]
-STATEMENT RETURN range(5, 1, -3);
---- 1
[5,2]
-STATEMENT RETURN range(6, 2, 2);
---- 1
[]
-STATEMENT RETURN range(3, 6, -5);
---- 1
[]
-STATEMENT RETURN range(3, 6, -1);
---- 1
[]
-STATEMENT RETURN range(TO_INT32(3), 8, 2);
---- 1
[3,5,7]
-STATEMENT RETURN range(TO_INT8(0), TO_INT16(-9), TO_INT8(-2));
---- 1
[0,-2,-4,-6,-8]
-STATEMENT RETURN range(TO_INT16(5), TO_INT16(6), TO_INT16(1));
---- 1
[5,6]
-STATEMENT RETURN range(TO_INT32(5), 25, TO_INT32(10));
---- 1
[5,15,25]
-STATEMENT RETURN range(TO_INT32(5), TO_INT32(26), TO_INT32(10));
---- 1
[5,15,25]
-STATEMENT RETURN range(TO_INT8(-128), TO_INT8(127), TO_INT8(127));
---- 1
[-128,-1,126]
-STATEMENT RETURN range(CAST(-128, 'INT128'), CAST(122, 'INT128'), CAST(125, 'INT128'));
---- 1
[-128,-3,122]
-STATEMENT RETURN range(CAST(4, 'uint64'), CAST(50, 'uint64'), CAST(16, 'uint64'));
---- 1
[4,20,36]
-STATEMENT RETURN range(CAST(2, 'uint32'), CAST(70, 'uint32'), CAST(3, 'uint32'));
---- 1
[2,5,8,11,14,17,20,23,26,29,32,35,38,41,44,47,50,53,56,59,62,65,68]
-STATEMENT RETURN range(CAST(1, 'uint16'), CAST(55, 'uint16'), CAST(128, 'uint16'));
---- 1
[1]
-STATEMENT RETURN range(CAST(3, 'uint8'), CAST(50, 'uint8'), CAST(5, 'uint8'));
---- 1
[3,8,13,18,23,28,33,38,43,48]
-STATEMENT RETURN range(3, 4, 0);
---- error
Runtime exception: Step of range cannot be 0.
-STATEMENT RETURN range(0, -1, 9223372036854775807);
---- 1
[]
