-DATASET CSV EMPTY

--

-CASE RelGroupGDS
-LOAD_DYNAMIC_EXTENSION algo
-STATEMENT CREATE NODE TABLE N1(id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE NODE TABLE N2(id INT64 PRIMARY KEY);
---- ok
-STATEMENT CREATE REL TABLE R (FROM N1 TO N1, FROM N1 TO N2);
---- ok
-STATEMENT UNWIND [1,2,3,4,5] AS id CREATE (n1:N1 {id:id})-[]->(n2:N2 {id:id});
---- ok
-STATEMENT UNWIND [1,2,3] AS id
        MATCH (a:N1), (b:N1) WHERE a.id=id AND b.id=id+1
        CREATE (a)-[]->(b)
---- ok
-STATEMENT CALL PROJECT_GRAPH('G', ['N1'], ['R'])
---- error
Binder exception: N2 is connected to R but not projected.
-STATEMENT CALL PROJECT_GRAPH('G', ['N1', 'N2'], ['R'])
---- ok
-STATEMENT CALL weakly_connected_components('G') RETURN label(node), node.id, group_id;
---- 10
N1|1|0
N1|2|0
N1|3|0
N1|4|0
N1|5|4
N2|1|0
N2|2|0
N2|3|0
N2|4|0
N2|5|4
