-DATASET CSV empty

--

-CASE ScanSqliteTable
-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/sqlite/build/libsqlite.kuzu_extension"
---- ok
-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/sqlite/build/libsqlite.kuzu_extension"
---- ok
-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/sqlite/test/sqlite_database/tinysnb' as tinysnb (dbtype sqlite);
---- 1
Attached database successfully.
# TODO(Xiyang): There is no BOOL,DATE type in sqlite, so we should apply a casting from int64->bool when doing copy from.
-STATEMENT create node table person_copy (ID INt64, fName StRING, gender INT64, isStudent int64, isWorker int64, age INT64, eyeSight DOUBLE, birthdate STRING, registerTime STRING, lastJobDuration STRING, workedHours STRING, usedNames STRING, courseScoresPerTerm STRING, height double, u string, grades string, PRIMARY KEY (ID));
---- ok
-STATEMENT COPY person_copy FROM tinysnb.person;
---- 1
8 tuples have been copied to the person_copy table.
-STATEMENT MATCH (p:person_copy) RETURN p.*
---- 8
0|Alice|1|1|0|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10, 5]|[Aida]|[[10, 8], [6, 7, 8]]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11|[96, 54, 86, 92]
2|Bob|2|1|0|30|5.100000|1900-01-01|2008-11-03 15:25:30.000526|10 years 5 months 13:00:00.000024|[12, 8]|[Bobby]|[[8, 9], [9, 10]]|0.990000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a12|[98, 42, 93, 88]
3|Carol|1|0|1|45|5.000000|1940-06-22|1911-08-20 02:32:21|48:24:11|[4, 5]|[Carmen, Fred]|[[8, 10]]|1.000000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a13|[91, 75, 21, 95]
5|Dan|2|0|1|20|4.800000|1950-07-23|2031-11-30 12:25:30|10 years 5 months 13:00:00.000024|[1, 9]|[Wolfeschlegelstein, Daniel]|[[7, 4], [8, 8], [9]]|1.300000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a14|[76, 88, 99, 89]
7|Elizabeth|1|0|1|20|4.700000|1980-10-26|1976-12-23 11:21:42|48:24:11|[2]|[Ein]|[[6], [7], [8]]|1.463000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a15|[96, 59, 65, 88]
8|Farooq|2|1|0|25|4.500000|1980-10-26|1972-07-31 13:22:30.678559|00:18:00.024|[3, 4, 5, 6, 7]|[Fesdwe]|[[8]]|1.510000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a16|[80, 78, 34, 83]
9|Greg|2|0|0|40|4.900000|1980-10-26|1976-12-23 11:21:42|10 years 5 months 13:00:00.000024|[1]|[Grad]|[[10]]|1.600000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a17|[43, 83, 67, 43]
10|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2|0|1|83|4.900000|1990-11-27|2023-02-21 13:25:30|3 years 2 days 13:02:00|[10, 11, 12, 3, 4, 5, 6, 7]|[Ad, De, Hi, Kye, Orlan]|[[7], [10], [6, 7]]|1.323000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a18|[77, 64, 100, 54]
-STATEMENT LOAD FROM tinysnb.person RETURN *;
---- 8
0|Alice|1|1|0|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10, 5]|[Aida]|[[10, 8], [6, 7, 8]]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11|[96, 54, 86, 92]
10|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2|0|1|83|4.900000|1990-11-27|2023-02-21 13:25:30|3 years 2 days 13:02:00|[10, 11, 12, 3, 4, 5, 6, 7]|[Ad, De, Hi, Kye, Orlan]|[[7], [10], [6, 7]]|1.323000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a18|[77, 64, 100, 54]
2|Bob|2|1|0|30|5.100000|1900-01-01|2008-11-03 15:25:30.000526|10 years 5 months 13:00:00.000024|[12, 8]|[Bobby]|[[8, 9], [9, 10]]|0.990000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a12|[98, 42, 93, 88]
3|Carol|1|0|1|45|5.000000|1940-06-22|1911-08-20 02:32:21|48:24:11|[4, 5]|[Carmen, Fred]|[[8, 10]]|1.000000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a13|[91, 75, 21, 95]
5|Dan|2|0|1|20|4.800000|1950-07-23|2031-11-30 12:25:30|10 years 5 months 13:00:00.000024|[1, 9]|[Wolfeschlegelstein, Daniel]|[[7, 4], [8, 8], [9]]|1.300000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a14|[76, 88, 99, 89]
7|Elizabeth|1|0|1|20|4.700000|1980-10-26|1976-12-23 11:21:42|48:24:11|[2]|[Ein]|[[6], [7], [8]]|1.463000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a15|[96, 59, 65, 88]
8|Farooq|2|1|0|25|4.500000|1980-10-26|1972-07-31 13:22:30.678559|00:18:00.024|[3, 4, 5, 6, 7]|[Fesdwe]|[[8]]|1.510000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a16|[80, 78, 34, 83]
9|Greg|2|0|0|40|4.900000|1980-10-26|1976-12-23 11:21:42|10 years 5 months 13:00:00.000024|[1]|[Grad]|[[10]]|1.600000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a17|[43, 83, 67, 43]
-STATEMENT LOAD FROM tinysnb.organisation RETURN *;
---- 3
1|ABFsUni|325|3.700000|-2|10 years 5 months 13 hours 24 us|3 years 5 days|1.000000|{'revenue': 138, 'location': ['toronto', 'montr,eal'], 'stock': {'price': [96, 56], 'volume': 1000}}|3.12
4|CsWork|934|4.100000|-100|2 years 4 days 10 hours|26 years 52 days 48:00:00|0.780000|{'revenue': 152, 'location': ["vanco,uver north area"], 'stock': {'price': [15, 78, 671], 'volume': 432}}|abcd
6|DEsWork|824|4.100000|7|2 years 4 hours 22 us 34 minutes|82:00:00.1|0.520000|{'revenue': 558, 'location': ['very long city name', 'new york'], 'stock': {'price': [22], 'volume': 99}}|2023-12-15
-STATEMENT LOAD FROM tinysnb.movies RETURN *;
---- 3
Roma|298|the movie is very interesting and funny|{'rating': 1223.0, 'stars': 100, 'views': 10003, 'release': 2011-02-11 16:44:22, 'release_ns': 2011-02-11 16:44:22.123456, 'release_ms': 2011-02-11 16:44:22.123, 'release_sec': 2011-02-11 16:44:22, 'release_tz': 2011-02-11 16:44:22.123456+00, 'film': 2013-02-22, 'u8': 1, 'u16': 15, 'u32': 200, 'u64': 4, 'hugedata': -15}|pure ascii characters|{}
Sóló cón tu párejâ|126| this is a very very good movie|{'rating': 5.3, 'stars': 2, 'views': 152, 'release': 2011-08-20 11:25:30, 'release_ns': 2011-08-20 11:25:30.123456, 'release_ms': 2011-08-20 11:25:30.123, 'release_sec': 2011-08-20 11:25:30, 'release_tz': 2011-08-20 11:25:30.123456+00, 'film': 2012-05-11, 'u8': 220, 'u16': 20, 'u32': 1, 'u64': 180, 'hugedata': 1844674407370955161811111111}|\xAA\xABinteresting\x0B|{audience1=52, audience53=42}
The 😂😃🧘🏻‍♂️🌍🌦️🍞🚗 movie|2544| the movie is very very good|{'rating': 7.0, 'stars': 10, 'views': 982, 'release': 2018-11-13 13:33:11, 'release_ns': 2018-11-13 13:33:11.123456, 'release_ms': 2018-11-13 13:33:11.123, 'release_sec': 2018-11-13 13:33:11, 'release_tz': 2018-11-13 13:33:11.123456+00, 'film': 2014-09-12, 'u8': 12, 'u16': 120, 'u32': 55, 'u64': 1, 'hugedata': -1844674407370955161511}|\xAB\xCD|{audience1=33}
-STATEMENT LOAD FROM tinysnb.tableOfTypes RETURN count(*);
---- 1
49999
-STATEMENT LOAD FROM tinysnb.tableOfTypes WHERE id = 49992 or id = 28532 RETURN *;
---- 2
28532|74|72.472423|1|1977-08-16|TKn|[94, 92]|[AUSrJTUWVOESDor, ODOS6RfqMhsFO9aFUa, ziauQj]|[[123, 55, 181], [32]]|{'ID': 666, 'name': DiqSQ5u5UhS8aZi}
49992|50|31.582059|0|2056-05-02||[62, 24, 94]|[LpQO8OT3x45a]|[[268, 281, 166], [144, 16, 126, 208, 298], [22, 287]]|{'ID': 936, 'name': sGPSafxMAhKiP}
-STATEMENT LOAD FROM tinysnb.person1 RETURN *;
---- error
Catalog exception: person1 does not exist in catalog.

-STATEMENT DETACH tinysnb;
---- 1
Detached database successfully.

-CASE ScanSqliteDynamicTable
-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/sqlite/build/libsqlite.kuzu_extension"
---- ok
-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/sqlite/test/sqlite_database/dynamic' as tinysnb (dbtype sqlite);
---- ok
-STATEMENT LOAD FROM tinysnb.dynamic_person RETURN *
----- error(regex)
-^Mismatch Type Error: Invalid type in column "id": column was declared as integer, found "abc" of type "text" instead.(\n|.)*
-STATEMENT CALL sqlite_all_varchar=true
---- ok
-STATEMENT LOAD FROM tinysnb.dynamic_person RETURN *
---- 3
102
5.872
alice

-CASE TestingDataTypesSqlite
-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/sqlite/build/libsqlite.kuzu_extension"
---- ok
-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/sqlite/test/sqlite_database/datatypeTestingSqlite' as datatype (dbtype sqlite);
---- ok
-STATEMENT CALL table_info('datatype.person') RETURN *;
---- 10
0|id|INT64|NULL
1|name|STRING|NULL
2|profile_picture|BLOB|NULL
3|balance|DOUBLE|NULL
4|age|INT64|NULL
5|is_active|INT64|NULL
6|birth_date|DATE|NULL
7|wrong_birth_time|TIMESTAMP|NULL
8|birth_time|TIMESTAMP|NULL
9|additional_info|BLOB|NULL
-STATEMENT CREATE NODE TABLE person_copy(id INT64 PRIMARY KEY, name STRING, profile_picture BLOB, balance DOUBLE, age INT64, is_active INT64, birth_date DATE, birth_time TIMESTAMP, additional_info BLOB);
---- ok
-STATEMENT COPY person_copy FROM (LOAD FROM datatype.person RETURN id, name, profile_picture, balance, age, is_active, birth_date, wrong_birth_time, additional_info);
---- error
Conversion Error: timestamp field value out of range: "08:30:00", expected format is (YYYY-MM-DD HH:MM:SS[.US][±HH:MM| ZONE])
-STATEMENT COPY person_copy FROM (LOAD FROM datatype.person RETURN id, name, profile_picture, balance, age, is_active, birth_date, birth_time, additional_info);
---- ok
-STATEMENT MATCH (p:person_copy) RETURN p.*;
---- 4
1|Alice||1000.500000|30|1|1993-05-21|1993-05-21 08:30:00|
2|Bob||2500.750000|27|0|1996-07-15|1996-07-15 14:45:00|
3|Carol||500.250000|19|1|2004-02-10|2004-02-10 12:00:00|
4|Dan||750.600000|25|1|1998-09-05|1998-09-05 09:15:00|
