-NAME BI5
-QUERY MATCH (tag:Tag {name: 'Abbas_I_of_Persia'})<-[:messageHasTag]-(message:comment:post)-[:messageHasCreator]->(person:Person)
       OPTIONAL MATCH (message)<-[likes:likeMessage]-(:Person)
       WITH person, message, count(likes) AS likeCount
       OPTIONAL MATCH (message)<-[:replyOf]-(reply:Comment)
       WITH person, message, likeCount, count(reply) AS replyCount
       WITH person, count(message) AS messageCount, sum(likeCount) AS likeCount, sum(replyCount) AS replyCount
       RETURN
         person.id,
         replyCount,
         likeCount,
         messageCount,
         1*messageCount + 2*replyCount + 10*likeCount AS score
       ORDER BY
         score DESC,
         person.id ASC
       LIMIT 100
---- 100
443301|11002|11600|2432|140436
6597070001370|9423|10092|2005|121771
2199023623344|7605|8686|1639|103709
8796093212877|6164|7044|1313|84081
15393163194954|3854|7349|798|81996
17592186149528|4863|6306|1042|73828
2199023622899|6468|5354|1483|67959
15393163286924|3907|5237|835|61019
17592186083813|3932|3760|841|46305
362113|3010|3538|736|42136
21990232592616|1318|3515|303|38089
58138|1888|3377|489|38035
8796093444126|1511|3301|352|36384
8796093029267|2041|3102|487|35589
13194139963212|1123|3069|258|33194
7725|2765|2676|747|33037
24189256003661|2239|2745|475|32403
51934|4353|2244|1031|32177
2199023643031|2477|2545|579|30983
13194139590860|1073|2770|256|30102
17592186338526|1709|2591|381|29709
10995116352475|1610|2496|378|28558
4398046663243|1561|2495|373|28445
4398046615359|1327|2529|342|28286
8796093107981|1016|2593|251|28213
24189256259419|758|2565|179|27345
2199023555122|1814|2294|461|27029
10995116720059|1165|2425|276|26856
8796093319326|1508|2345|356|26822
381982|1365|2236|440|25530
4398046693362|1586|2106|400|24632
19791209357013|997|2149|239|23723
439579|1135|1956|306|22136
6597070051310|1037|1953|267|21871
6597070105217|1875|1740|448|21598
21990232911686|1200|1860|252|21252
6597070197239|1156|1854|318|21170
13194139649245|862|1903|217|20971
19791209342828|451|1978|110|20792
13194139922716|1236|1778|280|20532
2199023657382|1466|1701|438|20380
2199023553480|980|1788|269|20109
17592186151773|811|1812|181|19923
358209|1332|1621|371|19245
2199023478634|1218|1601|340|18786
6597069782768|920|1667|253|18763
232100|1604|1512|418|18746
15393162974896|973|1606|239|18245
353272|1274|1492|318|17786
4398046898596|1428|1460|329|17785
108612|1263|1482|332|17678
15393162912810|1045|1478|248|17118
8796093470229|1138|1455|273|17099
6597069925848|1296|1390|301|16793
6597069911990|664|1521|185|16723
13194139583848|507|1548|144|16638
13194139973772|888|1462|207|16603
384599|1081|1282|301|15283
8796093367018|1060|1271|259|15089
2199023470996|1215|1220|321|14951
8796093149732|1293|1195|308|14844
21990232762532|131|1430|30|14592
4398046750988|1055|1218|272|14562
17592186202161|995|1226|206|14456
8796093225877|873|1245|232|14428
17592186241776|615|1299|145|14365
15393162988350|676|1277|162|14284
228007|836|1232|253|14245
21990232671585|887|1213|207|14111
6597070103694|1532|1028|389|13733
6597069991272|1290|1070|317|13597
8796093156624|315|1253|109|13269
10995116715389|860|1125|193|13163
2199023585451|749|1145|204|13152
6597069774734|1319|1010|331|13069
5448|1579|943|396|12984
10995116613878|1324|990|326|12874
21990232849432|396|1184|93|12725
8796093034062|447|1166|127|12681
4398046888990|455|1164|127|12677
13194139695891|942|1055|226|12660
4398046709698|1023|1032|281|12647
10995116440906|709|1100|192|12610
4398046788830|863|1054|241|12507
6597070188957|1147|990|287|12481
92026|715|1064|272|12342
10995116646764|1383|926|301|12327
10995116748443|509|1105|147|12215
15393162806048|940|1004|229|12149
26388279396224|466|1103|98|12060
10995116291969|734|1035|167|11985
19791209360141|654|1050|151|11959
19791209644229|295|1122|74|11884
2199023344593|1512|844|365|11829
2199023549546|867|987|207|11811
4398046570791|1178|913|308|11794
4398046869964|520|1063|123|11793
8796093084541|960|961|242|11772
21990232636495|271|1116|66|11768
19791209389930|819|981|177|11625
