-NAME BI9
-QUERY MATCH (person:Person)<-[:messageHasCreator]-(post:Post)<-[:replyOf*0..]-(reply:Comment:Post)
       WHERE  post.creationDate >= '2011-10-01'
         AND  post.creationDate <= '2011-10-15'
         AND reply.creationDate >= '2011-10-01'
         AND reply.creationDate <= '2011-10-15'
       RETURN
         person.id,
         person.firstName,
         person.lastName,
         count(DISTINCT post) AS threadCount,
         count(DISTINCT reply) AS messageCount
       ORDER BY
         messageCount DESC,
         person.id ASC
       LIMIT 100
---- 100
301274|Jun|Wang|1948|21320
10995116408323|Lajos|Nagy|1629|17648
8796093391198|Takashi|Mori|1320|14421
2199023432861|Carlos|Gonzalez|1308|14306
2199023276945|Ferenc|Elek|1160|12936
10995116753608|Medji|David|1113|11973
21990233049279|Amit|Singh|1073|11901
10995116692470|Prince|Nakamura|1032|11391
2199023680374|Jack|Smith|1013|11376
21990232955112|Jose|Garcia|992|10876
8796093081836|George|Havenga|945|10454
13194139745618|Vitor|Silva|938|10371
284345|Adrian|Sumac|910|10142
8796093491229|Deepak|Reddy|913|9943
17592186445935|Amir-Ul-Mulk|Khan|893|9920
17592186367193|Mikhail|Ivanov|889|9891
496208|Walter|Becker|923|9661
8796093274033|Jun|Liu|866|9657
10995116774593|Arun|Khan|879|9653
8796093030364|Galina|Dobrunov|893|9618
15393162942623|David|Kibona|861|9441
13194140027207|Jim|Smith|838|9338
8796093349696|Francisco|Garcia|836|9328
8796093038155|Hiroshi|Sato|855|9255
13194139823116|Rahul|Sharma|834|9055
17592186262846|Alan|Smith|828|8982
8796093467366|Fiona|Chen|772|8789
15393162975446|Huynh Quang|Nguyen|808|8620
8796093335227|Faiz|Aman|792|8613
13194139600834|Haile|Barre|764|8276
4398046653860|Asher|Tzukul|764|8266
15393163131704|George|Anderson|794|8184
8796093519342|Rahul|Kapoor|734|8043
19791209536432|Aaron|Aquino|745|8014
10995116613327|Dichen|Shrestha|729|8003
13194139845719|Hồ Mạnh Dũng|Do|731|7847
17592186402881|Fali Sam|Law-Yone|721|7803
6597069833609|Abdullah|Ayhan|695|7652
10995116720961|Ahmed|Althusser|691|7565
13194139930629|Alexei|Berman|673|7540
15393162946307|Marcelo|Santos|644|7233
17592186446645|Shweta|Joshi|647|7170
13194139928271|A.|Rao|636|6947
441839|Yang|Yang|629|6900
15393163270954|Masahiro|Nakamura|644|6817
6597070237672|Amir Abdullah Khan|Malik|641|6816
17592186478358|Vitor|Nascimento|613|6712
10995116324546|Chia-Sheng|Chen|635|6689
17592186138530|Michael|Brown|609|6677
19791209795030|Abdala|Faye|605|6608
2199023332484|Yang|Liu|570|6599
4398046552406|Chuan|Wang|596|6588
248373|Ab|Dam|601|6441
6597069922532|Bich Phuong|Hoang|565|6343
15393163103119|Peng|Xu|562|6319
10995116574940|Tissa|Banda|579|6305
17592186219380|Yang|Li|577|6289
21990232819593|Enrique|Alvarez|571|6275
19791209709232|Abdala|Dia|551|6192
8796093157580|Fernanda|Santos|584|6129
17592186131691|Monja|Mangalaza|545|6094
17592186223884|Paul|Williams|540|5995
13194139540684|James|Wilson|550|5965
13194139537478|Anucha|Charoenpura|528|5894
15393162929091|Chengying|Zhang|551|5875
17592186538020|Jana|Lederer|555|5838
10995116535163|Sarath|Bandara|526|5766
15393163257952|Hideyuki|Yamamoto|546|5658
19791209319257|Lei|Zhang|507|5652
17592186269617|Akira|Sato|488|5457
2199023734411|John|Khan|492|5421
17592186522980|Bonkoj|Charoenpura|475|5371
10995116544476|Asyifa|Anwar|491|5249
13194139951625|Hassan|Forouhar|507|5236
15393162858625|Dieu Hoa|Nguyen|490|5200
10995116586827|David|Smith|462|5181
13194139619293|Mario|Rodriguez|491|5178
4398046678346|Djelaludin|Aman|472|5138
105391|Joseph|Kapoor|447|5114
463748|Andrew|Bomani|475|5046
17592186166139|Asyifa|Gallagher|466|5031
15393162998475|Werner|Muller|455|5027
21990232647850|Carlo|Garcia|450|5023
13194139632125|Alexander|Chaerudin|460|5018
2199023409152|Ramzi|Ben-Tzur|438|5011
2199023320374|Ibrahim Bare|Diori|467|5004
4398046533043|Carl|Persson|441|4967
15393163019548|Yannis|Fampas|449|4950
13194140026975|Alexei|Gusev|453|4935
4398046821584|Javier|Aravena|445|4900
4398046598103|Almira|Barbu|439|4890
8796093110674|Abdullah|Chen|445|4816
19791209316161|Lei|Zhang|432|4794
15393163029064|Karl|Becker|430|4786
15393162878392|Sam|Cheng|415|4775
17592186489160|Erik|Nilsson|459|4759
6597070076627|David|Harris|424|4748
10995116537168|John|Reddy|433|4743
15393162863975|Hamid|Atashin|450|4712
2199023312295|Anh|Nguyen|420|4659
