-SKIP
-DATASET CSV empty

--

-CASE CreateEmbeddingAmazonBedrockTitanV1

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-STATEMENT return create_embedding('Hello World', 'amazon-bedrock', 'amazon.titan-embed-text-v1');
---- 1
[0.324219,0.355469,0.625000,0.200195,1.328125,0.617188,0.114258,-0.000740,0.361328,-0.233398,-0.047607,-0.318359,0.166016,0.593750,-0.269531,0.011108,0.031250,0.349609,-0.898438,0.408203,-0.527344,0.349609,-0.796875,-0.130859,-0.437500,0.225586,0.119141,-0.882812,0.683594,0.064453,-0.882812,1.390625,-0.037598,-0.824219,-0.539062,0.710938,0.542969,-0.761719,-0.017090,0.617188,0.292969,0.240234,-0.152344,-0.207031,0.500000,0.081055,0.106934,-0.921875,1.390625,1.234375,0.064941,1.632812,0.453125,0.496094,-0.351562,-0.164062,0.628906,-0.169922,0.055664,-0.324219,0.146484,0.191406,-1.117188,0.851562,0.027832,0.429688,-0.053467,-0.057617,-0.542969,0.796875,1.054688,0.718750,0.396484,1.390625,-0.441406,0.269531,0.718750,-0.476562,0.542969,0.035645,0.609375,-0.144531,-0.367188,-0.158203,-0.679688,-0.298828,-0.882812,-0.073242,0.000141,-0.326172,-0.439453,-0.472656,1.039062,0.859375,0.273438,0.122559,-1.015625,-0.431641,0.566406,-0.449219,1.312500,0.382812,-0.153320,0.859375,-0.275391,0.921875,-0.175781,1.500000,0.110352,1.000000,-0.078125,-0.250000,0.554688,-0.435547,0.359375,0.259766,0.765625,-0.625000,-0.453125,-0.507812,0.484375,0.069336,0.281250,0.671875,-0.120117,0.871094,0.165039,-0.863281,0.049316,-0.355469,-0.109375,0.014526,1.484375,-0.503906,-0.259766,0.158203,-0.449219,0.119629,-0.201172,-0.441406,-0.671875,-0.886719,0.261719,0.554688,0.523438,-0.001709,-0.851562,0.108887,-0.030273,-0.613281,-0.028564,-0.142578,0.441406,-0.687500,0.234375,0.289062,0.906250,0.216797,-1.070312,-0.131836,0.116211,1.054688,-1.539062,-0.250000,-1.164062,-0.304688,-0.406250,0.275391,-0.455078,-0.742188,0.765625,0.300781,-0.757812,0.687500,-0.052246,0.083496,0.279297,-0.169922,-0.030518,0.687500,0.484375,-0.292969,0.172852,-1.078125,-0.414062,-0.742188,-0.523438,-0.500000,-0.597656,0.839844,-0.271484,0.503906,-0.484375,-0.554688,-0.131836,-0.275391,-0.839844,0.656250,-0.578125,0.061523,-0.018677,0.855469,-0.045898,0.145508,-0.118164,-0.271484,0.253906,-0.147461,-0.230469,0.103027,-0.515625,0.032227,-0.640625,-1.250000,0.953125,-0.300781,-0.207031,0.404297,0.320312,-0.223633,0.554688,-0.337891,0.890625,0.535156,-1.335938,0.703125,0.593750,0.193359,-0.726562,0.511719,-0.439453,0.671875,-0.230469,0.757812,0.382812,0.172852,-0.593750,0.123047,0.024170,0.093750,0.664062,-0.204102,-0.632812,-0.777344,0.105957,-0.050293,-0.059326,0.644531,0.022949,-0.289062,0.796875,0.388672,-0.882812,0.503906,-0.570312,0.117188,-1.296875,0.004883,-0.558594,0.228516,0.425781,-0.037109,0.582031,-0.644531,0.730469,-0.898438,0.054688,0.414062,-0.187500,-1.468750,0.000096,0.086426,0.589844,-0.439453,-0.742188,0.106934,-1.406250,-0.046875,0.048584,-0.171875,1.109375,-0.214844,1.414062,-0.238281,-0.367188,-1.968750,-0.107422,0.796875,0.640625,0.287109,-0.550781,-0.137695,-0.585938,0.851562,0.742188,-0.036621,0.232422,0.408203,-0.476562,0.245117,-0.390625,0.324219,0.671875,-0.412109,-0.107910,-0.157227,0.546875,0.100586,-0.679688,0.957031,-0.523438,0.234375,-0.703125,0.153320,0.582031,-0.159180,-0.214844,0.468750,-0.531250,-0.116211,-0.351562,-1.195312,0.032715,-0.386719,-0.031494,-0.240234,-0.496094,-0.562500,0.055908,0.142578,0.013916,-0.451172,0.652344,0.439453,0.503906,-0.953125,-0.063477,0.898438,0.445312,-0.941406,-0.289062,-0.099609,1.085938,-0.742188,-0.017456,-0.343750,0.152344,0.570312,-0.570312,0.275391,0.355469,-0.503906,-0.570312,-0.343750,0.757812,-1.437500,-0.251953,-0.875000,-0.609375,-0.189453,0.453125,-0.080078,-0.312500,-0.363281,-0.453125,0.108398,-0.539062,-1.593750,0.386719,1.031250,-0.211914,2.093750,0.142578,0.402344,-0.371094,1.093750,0.073730,1.007812,0.072266,-0.757812,1.140625,-1.593750,-0.507812,-0.277344,-0.976562,0.363281,-0.582031,-0.679688,-0.500000,-0.324219,0.043213,0.410156,-0.029785,-0.867188,0.153320,0.142578,0.957031,0.261719,-1.546875,0.199219,0.120605,0.472656,1.437500,-1.804688,0.500000,0.843750,-0.308594,-0.750000,0.582031,-0.511719,-0.498047,0.273438,0.111816,1.250000,0.251953,-1.367188,0.316406,0.042969,-0.968750,-1.125000,-0.476562,-0.063965,0.453125,-0.144531,0.523438,0.234375,0.457031,-0.695312,-0.710938,0.233398,0.046143,0.104492,0.371094,0.765625,0.196289,0.095215,-0.148438,0.625000,-0.232422,-0.335938,0.875000,-0.112793,-0.007324,-0.507812,-0.875000,-0.277344,-1.203125,-0.492188,-0.140625,0.464844,0.460938,-0.062256,-0.367188,-0.664062,0.200195,-0.240234,0.244141,0.585938,0.863281,0.006592,0.574219,-0.221680,0.406250,0.103027,-0.542969,-0.220703,1.703125,0.158203,-0.170898,0.134766,-1.335938,-0.210938,0.285156,0.453125,-0.671875,0.055664,-0.417969,0.273438,-0.040527,-0.835938,0.257812,0.718750,-0.184570,-0.648438,0.675781,-0.138672,-0.011597,-0.261719,-0.671875,-0.632812,0.660156,1.515625,-0.843750,-0.917969,-0.229492,0.044922,-0.000401,0.006836,0.339844,0.671875,0.146484,-0.096191,-0.287109,0.105469,-0.453125,0.488281,-1.015625,0.589844,-0.201172,-0.531250,0.835938,0.742188,-1.070312,0.804688,-0.224609,0.898438,0.734375,-0.025269,-0.964844,-0.296875,0.097656,0.460938,-0.275391,-0.277344,-0.640625,1.460938,-0.069336,-0.087891,-0.843750,-0.130859,-0.094238,0.275391,-0.527344,-0.209961,0.835938,0.593750,-0.498047,0.153320,-1.679688,-0.207031,0.679688,-1.203125,-1.398438,0.613281,-0.734375,-0.660156,-0.490234,-0.898438,-1.132812,0.437500,0.781250,-0.480469,-0.373047,0.009766,0.314453,1.203125,-1.078125,0.710938,0.132812,-0.957031,0.244141,-0.128906,-0.075195,-1.109375,-0.205078,-0.178711,-0.181641,0.230469,-0.921875,0.028809,-0.632812,-0.101562,0.757812,0.468750,0.835938,1.250000,0.632812,-0.976562,0.609375,0.478516,0.298828,-0.044434,0.371094,-0.296875,-0.417969,0.875000,0.018066,-0.092773,0.081055,-0.574219,-0.376953,-0.243164,0.531250,-0.289062,0.425781,0.380859,0.367188,-1.531250,-0.472656,-0.359375,0.531250,0.208984,0.562500,0.074219,-0.074219,0.183594,-0.550781,0.343750,-0.316406,0.298828,-0.628906,0.118652,0.320312,0.500000,-1.468750,0.205078,0.047363,1.054688,-0.800781,-0.339844,0.057373,-0.316406,-1.421875,-0.031006,0.281250,0.164062,-0.361328,-1.468750,0.722656,-0.875000,-0.917969,1.015625,-0.269531,0.734375,0.523438,1.234375,-0.609375,0.437500,0.226562,-0.158203,-0.088867,0.310547,0.080566,-0.558594,1.039062,0.527344,0.341797,1.445312,-0.496094,0.386719,0.000000,0.496094,0.867188,-0.347656,-0.157227,-0.433594,0.159180,0.718750,-1.117188,-0.132812,-0.511719,0.722656,0.390625,0.482422,1.406250,0.224609,0.107910,-0.449219,-0.119141,0.214844,-0.187500,-2.562500,0.867188,0.148438,-0.648438,-0.625000,0.304688,-0.173828,-1.234375,-0.671875,0.882812,-0.734375,-0.189453,-0.034668,-0.378906,1.609375,0.051514,-0.343750,-0.617188,0.527344,-0.417969,1.070312,0.726562,0.625000,0.021362,0.118652,0.125977,0.408203,0.138672,1.164062,-1.015625,0.703125,0.174805,-0.302734,-0.355469,1.156250,-0.683594,-0.061523,0.738281,0.178711,0.090820,0.765625,-0.173828,-0.394531,0.494141,0.718750,-0.382812,0.656250,0.433594,0.945312,0.142578,-0.726562,-0.406250,0.084961,0.968750,-0.031494,0.063965,0.558594,0.191406,-0.032227,0.812500,0.812500,0.365234,0.925781,0.671875,-0.063477,0.158203,-0.359375,-0.656250,-0.812500,-0.875000,0.851562,-0.695312,-0.527344,-0.137695,0.164062,-1.203125,0.320312,0.753906,0.660156,-0.023193,0.287109,0.621094,0.296875,-0.546875,-0.859375,0.128906,0.644531,0.174805,0.828125,-0.554688,0.859375,0.441406,-0.265625,-0.324219,-0.236328,-0.531250,-0.129883,-0.103027,0.367188,-0.404297,0.186523,-0.400391,0.636719,-0.175781,0.324219,1.054688,0.161133,0.384766,-0.146484,-0.125000,0.322266,0.800781,0.251953,-1.781250,1.132812,0.357422,0.488281,-0.781250,0.343750,0.146484,-0.441406,0.126953,-0.000244,0.414062,0.906250,-0.480469,0.335938,0.648438,1.054688,-0.166016,0.049561,-0.137695,-0.012695,-0.279297,0.076172,0.406250,0.773438,-0.361328,-0.063477,0.098633,-0.500000,-0.628906,-0.394531,-0.585938,-0.687500,0.184570,0.082520,0.578125,-0.060059,-0.259766,1.968750,0.300781,-0.209961,-0.138672,0.001518,0.310547,0.026611,-1.468750,-0.135742,0.069336,0.531250,0.382812,-0.984375,0.188477,-0.480469,-0.921875,-0.726562,1.250000,0.835938,0.578125,-0.062988,-0.464844,-0.095215,0.875000,0.419922,0.084961,0.503906,0.318359,-0.175781,1.203125,-0.488281,-0.431641,-0.308594,0.601562,-0.126953,-0.136719,-0.640625,-0.070312,-0.242188,0.910156,0.059082,-0.742188,0.460938,0.024658,0.244141,-0.110352,-0.394531,0.169922,0.273438,0.183594,-0.073242,-0.511719,0.441406,1.476562,0.375000,0.433594,-0.292969,0.625000,0.092773,0.221680,-1.015625,0.453125,-0.480469,0.083008,1.359375,1.890625,0.173828,-0.140625,0.457031,0.726562,0.585938,0.416016,0.570312,-0.339844,-0.085449,0.263672,-0.378906,-0.656250,0.213867,-1.031250,-0.185547,-0.609375,-0.126953,0.937500,-0.143555,-0.057373,0.310547,-0.164062,0.273438,-0.423828,-0.476562,0.224609,0.917969,0.515625,1.140625,1.234375,-0.972656,-1.093750,-1.921875,-0.002197,-0.417969,0.246094,-0.222656,-0.171875,0.094727,-0.337891,0.251953,0.625000,-0.968750,-0.523438,0.488281,-0.320312,0.414062,-0.832031,0.492188,0.765625,0.455078,0.294922,0.300781,-1.281250,-0.000599,1.156250,0.031738,0.248047,-0.812500,-1.445312,-0.464844,-0.147461,0.937500,0.029907,-0.156250,-0.503906,0.001167,-0.539062,-1.281250,0.244141,0.048584,0.013184,-0.142578,-0.194336,-0.373047,0.261719,-0.425781,-0.617188,0.233398,-1.617188,-0.097168,-1.375000,0.068848,-0.710938,0.320312,0.261719,-0.484375,-0.656250,-0.210938,0.628906,0.204102,0.351562,0.281250,-0.394531,0.225586,0.041992,0.188477,0.589844,-0.304688,-0.271484,0.157227,-0.016602,-0.777344,-0.218750,-0.217773,-0.417969,0.386719,0.210938,-0.218750,-1.078125,0.017700,0.773438,-1.781250,-0.026733,0.216797,-0.300781,-0.417969,-0.609375,-0.269531,0.153320,0.238281,-0.111328,-1.078125,-0.734375,-0.500000,-0.718750,0.496094,0.039062,0.027344,0.341797,0.859375,0.476562,0.859375,-0.632812,-0.503906,0.457031,-0.218750,0.182617,-0.734375,1.093750,1.179688,-0.882812,-0.117676,-0.243164,-0.212891,0.453125,-0.283203,0.234375,-0.617188,0.679688,0.322266,-0.225586,0.835938,-0.464844,-0.081055,0.053223,0.096680,0.345703,-0.294922,-0.066406,-0.144531,0.004791,1.007812,0.046387,-0.742188,0.242188,0.351562,-0.632812,-0.330078,-0.542969,0.523438,0.449219,-0.437500,0.314453,0.332031,0.468750,-0.052246,0.148438,0.511719,-0.359375,-0.384766,1.062500,-0.843750,-0.875000,-0.496094,0.179688,0.498047,-0.464844,-0.218750,0.267578,-0.496094,0.445312,1.000000,0.110840,-0.812500,-0.953125,-0.613281,-0.285156,-0.404297,-0.046387,-0.302734,-0.617188,-0.466797,-0.392578,0.462891,-0.320312,0.593750,-0.476562,0.640625,0.929688,0.984375,-0.804688,-0.554688,-0.531250,0.699219,-0.410156,-1.632812,0.757812,-0.072266,0.146484,0.726562,0.498047,-0.458984,0.277344,-0.015381,0.671875,0.449219,0.400391,1.171875,-0.656250,-1.343750,-1.085938,0.074707,0.207031,-0.519531,-1.031250,-0.182617,-0.808594,0.035156,0.667969,-0.149414,-0.392578,0.773438,-0.503906,0.398438,-0.621094,1.031250,0.202148,0.353516,0.843750,1.000000,-0.335938,-1.593750,-0.687500,0.320312,1.773438,0.162109,-0.291016,1.851562,-0.707031,-0.024658,0.500000,0.211914,-0.435547,-0.265625,0.128906,-0.859375,-0.412109,-0.339844,0.492188,-0.182617,1.117188,-0.242188,0.322266,0.890625,0.281250,0.111328,-0.679688,0.081055,0.147461,0.123047,0.095703,-1.156250,0.145508,-1.039062,-1.492188,0.292969,-1.109375,-0.152344,0.632812,0.742188,0.138672,-0.742188,-0.011230,0.675781,0.103027,0.636719,0.367188,-0.371094,1.203125,0.722656,-0.671875,-0.185547,0.208008,-0.148438,-0.259766,0.468750,0.714844,-0.531250,0.476562,-0.367188,-0.094238,-0.380859,-1.484375,-0.470703,1.031250,-1.398438,0.166016,-0.824219,-0.851562,-0.141602,1.640625,0.146484,0.289062,0.050293,0.030762,0.632812,0.205078,-0.449219,0.562500,-0.333984,-2.656250,-0.153320,0.060791,-0.644531,-0.269531,-0.185547,-0.464844,0.072266,0.204102,-0.632812,-0.140625,-0.617188,1.015625,-0.083496,0.112305,-0.089844,0.075195,0.644531,-0.042236,-0.500000,-1.734375,-0.279297,-0.429688,-0.898438,1.156250,0.056885,-0.410156,-0.259766,-0.116211,0.166016,0.083496,-0.421875,-0.562500,0.020020,0.652344,-0.155273,-0.080566,0.660156,-2.281250,0.457031,0.179688,0.255859,0.609375,0.071289,0.357422,0.753906,0.149414,-0.699219,-0.103516,0.203125,-0.300781,-0.296875,-0.777344,-0.122070,-0.710938,0.144531,-0.205078,-0.187500,-0.200195,-0.511719,-0.945312,-0.112305,-0.359375,0.449219,-0.190430,0.695312,-0.211914,0.585938,0.824219,0.131836,0.240234,0.017822,0.851562,-0.804688,-0.081543,-0.554688,0.102539,-0.109863,1.218750,0.190430,0.582031,-0.320312,-0.609375,0.008301,-0.820312,-0.183594,-1.093750,-0.800781,0.226562,0.240234,0.617188,-0.132812,0.071777,0.250000,0.271484,1.632812,-0.257812,0.722656,0.582031,-0.597656,-0.765625,0.500000,0.302734,-0.710938,0.186523,-0.151367,-0.058594,-0.223633,0.162109,-0.033447,-1.187500,-0.835938,-1.234375,0.349609,-0.081543,-0.186523,-0.058838,-0.341797,1.929688,-0.539062,0.068848,-0.193359,-0.251953,-0.207031,1.453125,-0.238281,0.578125,-0.074219,0.287109,0.812500,0.359375,0.198242,0.343750,-0.193359,-0.328125,-0.539062,-0.312500,0.065430,0.248047,0.083984,-0.632812,0.812500,-0.285156,0.125977,-0.306641,0.628906,1.250000,0.081055,-0.162109,0.087891,0.820312,0.625000,0.734375,-0.660156,0.714844,0.156250,-0.318359,-0.093750,-1.453125,0.154297,0.112305,-0.121094,-0.057129,0.945312,0.414062,-1.421875,0.585938,0.494141,-0.734375,-0.466797,0.718750,-0.859375,-1.453125,0.175781,-0.234375,1.015625,0.898438,0.613281,-1.000000,0.126953,0.308594,0.110352,0.640625,-0.574219,-0.507812,0.519531,-0.542969,0.695312,0.765625,0.703125,-0.546875,-0.435547,-0.855469,0.322266,0.236328,-0.929688,-0.554688,-1.109375,-0.285156,-0.104980,1.453125,0.384766,0.515625,0.500000,-0.041992,-0.359375,-0.585938,0.439453,0.011047,-0.166016,-0.065918,-0.157227,0.839844,-0.394531,-0.402344,0.527344,-0.296875,-0.158203,1.570312,-0.601562,0.160156,0.121094,-0.343750,-0.247070,-0.024414,0.820312,0.216797,-0.335938,0.102051,0.531250,-0.169922,0.111816,0.226562,-0.781250,0.225586,-0.632812,-0.151367,0.013184,0.244141,-0.271484,0.376953,1.109375,0.773438,-0.470703,1.437500,0.375000,1.179688,-1.203125,0.500000,1.343750,-0.233398,-0.002563,-0.585938,0.144531,-0.671875,0.804688,0.898438,1.070312,0.875000,-0.710938,-0.031250,-0.519531,-0.032227,0.328125,-0.484375,-0.326172,0.024414,0.328125,0.040039,-0.410156,-1.281250,0.277344,-0.024414,-0.291016,0.968750,1.921875,1.085938,-0.437500,0.138672,-0.177734,-0.210938,-0.906250,-0.049805,0.558594,-0.257812,-0.208008,-0.249023,-0.402344,1.437500,0.656250,-0.261719,0.181641,0.812500,-0.789062,0.001953,-1.046875,0.160156,-0.921875,0.343750,1.250000,0.613281,-0.652344,-1.109375,0.539062,-0.061523,-0.190430,0.375000,-0.812500,-0.875000,1.554688,-0.562500,-0.036133,-0.069336,0.402344,-0.593750,0.679688,-1.375000,0.304688]

-CASE SetEmbedding

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-STATEMENT CREATE NODE TABLE Book(id SERIAL PRIMARY KEY, title STRING, title_embedding FLOAT[1536], published_year INT64);
---- ok

-STATEMENT CREATE (b:Book {title: 'The Quantum World', published_year: 2004});
---- ok

-STATEMENT CREATE (b:Book {title: 'Chronicles of the Universe', published_year: 2022});
---- ok

-STATEMENT CREATE (b:Book {title: 'Learning Machines', published_year: 2019});
---- ok

-STATEMENT CREATE (b:Book {title: 'Echoes of the Past', published_year: 2010});
---- ok

-STATEMENT CREATE (b:Book {title: 'The Dragon Call', published_year: 2015});
---- ok

-STATEMENT MATCH (b:Book) WITH b, create_embedding(b.title, 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS emb SET b.title_embedding = emb;
---- error
Binder exception: Data type of expression emb should not be modified.

-STATEMENT MATCH (b:Book) RETURN b;
---- 5
{_ID: 0:0, _LABEL: Book, id: 0, title: The Quantum World, published_year: 2004}
{_ID: 0:1, _LABEL: Book, id: 1, title: Chronicles of the Universe, published_year: 2022}
{_ID: 0:2, _LABEL: Book, id: 2, title: Learning Machines, published_year: 2019}
{_ID: 0:3, _LABEL: Book, id: 3, title: Echoes of the Past, published_year: 2010}
{_ID: 0:4, _LABEL: Book, id: 4, title: The Dragon Call, published_year: 2015}

-CASE SemanticDistanceCheck

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-LOG Similar Text 1
-STATEMENT WITH create_embedding('Who is the author of 1984?', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t1, create_embedding('Who wrote the novel 1984?', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t2 RETURN array_cosine_similarity(t1, t2);
---- 1
0.919443

-LOG Similar Text 2
-STATEMENT WITH create_embedding('What is the capital of France?', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t1, create_embedding('Which city is the capital of France?', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t2 RETURN array_cosine_similarity(t1, t2);
---- 1
0.966729

-LOG Dissimilar Text 1
-STATEMENT WITH create_embedding('How to train a dog', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t1, create_embedding('What is the capital of France', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t2 RETURN array_cosine_similarity(t1, t2);
---- 1
0.095192

-LOG Dissimilar Text 2
-STATEMENT WITH create_embedding('How do Unix file permissions work?', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t1, create_embedding('History of the Roman Empire', 'amazon-bedrock', 'amazon.titan-embed-text-v1') AS t2 RETURN array_cosine_similarity(t1, t2);
---- 1
0.068871


