-SKIP
-DATASET CSV llm/embeddings/amazonbedrock/

--

-CASE CreateEmbeddingAmazonBedrockTitanV1

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-STATEMENT MATCH (e:embedding) RETURN array_cosine_similarity(e.embedding, create_embedding(e.text, 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1')) >= 0.9 AS similarity;
---- 6
True
True
True
True
True
True

-CASE SemanticDistanceCheck

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-LOG Similar Text 1
-STATEMENT WITH create_embedding('Who is the author of 1984?', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t1, create_embedding('Who wrote the novel 1984?', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
True

-LOG Similar Text 2
-STATEMENT WITH create_embedding('What is the capital of France?', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t1, create_embedding('Which city is the capital of France?', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
True

-LOG Dissimilar Text 1
-STATEMENT WITH create_embedding('How to train a dog', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t1, create_embedding('What is the capital of France', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
False

-LOG Dissimilar Text 2
-STATEMENT WITH create_embedding('How do Unix file permissions work?', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t1, create_embedding('History of the Roman Empire', 'amazon-bedrock', 'amazon.titan-embed-text-v1', 'us-east-1') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
False
