-DATASET CSV llm/embeddings/voyageai

--

-CASE CreateEmbeddingVoyageAILargeModel

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-STATEMENT MATCH (e:embedding) RETURN array_cosine_similarity(e.embedding, create_embedding(e.text, 'voyage-ai', 'voyage-3-large')) >= 0.9 AS similarity;
---- 4
True
True
True
True

-CASE TryConfiguration

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-STATEMENT return create_embedding('Hello World', 'voyage-ai', 'voyage-3-large', 512);
---- ok

-STATEMENT return create_embedding('Hello World', 'voyage-ai', 'voyage-3-large', 256);
---- ok

-CASE SemanticDistanceCheck

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/llm/build/libllm.kuzu_extension"
---- ok

-LOG Similar Text 1
-STATEMENT WITH create_embedding('Who is the author of 1984?', 'voyage-ai', 'voyage-3-large') AS t1, create_embedding('Who wrote the novel 1984?', 'voyage-ai', 'voyage-3-large') AS t2 RETURN array_cosine_similarity(t1, t2) >- 0.8;
---- 1
True


-LOG Similar Text 2
-STATEMENT WITH create_embedding('What is the capital of France?', 'voyage-ai', 'voyage-3-large') AS t1, create_embedding('Which city is the capital of France?', 'voyage-ai', 'voyage-3-large') AS t2 RETURN array_cosine_similarity(t1, t2) >- 0.8;
---- 1
True


-LOG Dissimilar Text 1
-STATEMENT WITH create_embedding('How to train a dog', 'voyage-ai', 'voyage-3-large') AS t1, create_embedding('What is the capital of France', 'voyage-ai', 'voyage-3-large') AS t2 RETURN array_cosine_similarity(t1, t2) >- 0.8;
---- 1
False


-LOG Dissimilar Text 2
-STATEMENT WITH create_embedding('How do Unix file permissions work?', 'voyage-ai', 'voyage-3-large') AS t1, create_embedding('History of the Roman Empire', 'voyage-ai', 'voyage-3-large') AS t2 RETURN array_cosine_similarity(t1, t2) >- 0.8;
---- 1
False
