-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE AllShortestPath

-NAME MultiLabel1
-QUERY MATCH (a:person)-[e:knows|:meets|:marries* ALL SHORTEST 1..5]->(b:person) WHERE a.fName='Alice' RETURN b.fName, length(e)
---- 9
Bob|1
Bob|1
Bob|1
Carol|1
Dan|1
Elizabeth|2
Farooq|3
Farooq|3
Greg|3

-NAME MultiLabel2
-QUERY MATCH (a:person)-[e* ALL SHORTEST 1..5]->(b:organisation) WHERE a.fName='Bob' RETURN b.ID, length(e)
---- 4
1|1
4|2
6|2
6|2
