-DATASET CSV tinysnb

--

-CASE ListReduce
-STATEMENT RETURN LIST_REDUCE([5,28,92], (x, y) -> x + y)
---- 1
125
-STATEMENT RETURN LIST_REDUCE(['Kuzu ', 'is ', 'awesome:', 'long long string'], (x, y) -> upper(x) + upper(y))
---- 1
KUZU IS AWESOME:LONG LONG STRING
-STATEMENT MATCH (a:person) RETURN LIST_REDUCE(a.workedHours, (x, y) -> x - y)
---- 8
5
4
-1
-8
2
-19
1
-38
-STATEMENT MATCH (a:person) RETURN LIST_REDUCE([], (x, y) -> x - y)
---- error
Runtime exception: Cannot execute list_reduce on an empty list.
-STATEMENT RETURN LIST_REDUCE([null, 52, 223], (x, y) -> x + y)
---- 1

