-DATASET CSV empty

--

-CASE ExternalDuckDBTable

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/duckdb/build/libduckdb.kuzu_extension"
---- ok
-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/dataset/databases/duckdb_database/tinysnb.db' as tinysnb (dbtype duckdb, skip_unsupported_table = true);
---- 1
Attached database successfully.
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE EXTERNAL NODE TABLE duck_person AS tinysnb.person (PRIMARY KEY (ID));
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 1
duck_person|EXTERNAL_NODE|local(kuzu)|
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT ALTER TABLE duck_person RENAME TO d_person;
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 1
d_person|EXTERNAL_NODE|local(kuzu)|
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT DROP TABLE d_person;
---- ok
-STATEMENT COMMIT;
---- ok
-RELOADDB
-STATEMENT CALL SHOW_TABLES() RETURN *;
---- 0
-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/duckdb/build/libduckdb.kuzu_extension"
---- ok
-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/dataset/databases/duckdb_database/tinysnb.db' as tinysnb (dbtype duckdb, skip_unsupported_table = true);
---- 1
Attached database successfully.
-STATEMENT CREATE EXTERNAL NODE TABLE duck_person AS tinysnb.person (PRIMARY KEY (ID));
---- 1
Table duck_person has been created.
-STATEMENT COPY duck_person FROM (LOAD FROM tinysnb.person RETURN ID);
---- ok
-STATEMENT MATCH (a:duck_person) RETURN a.ID, a.fName;
---- 8
0|Alice
2|Bob
3|Carol
5|Dan
7|Elizabeth
8|Farooq
9|Greg
10|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
