-GROUP EmptyCreateRelTest
-DATASET CSV empty
--

-CASE CreateOneToOneRel
-STATEMENT CREATE NODE TABLE N1(ID INT64, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE NODE TABLE N2(ID INT64, PRIMARY KEY(ID));
---- ok
-STATEMENT CREATE REL TABLE Rel1(FROM N1 TO N2, ONE_ONE);
---- ok
-STATEMENT CREATE (:N1 {ID: 10}), (:N1 {ID: 1}), (:N2 {ID: 12}), (:N2 {ID: 8})
---- ok
-STATEMENT MATCH (n:N1) RETURN n.ID
---- 2
10
1
-STATEMENT MATCH (n:N2) RETURN n.ID
---- 2
12
8
