-DATASET CSV tinysnb
--

-CASE DeleteFromKnows1
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=0 RETURN COUNT(*)
---- 1
3
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=0 AND b.ID=3 DELETE e
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=0 AND b.ID=3 RETURN COUNT(*)
---- 1
0
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=0 RETURN COUNT(*)
---- 1
2
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=2 AND b.ID = 0 DELETE e WITH e MATCH (a:person)-[e2:knows]->(b:person) RETURN e.date, a.fName, e2.date, b.fName;
---- 12
2021-06-30|Alice|2021-06-30|Bob
2021-06-30|Alice|2021-06-30|Dan
2021-06-30|Bob|1950-05-14|Carol
2021-06-30|Bob|1950-05-14|Dan
2021-06-30|Carol|1950-05-14|Bob
2021-06-30|Carol|2000-01-01|Dan
2021-06-30|Carol|2021-06-30|Alice
2021-06-30|Dan|1950-05-14|Bob
2021-06-30|Dan|2000-01-01|Carol
2021-06-30|Dan|2021-06-30|Alice
2021-06-30|Elizabeth|1905-12-12|Farooq
2021-06-30|Elizabeth|1905-12-12|Greg

-CASE DeleteFromKnows2
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=0 AND b.ID>=3 DELETE e
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=0 RETURN COUNT(*)
---- 1
1

-CASE DeleteRelMultiLabel1
-STATEMENT MATCH (a:person)-[e]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
5
-STATEMENT MATCH (a:person)-[e]->(b:person) WHERE a.ID = 0 DELETE e
---- ok
-STATEMENT MATCH (a:person)-[e]->(b:person) WHERE a.ID = 0 RETURN COUNT(*)
---- 1
0


-CASE DeleteRelMultiLabel2
-STATEMENT MATCH (a)-[e]->(b) WHERE a.ID = 0 RETURN a.ID, b.ID, id(e)
---- 6
0|1|4:0
0|2|3:0
0|2|6:0
0|2|7:0
0|3|3:1
0|5|3:2
-STATEMENT MATCH (a)-[e]->(b) WHERE a.ID = 0 AND b.ID = 2 DELETE e
---- ok
-STATEMENT MATCH (a)-[e]->(b) WHERE a.ID = 0 RETURN a.ID, b.ID, id(e)
---- 3
0|1|4:0
0|3|3:1
0|5|3:2


-STATEMENT MATCH (a)-[e]-(b) WHERE a.ID = 0 AND b.ID = 2 DELETE e
---- error
Binder exception: Delete undirected rel is not supported.


-CASE RedundantRelDeletions
-STATEMENT MATCH (a:person)-[:knows]->(b:person)-[e:knows]->(c:person) DELETE e
---- ok
-STATEMENT MATCH (:person)-[:knows]->(:person) RETURN COUNT(*)
---- 1
2

-CASE OptionalMatchDelete
-STATEMENT OPTIONAL MATCH (a:person) WHERE a.ID > 5 OPTIONAL MATCH (a)-[e:knows]->(b) DELETE e
---- ok
-STATEMENT MATCH (:person)-[:knows]->(:person) RETURN COUNT(*)
---- 1
12
-STATEMENT MATCH (a)<-[e]-(b) WHERE a.ID=1 RETURN COUNT(*)
---- 1
3
-STATEMENT OPTIONAL MATCH (a) WHERE a.ID =1 OPTIONAL MATCH (a)<-[e]-(b) DELETE e
---- ok
-STATEMENT MATCH (a)<-[e]-(b) WHERE a.ID=1 RETURN COUNT(*)
---- 1
0

-CASE DetachDeleteRelException
-STATEMENT MATCH (a:person)-[e]->(b:person) DETACH DELETE e
---- error
Binder exception: Detach delete on rel tables is not supported.

-CASE MixedDeleteInsertAndSetOneToOneRel
-STATEMENT BEGIN TRANSACTION
---- ok
-STATEMENT MATCH (a:person)-[e:marries]->(b:person) WHERE a.ID = 3 AND b.ID = 5 DELETE e
---- ok
-STATEMENT MATCH (a:person)-[e:marries]->(b:person) WHERE a.ID = 3 AND b.ID = 5 RETURN COUNT(*)
---- 1
0
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 3 AND b.ID =10 CREATE (a)-[:marries]->(b)
---- ok
-STATEMENT MATCH (a:person)-[e:marries]->(b:person) WHERE a.ID = 3 AND b.ID =10 RETURN COUNT(*)
---- 1
1
-STATEMENT MATCH (a:person)-[e:marries]->(b:person) WHERE a.ID = 3 AND b.ID =10 SET e.note='new one';
---- ok
-STATEMENT MATCH (a:person)-[e:marries]->(b:person) WHERE a.ID = 3 AND b.ID =10 RETURN e.note
---- 1
new one
-STATEMENT COMMIT
---- ok
-STATEMENT MATCH (a:person)-[e:marries]->(b:person) WHERE a.ID = 3 AND b.ID =10 RETURN e.note
---- 1
new one

-CASE DeleteDuplicateNodes
-STATEMENT MATCH (a:person)-[e:meets|knows|marries*0..5]->(b:person) DETACH DELETE a,b;
---- ok
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) RETURN COUNT(*)
---- 1
0
