-DATASET CSV empty
-TEST_FWD_ONLY_REL
--

-CASE CreateRelBatch1
-STATEMENT CREATE NODE TABLE Person(id INT64, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE REL TABLE knows(FROM Person TO Person);
---- ok
-STATEMENT UNWIND range(0, 10000) AS i
           CREATE (n:Person {id: i});
---- ok
-STATEMENT MATCH (p:Person) RETURN COUNT(*)
---- 1
10001
-STATEMENT UNWIND range(0, 9999) AS i
           MATCH (p1:Person {id: i})
           MATCH (p2:Person {id: i + 1})
           CREATE (p1)-[:knows]->(p2);
---- ok
-STATEMENT MATCH (p1:Person)-[r:knows]->(p2:Person) RETURN COUNT(*)
---- 1
10000

-CASE CreateRelBatch2
-STATEMENT CREATE NODE TABLE Person(id SERIAL, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE REL TABLE knows(FROM Person TO Person);
---- ok
-STATEMENT UNWIND range(0, 200000) AS i
           CREATE (n:Person);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person {id: 180000}), (p2:Person {id: 18}) CREATE (p1)-[k]->(p2);
---- ok
-STATEMENT MATCH (p1:Person)-[r:knows]->(p2:Person) RETURN COUNT(*)
---- 1
10

-CASE CreateRelBatchAndDelete
-STATEMENT CREATE NODE TABLE Person(id INT64, PRIMARY KEY(id));
---- ok
-STATEMENT CREATE REL TABLE knows(FROM Person TO Person);
---- ok
-STATEMENT UNWIND range(0, 9999) AS i
           CREATE (n:Person {id: i});
---- ok
-STATEMENT MATCH (p:Person) RETURN COUNT(*)
---- 1
10000
-STATEMENT UNWIND range(0, 2000) AS i
           MATCH (p1:Person {id: 0})
           MATCH (p2:Person {id: i})
           CREATE (p1)-[:knows]->(p2);
---- ok
-STATEMENT UNWIND range(0, 2000) AS i
           MATCH (p1:Person {id: 1})
           MATCH (p2:Person {id: i})
           CREATE (p1)-[:knows]->(p2);
---- ok
-STATEMENT UNWIND range(0, 2000) AS i
           MATCH (p1:Person {id: 2})
           MATCH (p2:Person {id: i})
           CREATE (p1)-[:knows]->(p2);
---- ok
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT UNWIND range(0, 2000) AS i
           MATCH (p1:Person {id: 3})
           MATCH (p2:Person {id: i})
           CREATE (p1)-[:knows]->(p2);
---- ok
-STATEMENT ROLLBACK;
---- ok
-STATEMENT MATCH (p1:Person)-[r:knows]->(p2:Person) RETURN COUNT(*)
---- 1
6003
-STATEMENT MATCH (p1:Person {id: 0})-[r:knows]->(p2:Person) DELETE r;
---- ok
-STATEMENT MATCH (p1:Person)-[r:knows]->(p2:Person) WHERE p1.id <= 2 RETURN COUNT(*);
---- 1
4002
