-DATASET CSV tinysnb

--

-CASE BasicAlgorithm

-STATEMENT PROJECT GRAPH PK (person {age}, knows) CALL variable_length_path(PK, 1, 1) RETURN *;
---- error
Parser exception: Filtering or projecting properties in graph projection is not supported.
-STATEMENT PROJECT GRAPH X (person, knows) CALL variable_length_path(PK, 1, 1) RETURN *;
---- error
Binder exception: Cannot find graph PK.
-STATEMENT PROJECT GRAPH PK (person, knows, studyAt) CALL variable_length_path(PK, 1, 1) RETURN *;
---- error
Binder exception: A subgraph must have exactly one node table and one relationship table.
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID > 5 CALL variable_length_path(PK, a, 1, 1) RETURN a.fName, dst, length, num_path;
---- 2
Elizabeth|0:5|1|1
Elizabeth|0:6|1|1
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL variable_length_path(PK, a, 2, 2) RETURN a.fName, dst, length, num_path;
---- 4
Alice|0:0|2|3
Alice|0:1|2|2
Alice|0:2|2|2
Alice|0:3|2|2
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL shortest_path(PK, a, 2) RETURN a.fName, dst, length;
---- 4
Alice|0:0|0
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
-STATEMENT PROJECT GRAPH PK (person, knows) CALL weakly_connected_component(PK) RETURN *;
---- 8
0:0|0
0:1|0
0:2|0
0:3|0
0:4|1
0:5|1
0:6|1
0:7|2
-STATEMENT PROJECT GRAPH PK (person, knows) CALL page_rank(PK) RETURN *;
---- 8
0:0|0.125000
0:1|0.125000
0:2|0.125000
0:3|0.125000
0:4|0.022734
0:5|0.018750
0:6|0.018750
0:7|0.018750
