-DATASET CSV tinysnb

--

-CASE BasicAlgorithm
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL nT1S_parallel_shortest_path(PK, a, 2) RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL nT1S_parallel_shortest_path(PK, a, 2) RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL _1T1S_parallel_shortest_path(PK, a, 2) RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL _1T1S_parallel_shortest_path(PK, a, 2) RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
