-DATASET CSV tinysnb

--

-CASE BasicAlgorithm


-STATEMENT PROJECT GRAPH PK (person {age}, knows) CALL variable_length_path(PK, 1, 1) RETURN *;
---- error
Parser exception: Filtering or projecting properties in graph projection is not supported.
-STATEMENT PROJECT GRAPH X (person, knows) CALL variable_length_path(PK, 1, 1) RETURN *;
---- error
Binder exception: Cannot find graph PK.
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID > 5
           CALL variable_length_path(PK, a, 1, 1, true)
           RETURN a.fName, _node.fName, length, num_path;
---- 2
Elizabeth|Farooq|1|1
Elizabeth|Greg|1|1
-STATEMENT PROJECT GRAPH PK (person, knows, studyAt, organisation)
           MATCH (a) WHERE a.ID = 0
           CALL variable_length_path(PK, a, 1, 1, true)
           RETURN a.fName, _node.name, _node.fName, length, num_path;
---- 4
Alice|ABFsUni||1|1
Alice||Bob|1|1
Alice||Carol|1|1
Alice||Dan|1|1
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a) WHERE a.ID = 1
           CALL variable_length_path(PK, a, 1, 1, true)
           RETURN a.fName, _node, length, num_path;
---- 0
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a) WHERE a.ID = 1
           CALL variable_length_path(PK, a, 1, 1, false)
           RETURN a.fName, _node.name, length, num_path;
---- error
Binder exception: Cannot find property name for _node.
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL variable_length_path(PK, a, 2, 2, true)
           RETURN a.fName, _node.fName, length, num_path;
---- 4
Alice|Alice|2|3
Alice|Bob|2|2
Alice|Carol|2|2
Alice|Dan|2|2
-STATEMENT PROJECT GRAPH PK (person, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL shortest_path(PK, a, 2, true)
           RETURN a.fName, _node.fName, length;
---- 4
Alice|Alice|0
Alice|Bob|1
Alice|Carol|1
Alice|Dan|1
-STATEMENT PROJECT GRAPH PK (person, organisation, workAt, knows)
           MATCH (a:person) WHERE a.ID = 0
           CALL shortest_path(PK, a, 2, true)
           RETURN a.fName, _node.fName, _node.name, length;
---- 6
Alice|Alice||0
Alice|Bob||1
Alice|Carol||1
Alice|Dan||1
Alice||CsWork|2
Alice||DEsWork|2
-STATEMENT PROJECT GRAPH PK (person, knows) CALL weakly_connected_component(PK, true) RETURN _node.fName, group_id;
---- 8
Alice|0
Bob|0
Carol|0
Dan|0
Elizabeth|1
Farooq|1
Greg|1
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2
-STATEMENT PROJECT GRAPH PK (person, organisation, knows, workAt) CALL weakly_connected_component(PK, true) RETURN _node.fName, _node.name, group_id;
---- 11
Alice||0
Bob||0
Carol||0
Dan||0
Elizabeth||1
Farooq||1
Greg||1
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff||2
|ABFsUni|3
|CsWork|0
|DEsWork|0
-STATEMENT PROJECT GRAPH PK (person, knows) CALL page_rank(PK, true) RETURN _node.fName, rank;
---- 8
Alice|0.125000
Bob|0.125000
Carol|0.125000
Dan|0.125000
Elizabeth|0.022734
Farooq|0.018750
Greg|0.018750
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|0.018750
