-DATASET CSV demo-db/csv

--
-CASE ExportDBWithDropColumn
-IMPORT_DATABASE "$tmp/export/db_special/drop_column_test"
-STATEMENT IMPORT DATABASE "$tmp/export/db_special/drop_column_test";
---- ok
-STATEMENT MATCH (t:test) RETURN t.id, t.prop2, t.prop3;
---- 1
1|B|10

