-DATASET CSV tinysnb
--

-CASE StatsInfo
-STATEMENT MATCH (p:person) RETURN COUNT(p)
---- 1
8
-STATEMENT CALL stats_info('person') RETURN *
---- 1
8
-STATEMENT CALL stats_info('not_exist') RETURN *
---- error
Binder exception: Table not_exist does not exist!
-STATEMENT CALL stats_info('knows') RETURN *
---- error
Binder exception: Stats from a non-node table knows is not supported yet!
-RELOADDB
-STATEMENT CREATE (p:person {id: 10000});
---- ok
-STATEMENT CALL stats_info('person') RETURN *
---- 1
9

-CASE StatsInfoWithTransaction
-STATEMENT CALL stats_info('person') RETURN *
---- 1
8
-STATEMENT BEGIN TRANSACTION;
---- ok
-STATEMENT CREATE (p:person {id: 10000});
---- ok
-STATEMENT CALL stats_info('person') RETURN *
---- 1
9
-STATEMENT ROLLBACK;
---- ok
-STATEMENT CALL stats_info('person') RETURN *
---- 1
8
