-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FunctionBlob

-NAME ReturnBlobHexOnly
-QUERY RETURN BLOB('\\xAA\\xBB\\xCD\\x1A');
---- 1
\xAA\xBB\xCD\x1A

-NAME ReturnBlobASCIIOnly
-QUERY RETURN BLOB('THIS IS A ASCII ONLY BLOB DATA');
---- 1
THIS IS A ASCII ONLY BLOB DATA

-NAME ReturnBlobASCIIAndHex
-QUERY RETURN BLOB('THIS IS A MIxed of ASCII and \\xB2 \\xD3ONLY BLOB DATA\\xA5');
---- 1
THIS IS A MIxed of ASCII and \xB2 \xD3ONLY BLOB DATA\xA5

-NAME Octet_length
-QUERY RETURN OCTET_LENGTH(BLOB('\\xAA\\xB3 AD NC \\xD2'))
---- 1
10

-NAME ReturnEncodeUTF8String
-QUERY RETURN encode('encode this utf-8 char: ü')
---- 1
encode this utf-8 char: \xC3\xBC

-NAME ReturnDecodeUTF8String
-QUERY RETURN decode(BLOB('decode this utf-8 char: \\xC3\\xBC'))
---- 1
decode this utf-8 char: ü

-NAME ReturnInvalidUTF8String
-QUERY RETURN decode(BLOB('decode this invalid utf-8 char: \\xA1\\xBC'))
---- error
Runtime exception: Failure in decode: could not convert blob to UTF8 string, the blob contained invalid UTF8 characters

-NAME BlobGreaterThan
-QUERY MATCH (m:movies) RETURN m.content > BLOB("test");
---- 3
True
True
False

-NAME BlobGreaterThanOrEqualTo
-QUERY MATCH (m:movies) RETURN m.content >= BLOB("\\xAA\\xABinteresting\\x0B");
---- 3
True
True
False

-NAME BlobEqualTo
-QUERY MATCH (m:movies) RETURN m.content = BLOB("\\xAA\\xABinteresting\\x0B");
---- 3
True
False
False

-NAME BlobNotEqualTo
-QUERY MATCH (m:movies) RETURN m.content <> BLOB("\\xAA\\xABinteresting\\x0B");
---- 3
False
True
True

-NAME BlobGreaterThan
-QUERY MATCH (m:movies) RETURN m.content < BLOB("\\xAB\\xCD");
---- 3
True
False
True

-NAME BlobGreaterThanOrEqualTo
-QUERY MATCH (m:movies) RETURN m.content <= BLOB("pure ascii characters");
---- 3
False
False
True
