-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FunctionCast

-LOG CastFromINT16
-STATEMENT MATCH (p:person)-[e:studyAt]->(o:organisation) WHERE p.ID=0 RETURN to_int32(e.length), to_int64(e.length), to_float(e.length), to_double(e.length)
---- 1
5|5|5.000000|5.000000

-LOG CastFromINT32
-STATEMENT MATCH (m:movies) WHERE m.name='Roma' RETURN to_int16(m.length), to_int64(m.length), to_float(m.length), to_double(m.length)
---- 1
298|298|298.000000|298.000000

-LOG CastFromINT64
-STATEMENT MATCH (p:person) WHERE p.ID=0 RETURN to_int16(p.gender), to_int32(p.gender), to_float(p.gender), to_double(p.gender)
---- 1
1|1|1.000000|1.000000

-LOG CastFromFLOAT
-STATEMENT MATCH (p:person) WHERE p.ID=0 RETURN to_int16(p.height), to_int32(p.height), to_int64(p.height), to_double(p.height)
---- 1
1|1|1|1.731000

-LOG CastFromDOUBLE
-STATEMENT MATCH (p:person) WHERE p.ID=0 RETURN to_int16(p.eyeSight), to_int32(p.eyeSight), to_int64(p.eyeSight), to_float(p.eyeSight)
---- 1
5|5|5|5.000000

-LOG CastBoolToString
-STATEMENT MATCH (p:person) RETURN string(p.isStudent)
---- 8
True
True
False
False
False
True
False
False

-LOG CastInt64ToString
-STATEMENT MATCH (p:person) RETURN string(p.age)
---- 8
35
30
45
20
20
25
40
83

-LOG CastInt32ToString
-STATEMENT MATCH (m:movies) RETURN string(m.length)
---- 3
126
2544
298

-LOG CastInt16ToString
-STATEMENT MATCH (p:person)-[s:studyAt]->(o:organisation) RETURN string(s.length)
---- 3
5
55
22

-LOG CastDoubleToString
-STATEMENT MATCH (p:person) RETURN string(p.eyeSight)
---- 8
5.000000
5.100000
5.000000
4.800000
4.700000
4.500000
4.900000
4.900000

-LOG CastFloatToString
-STATEMENT MATCH (p:person) RETURN string(p.height)
---- 8
1.731000
0.990000
1.000000
1.300000
1.463000
1.510000
1.600000
1.323000

-LOG CastDateToString
-STATEMENT MATCH (p:person) RETURN string(p.birthdate)
---- 8
1900-01-01
1900-01-01
1940-06-22
1950-07-23
1980-10-26
1980-10-26
1980-10-26
1990-11-27

-LOG CastTimestampToString
-STATEMENT MATCH (p:person) RETURN string(p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30.000526
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30.678559
1976-12-23 04:41:42
2023-02-21 13:25:30

-LOG CastIntervalToString
-STATEMENT MATCH (p:person) RETURN string(p.lastJobDuration)
---- 8
3 years 2 days 13:02:00
10 years 5 months 13:00:00.000024
48:24:11
10 years 5 months 13:00:00.000024
48:24:11
00:18:00.024
10 years 5 months 13:00:00.000024
3 years 2 days 13:02:00

-LOG CastStringToString
-STATEMENT MATCH (p:person) RETURN string(p.fName)
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-LOG CastListOfIntsToString
-STATEMENT MATCH (p:person) RETURN string(p.workedHours)
---- 8
[10,5]
[12,8]
[4,5]
[1,9]
[2]
[3,4,5,6,7]
[1]
[10,11,12,3,4,5,6,7]

-LOG CastListOfListOfIntsToString
-STATEMENT MATCH (p:person) RETURN string(p.courseScoresPerTerm)
---- 8
[[10,8],[6,7,8]]
[[8,9],[9,10]]
[[8,10]]
[[7,4],[8,8],[9]]
[[6],[7],[8]]
[[8]]
[[10]]
[[7],[10],[6,7]]

-LOG CastInternalIDToString
-STATEMENT MATCH (p:person) RETURN string(id(p))
---- 8
0:0
0:1
0:2
0:3
0:4
0:5
0:6
0:7

-LOG CastStructToString
-STATEMENT MATCH (o:organisation) RETURN string(o.state)
---- 3
{138,['toronto', 'montr,eal'],{[96,56],1000}}
{152,["vanco,uver north area"],{[15,78,671],432}}
{558,['very long city name', 'new york'],{[22],99}}

-LOG CastInt16ToDouble
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN to_double(e.length)
---- 3
5.000000
55.000000
22.000000

-LOG CastInt16ToFloat
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN to_float(e.length)
---- 3
5.000000
55.000000
22.000000

-LOG CastInt16ToInt64
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN to_int64(e.length)
---- 3
5
55
22

-LOG CastInt16ToInt32
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN to_int32(e.length)
---- 3
5
55
22

-LOG CastInt32ToDouble
-STATEMENT MATCH (m:movies) RETURN to_double(m.length)
---- 3
126.000000
2544.000000
298.000000

-LOG CastInt32ToFloat
-STATEMENT MATCH (m:movies) RETURN to_float(m.length)
---- 3
126.000000
2544.000000
298.000000

-LOG CastInt32ToInt64
-STATEMENT MATCH (m:movies) RETURN to_int64(m.length)
---- 3
126
2544
298

-LOG CastInt64ToDouble
-STATEMENT MATCH (p:person) RETURN to_double(p.age)
---- 8
35.000000
30.000000
45.000000
20.000000
20.000000
25.000000
40.000000
83.000000

-LOG CastInt64ToFloat
-STATEMENT MATCH (p:person) RETURN to_float(p.gender)
---- 8
1.000000
2.000000
1.000000
2.000000
1.000000
2.000000
2.000000
2.000000

-LOG CastFloatToDouble
-STATEMENT MATCH (p:person) RETURN to_double(p.height)
---- 8
1.731000
0.990000
1.000000
1.300000
1.463000
1.510000
1.600000
1.323000
