-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FunctionComparison

-DEBUG_LOG INT64Equal
-QUERY MATCH (p:person) WHERE p.ID = 5 RETURN p.fName;
---- 1
Dan

-DEBUG_LOG INT64NotEqual
-QUERY MATCH (p:person) WHERE p.ID <> 2 RETURN p.ID;
---- 7
0
3
5
7
8
9
10

-DEBUG_LOG INT64Greater
-QUERY MATCH (p:person) WHERE p.ID > 5 RETURN p.fName;
---- 4
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG INT64GreaterEqual
-QUERY MATCH (p:person) WHERE p.ID >= 5 RETURN p.fName;
---- 5
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG INT64Less
-QUERY MATCH (p:person) WHERE p.ID < 5 RETURN p.fName;
---- 3
Alice
Bob
Carol

-DEBUG_LOG INT64LessEqual
-QUERY MATCH (p:person) WHERE p.ID <= 5 RETURN p.fName;
---- 4
Alice
Bob
Carol
Dan

-DEBUG_LOG StringEqual
-QUERY MATCH (p:person) WHERE p.fName = 'Alice' RETURN p.ID;
---- 1
0

-DEBUG_LOG StringNotEqual
-QUERY MATCH (p:person) WHERE p.fName <> 'Alice' RETURN p.ID;
---- 7
2
3
5
7
8
9
10

-DEBUG_LOG StringGreater
-QUERY MATCH (p:person) WHERE p.fName > 'Dan' RETURN p.fName;
---- 4
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG StringGreaterEqual
-QUERY MATCH (p:person) WHERE p.fName >= 'Dan' RETURN p.fName;
---- 5
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG StringLess
-QUERY MATCH (p:person) WHERE p.fName < 'Dan' RETURN p.fName;
---- 3
Alice
Bob
Carol

-DEBUG_LOG StringLessEqual
-QUERY MATCH (p:person) WHERE p.fName <= 'Dan' RETURN p.fName;
---- 4
Alice
Bob
Carol
Dan

-DEBUG_LOG ListOfInt64Equal
-QUERY MATCH (p:person) WHERE p.workedHours = [12, 8] RETURN p.ID;
---- 1
2

-DEBUG_LOG ListOfInt64NotEqual
-QUERY MATCH (p:person) WHERE p.workedHours <> [12, 8] RETURN p.ID;
---- 7
0
3
5
7
8
9
10

-DEBUG_LOG ListOfInt64Greater
-QUERY MATCH (p:person) WHERE p.workedHours > [2] RETURN p.fName;
---- 5
Alice
Bob
Carol
Farooq
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG ListOfInt64GreaterEqual
-QUERY MATCH (p:person) WHERE p.workedHours >= [4,5] RETURN p.fName;
---- 4
Alice
Bob
Carol
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG ListOfInt64Less
-QUERY MATCH (p:person) WHERE p.workedHours < [3,4,5] RETURN p.fName;
---- 3
Dan
Elizabeth
Greg

-DEBUG_LOG ListOfInt64LessEqual
-QUERY MATCH (p:person) WHERE p.workedHours <= [8] RETURN p.fName;
---- 5
Carol
Dan
Elizabeth
Farooq
Greg

-DEBUG_LOG ListOfListOfInt64Equal
-QUERY MATCH (p:person) WHERE p.courseScoresPerTerm = [[8,9],[9,10]] RETURN p.ID;
---- 1
2

-DEBUG_LOG ListOfListOfInt64NotEqual
-QUERY MATCH (p:person) WHERE p.courseScoresPerTerm <> [[8,9],[9,10]] RETURN p.ID;
---- 7
0
3
5
7
8
9
10

-DEBUG_LOG ListOfListOfInt64Greater
-QUERY MATCH (p:person) WHERE p.courseScoresPerTerm > [[8,9],[6,4]] RETURN p.fName;
---- 4
Alice
Bob
Carol
Greg

-DEBUG_LOG ListOfListOfInt64GreaterEqual
-QUERY MATCH (p:person) WHERE p.courseScoresPerTerm >= [[10,8],[6,7,8]] RETURN p.fName;
---- 1
Alice

-DEBUG_LOG ListOfListOfInt64Less
-QUERY MATCH (p:person) WHERE p.courseScoresPerTerm < [[8,9,2]] RETURN p.fName;
---- 5
Bob
Dan
Elizabeth
Farooq
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG ListOfListOfInt64LessEqual
-QUERY MATCH (p:person) WHERE p.courseScoresPerTerm <= [[8]] RETURN p.fName;
---- 4
Dan
Elizabeth
Farooq
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-DEBUG_LOG ListGreaterWithNull
-QUERY RETURN [3,4] > [3,NULL]
---- 1
False

-DEBUG_LOG ListGreaterWithNull
-QUERY RETURN [3, NULL, 2] > [3,NULL]
---- 1
True

-DEBUG_LOG ListNotEqualWithNull
-QUERY RETURN [NULL, 2] <> [NULL]
---- 1
True

-DEBUG_LOG StructEqual
-QUERY MATCH (m:movies) WHERE m.description = {a: 7.0, b: 982, c: timestamp('2018-11-13 13:33:11'), d: date('2014-09-12')} RETURN m.name;
---- 1
The 烩锔锔 movie

-DEBUG_LOG StructNotEqual
-QUERY MATCH (m:movies) WHERE m.description <> {rating: 1223.0, views: 10003, release: timestamp('2011-02-11 16:44:22'), film: date('2013-02-22')} RETURN m.name;
---- 2
S贸l贸 c贸n tu p谩rej芒
The 烩锔锔 movie

-DEBUG_LOG StructGreater
-QUERY MATCH (m:movies) WHERE m.description > {rating: 5.3, views: 152, release: timestamp('2011-08-20 11:25:30'), film: date('2012-05-11')} RETURN m.name;
---- 2
The 烩锔锔 movie
Roma

-DEBUG_LOG StructGreaterEqual
-QUERY MATCH (m:movies) WHERE m.description >= {rating: 5.3, views: 152, release: timestamp('2011-08-20 11:25:30'), film: date('2012-05-11')} RETURN m.name;
---- 3
S贸l贸 c贸n tu p谩rej芒
The 烩锔锔 movie
Roma

-DEBUG_LOG StructLess
-QUERY MATCH (m:movies) WHERE m.description < {rating: 7.0, views: 1000, release: timestamp('2018-11-13 13:33:11'), film: date('2014-09-12')} RETURN m.name;
---- 2
S贸l贸 c贸n tu p谩rej芒
The 烩锔锔 movie

-DEBUG_LOG StructLessEqual
-QUERY MATCH (m:movies) WHERE m.description <= {rating: 1223.0, views: 10004, release: timestamp('2011-02-11 16:44:22'), film: date('2013-02-22')} RETURN m.name;
---- 3
S贸l贸 c贸n tu p谩rej芒
The 烩锔锔 movie
Roma

-DEBUG_LOG StructGreaterWithNull
-QUERY RETURN {a: 2, b: null} > {a: 2, b: 3}
---- 1
True

-DEBUG_LOG StructGreaterWithNull
-QUERY RETURN {a: 2, b: null} > {a: 2, b: null}
---- 1
False

-DEBUG_LOG StructNotEqualWithNull
-QUERY RETURN {a: 2, b: null} <> {a: 2, b: null}
---- 1
False
