-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FunctionNodeRel

-NAME KnowsOneToTwoHopTest
-QUERY MATCH (a:person)-[e:knows*1..2]-(b:person) WHERE a.fName='Elizabeth' RETURN nodes(e), rels(e)
---- 4
[0:4,0:5,0:4]|[3:12,3:12]
[0:4,0:5]|[3:12]
[0:4,0:6,0:4]|[3:13,3:13]
[0:4,0:6]|[3:13]
