-NAME StrVarAndStrLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, 'xyz') = 'Farooqxyz' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndStrLiteralConcat2
-QUERY MATCH (a:person) WHERE concat('xyz', a.fName) = 'xyzFarooq' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndStrLiteralConcat3
-QUERY MATCH (a:person) WHERE 'Farooqxyz' = concat(a.fName, 'xyz') RETURN COUNT(*)
---- 1
1

-NAME StrVarAndStrLiteralConcat4
-QUERY MATCH (a:person) WHERE 'xyzFarooq' = concat('xyz', a.fName) RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(10)) = 'Farooq10' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntLiteralConcat2
-QUERY MATCH (a:person) WHERE 'Farooq10' = concat(a.fName, string(10)) RETURN COUNT(*)
---- 1
1

-NAME IntLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE concat(string(10), a.fName) = '10Farooq' RETURN COUNT(*)
---- 1
1

-NAME IntLiteralAndStrVarConcat2
-QUERY MATCH (a:person) WHERE '10Farooq' = concat(string(10), a.fName) RETURN COUNT(*)
---- 1
1

-NAME StrVarAndBoolLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(true)) = 'FarooqTrue' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndBoolLiteralConcat2
-QUERY MATCH (a:person) WHERE 'FarooqTrue' = concat(a.fName, string(true)) RETURN COUNT(*)
---- 1
1

-NAME BoolLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE concat(string(false), a.fName) = 'FalseFarooq' RETURN COUNT(*)
---- 1
1

-NAME BoolLiteralAndStrVarConcat
-QUERY MATCH (a:person) WHERE 'FalseFarooq' = concat(string(FALse), a.fName) RETURN COUNT(*)
---- 1
1

-NAME StrVarAndDoubleLiteralConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(11.7)) = 'Farooq11.700000' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntegerVarConcat
-QUERY MATCH (a:person) WHERE concat(a.fName, string(a.age)) = 'Farooq25' RETURN COUNT(*)
---- 1
1

-NAME StrVarAndIntegerVarConcat2
-QUERY MATCH (a:person) WHERE 'Farooq25' = concat(a.fName, string(a.age)) RETURN COUNT(*)
---- 1
1

-NAME IntegerVarAndStrVarConcat
-QUERY MATCH (a:person) WHERE concat(string(a.age), a.fName) = '25Farooq' RETURN COUNT(*)
---- 1
1

-NAME IntegerVarAndStrVarConcat2
-QUERY MATCH (a:person) WHERE '25Farooq' = concat(string(a.age), a.fName) RETURN COUNT(*)
---- 1
1

-NAME DateVarAndStrVarConcatStructured
-QUERY MATCH (a:person) WHERE '1900-01-01Alice' = concat(string(a.birthdate), a.fName) RETURN COUNT(*)
---- 1
1

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME UnstrDateVarAndStrVarConcatUnstructured
#-QUERY MATCH (a:person) WHERE '1950-01-01Carol' = concat(a.unstrDateProp1, a.fName) RETURN COUNT(*)
#---- 1
#1

-NAME TimestampVarAndStrVarConcatStructured
-QUERY MATCH (a:person) WHERE '2011-08-20 11:25:30Alice' = concat(string(a.registerTime), a.fName) RETURN COUNT(*)
---- 1
1

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME UnstrTimestampVarAndStrVarConcatUnstructured
#-QUERY MATCH (a:person) WHERE '1962-05-22 13:11:22.562Greg' = concat(a.unstrTimestampProp1, a.fName) RETURN COUNT(*)
#---- 1
#1

-NAME ContainsReturn
-QUERY MATCH (a:person) RETURN a.fName, a.fName CONTAINS "a" ORDER BY a.fName
---- 8
Alice|False
Bob|False
Carol|True
Dan|True
Elizabeth|True
Farooq|True
Greg|False
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|True

-NAME ContainsSelect
-QUERY MATCH (a:person) WHERE a.fName = 'Bob' and a.fName CONTAINS "B" RETURN a.fName
---- 1
Bob

-NAME ContainsSelect2
-QUERY MATCH (a:person)-[:knows]->(b:person) WHERE NOT a.fName CONTAINS b.fName RETURN COUNT(*)
---- 1
14

-NAME ContainsSelect3
-QUERY MATCH (a:person) WHERE a.fName <> "Alice" and a.fName CONTAINS a.fName RETURN count(*)
---- 1
7

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME ContainsSelect4
#-QUERY MATCH (a:person) WHERE a.fName <> "Alice" and a.label2 CONTAINS a.label2 RETURN count(*)
#---- 1
#4

-NAME StartsWithReturn1
-QUERY MATCH (a:person) RETURN a.fName, a.fName STARTS WITH "A" ORDER BY a.fName
---- 8
Alice|True
Bob|False
Carol|False
Dan|False
Elizabeth|False
Farooq|False
Greg|False
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|False

-NAME StartsWithAlias
-QUERY MATCH (o:organisation) RETURN prefix(o.name, "ABF")
---- 3
True
False
False

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME StartsWithReturn2
#-QUERY MATCH (a:person) RETURN a.label1, a.label1 STARTS WITH "g" ORDER BY a.fName
#---- 8
#excellent|False
#good|True
#good|True
#good|True
#|
#|
#|
#|

#-NAME StartsWithFilterReturn
#-QUERY MATCH (a:person) WHERE a.ID <> 0 RETURN a.label1, a.label1 STARTS WITH "g" ORDER BY a.fName
#---- 7
#excellent|False
#good|True
#good|True
#|
#|
#|
#|

-NAME StartsWithSelect
-QUERY MATCH (a:person) WHERE a.fName STARTS WITH "C" RETURN a.fName
---- 1
Carol

-NAME LowerStructuredStr
-QUERY MATCH (o:organisation) RETURN lower(o.name)
---- 3
abfsuni
cswork
deswork

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME LowerUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN lower(o.unstrStr)
#---- 3
#  perfect
#  excellent organisation
#good organisation !

-NAME UpperStructuredStr
-QUERY MATCH (o:organisation) RETURN upper(o.name)
---- 3
ABFSUNI
CSWORK
DESWORK

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME UpperUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN ucase(o.unstrStr)
#---- 3
#  PERFECT
#  EXCELLENT ORGANISATION
#GOOD ORGANISATION !

-NAME TrimStructuredStr
-QUERY MATCH (o:organisation) RETURN trim(o.name)
---- 3
ABFsUni
CsWork
DEsWork

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME TrimUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN trim(o.unstrStr)
#---- 3
#pERfECt
#EXcELLENT organisation
#GoOd organisation !

-NAME LtrimStructuredStr
-QUERY MATCH (o:organisation) RETURN ltrim(o.name)
---- 3
ABFsUni
CsWork
DEsWork

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME LtrimUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN ltrim(o.unstrStr)
#---- 3
#pERfECt
#EXcELLENT organisation
#GoOd organisation !

-NAME RtrimStructuredStr
-QUERY MATCH (o:organisation) RETURN rtrim(o.name)
---- 3
ABFsUni
CsWork
DEsWork

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME RtrimUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN rtrim(o.unstrStr)
#---- 3
#  pERfECt
#  EXcELLENT organisation
#GoOd organisation !

-NAME ReverseStructuredStr
-QUERY MATCH (o:organisation) RETURN reverse(o.name)
---- 3
inUsFBA
kroWsC
kroWsED

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME ReverseUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN reverse(o.unstrStr)
#---- 3
#tCEfREp
#   noitasinagro TNELLEcXE
# ! noitasinagro dOoG

-NAME LengthStructuredStr
-QUERY MATCH (o:organisation) RETURN length(o.name)
---- 3
7
6
7

-NAME LengthUTF8Str
-QUERY MATCH (m:movies) RETURN length(m.name)
---- 3
18
17
4

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME LengthUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN length(o.unstrStr)
#---- 3
#9
#27
#20

-NAME RepeatStructuredStr
-QUERY MATCH (o:organisation) RETURN repeat(o.name, o.ID)
---- 3
ABFsUni
CsWorkCsWorkCsWorkCsWork
DEsWorkDEsWorkDEsWorkDEsWorkDEsWorkDEsWork

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME RepeatUnstructuredStr
#-QUERY MATCH (o:organisation) RETURN repeat(o.unstrStr, o.ID)
#---- 3
#  pERfECt
#  EXcELLENT organisation     EXcELLENT organisation     EXcELLENT organisation     EXcELLENT organisation
#GoOd organisation ! GoOd organisation ! GoOd organisation ! GoOd organisation ! GoOd organisation ! GoOd organisation !

-NAME LpadStructuredStrAndLiteralInt
-QUERY MATCH (p:person) RETURN lpad(p.fName, 5, "<")
---- 8
Alice
<<Bob
Carol
<<Dan
Eliza
Faroo
<Greg
Huber

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME LpadStructuredStrAndStructuredInt
#-QUERY MATCH (p:person) RETURN lpad(p.fName, p.ID, "<")
#---- 8
#
#Bo
#Car
#<<Dan
#Elizabe
#<<Farooq
#<<<<<Greg
#Hubert Bla

#-NAME LpadUnstructuredStrAndLiteralInt
#-QUERY MATCH (p:person) RETURN lpad(p.label1, 10, "<")
#---- 8
#<<<<<<good
#<<<<<<good
#<excellent
#<<<<<<good
#
#
#
#

-NAME RpadStructuredStrAndLiteralInt
-QUERY MATCH (p:person) RETURN rpad(p.fName, 15, ">")
---- 8
Alice>>>>>>>>>>
Bob>>>>>>>>>>>>
Carol>>>>>>>>>>
Dan>>>>>>>>>>>>
Elizabeth>>>>>>
Farooq>>>>>>>>>
Greg>>>>>>>>>>>
Hubert Blaine W

-NAME RpadStructuredStrAndStructuredInt
-QUERY MATCH (p:person) RETURN rpad(p.fName, p.ID, "<")
---- 8

Bo
Car
Dan<<
Elizabe
Farooq<<
Greg<<<<<
Hubert Bla

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME RpadUnstructuredStrAndLiteralInt
#-QUERY MATCH (p:person) RETURN rpad(p.label1, 5, ">")
#---- 8
#good>
#good>
#excel
#good>
#
#
#
#

-NAME SubStrStructuredStrAndLiteralInt
-QUERY MATCH (p:person) RETURN substr(p.fName, 2, 12)
---- 8
lice
ob
arol
an
lizabeth
arooq
reg
ubert Blaine

-NAME SubStrUTF8String
-QUERY MATCH (m:movies) RETURN substr(m.name, 1, 10)
---- 3
Sóló cón t
The 😂😃🧘🏻‍♂️🌍🌦️🍞
Roma

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME SubStrUnstructuredStrAndLiteralInt
#-QUERY MATCH (p:person) RETURN substring(p.label1, 3, 2)
#---- 8
#od
#od
#ce
#od
#
#
#

-NAME LeftPositiveIdxStructuredStrAndLiteralInt
-QUERY MATCH (p:person) RETURN left(p.fName, 11)
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blai

-NAME LeftPositiveIdxStructuredStrAndStructuredInt
-QUERY MATCH (o:organisation) RETURN left(o.name, o.ID)
---- 3
A
CsWo
DEsWor

-NAME LeftNegativeIdxStructuredStrAndLiteralInt
-QUERY MATCH (p:person) RETURN left(p.fName, -3)
---- 8
Al

Ca

Elizab
Far
G
Hubert Blaine Wolfeschlegelsteinhausenbergerdo

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME LeftUnstructuredStrAndLiteralInt
#-QUERY MATCH (p:person) RETURN left(p.label1, 2)
#---- 8
#go
#go
#ex
#go
#
#
#
#

-NAME RightPositiveIdxStructuredStrAndLiteralInt
-QUERY MATCH (p:person) RETURN right(p.fName, 10)
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
ergerdorff

-NAME RightPositiveIdxStructuredStrAndStructuredInt
-QUERY MATCH (o:organisation) RETURN right(o.name, o.ID)
---- 3
i
Work
EsWork

-NAME RightNegativeIdxStructuredStrAndLiteralInt
-QUERY MATCH (p:person) RETURN right(p.fName, -2)
---- 8
ice
b
rol
n
izabeth
rooq
eg
bert Blaine Wolfeschlegelsteinhausenbergerdorff

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME RightUnstructuredStrAndLiteralInt
#-QUERY MATCH (p:person) RETURN right(p.label1, 3)
#---- 8
#ood
#ood
#ent
#ood
#
#
#
#

-NAME ArrayExtractPositiveIdxStructuredStrAndStructuredInt
-QUERY MATCH (o:organisation) RETURN array_extract(o.name, o.ID + 2)
---- 3
F
k
k

-NAME ArrayExtractNegativeIdxStructuredStrAndStructuredInt
-QUERY MATCH (o:organisation) RETURN array_extract(o.name, o.ID - 5)
---- 3
s
k
D

-NAME ListExtractStructuredString
-QUERY MATCH (o:organisation) RETURN o.name[2]
---- 3
B
s
E

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME ListExtractUnstructuredString
#-QUERY MATCH (o:organisation) RETURN o.unstrStr[4]
#---- 3
#E
#X
#d

#-NAME UnstrStrEqual
#-QUERY MATCH (o:organisation) WHERE o.unstrStr = '  pERfECt' RETURN count(*)
#---- 1
#1

#-NAME UnstrStrNotEqual
#-QUERY MATCH (o:organisation) WHERE o.unstrStr <> '  pERfECt' RETURN count(*)
#---- 1
#2

#-NAME UnstrStrComparison
#-QUERY MATCH (o:organisation) WHERE o.unstrStr < "Test string" RETURN count(*)
#---- 1
#3

-NAME SuffixStructuredStr
-QUERY MATCH (o:organisation) RETURN suffix(o.name, "Work")
---- 3
False
True
True

# TODO(Semih): Uncomment when enabling ad-hoc properties
#-NAME SuffixUnstructuredStr
#-QUERY MATCH (p:person) RETURN suffix(p.label1, "od")
#---- 8
#True
#
#
#True
#
#False
#True
#

-NAME SuffixSelect
-QUERY MATCH (p:person) WHERE suffix(p.fName, "l") RETURN p.fName
---- 1
Carol

