-NAME TimestampLiteralEqualityComparison
-QUERY MATCH (a:person) WHERE a.registerTime = timestamp('1976-12-23 11:21:42') RETURN COUNT(*)
---- 1
1

-NAME TimestampDateEqual
-QUERY MATCH (a:person) WHERE date_trunc("daY", a.unstrTimestampProp2) = date('1976-12-23') RETURN COUNT(*)
---- 1
1

-NAME TimestampDateNotEqual
-QUERY MATCH (a:person) WHERE date_trunc("daY", a.registerTime) <> date('1976-12-23') RETURN COUNT(*)
---- 1
6

-NAME TimestampDateGreaterThan
-QUERY MATCH (a:person) WHERE a.registerTime > date('1976-12-23') RETURN COUNT(*)
---- 1
6

-NAME TimestampDateGreaterThanEqual
-QUERY MATCH (a:person) WHERE a.registerTime >= date('1976-12-23') RETURN COUNT(*)
---- 1
6

-NAME TimestampDateLessThan
-QUERY MATCH (a:person) WHERE a.registerTime < date('1976-12-23') RETURN COUNT(*)
---- 1
2

-NAME TimestampDateLessThanEqual
-QUERY MATCH (a:person) WHERE a.registerTime <= date('1976-12-23') RETURN COUNT(*)
---- 1
2

-NAME UnstructuredStructuredTimestampComparison
-QUERY MATCH (a:person) WHERE a.registerTime = a.unstrTimestampProp1 RETURN COUNT(*)
---- 1
2

-NAME TwoUnstructuredTimestampComparison
-QUERY MATCH (a:person) WHERE a.unstrTimestampProp1 <> a.unstrTimestampProp2 RETURN COUNT(*)
---- 1
2

-NAME TwoUnstructuredTimestampComparison
-QUERY MATCH (a:person) WHERE a.unstrTimestampProp1 <= a.unstrTimestampProp2 RETURN COUNT(*)
---- 1
2

-NAME UnstructuredTimestampLiteralComparison
-QUERY MATCH (a:person) WHERE a.unstrTimestampProp1 <= timestamp('1985-11-22 13:12:22.562') RETURN COUNT(*)
---- 1
2

-NAME StructuredTimestampArithmeticAddInterval1
-QUERY MATCH (a:person) RETURN a.registerTime + interval('47 hours 30 minutes 30 seconds')
---- 8
1911-08-22 02:02:51
1972-08-02 12:53:00.678559
1976-12-25 04:12:12
1976-12-25 10:52:12
2008-11-05 14:56:00.000526
2011-08-22 10:56:00
2023-02-23 12:56:00
2031-12-02 11:56:00


-NAME StructuredTimestampArithmeticAddInterval2
-QUERY MATCH (a:person) RETURN a.registerTime + interval('2 years 3 days 34 h 28 minutes 300 milliseconds 20 us')
---- 8
1913-08-24 13:00:21.30002
1974-08-04 23:50:30.978579
1978-12-27 15:09:42.30002
1978-12-27 21:49:42.30002
2010-11-08 01:53:30.300546
2013-08-24 21:53:30.30002
2025-02-25 23:53:30.30002
2033-12-04 22:53:30.30002

-NAME UnstructuredTimestampArithmeticAddInterval
-QUERY MATCH (a:person) RETURN a.unstrTimestampProp1 + interval('10 years 20 days 42 h 32 minutes 312 milliseconds')
---- 8




1956-09-16 13:39:22.312
1972-06-13 07:43:22.874
2033-03-15 07:57:30.312
2041-12-22 06:57:30.312

-NAME StructuredTimestampArithmeticSubtractInterval
-QUERY MATCH (a:person) RETURN a.registerTime - interval('12 years 7 months 10 days 20 h 30 m 100 us')
---- 8
1899-01-09 06:02:20.9999
1959-12-20 16:52:30.678459
1964-05-12 08:11:41.9999
1964-05-12 14:51:41.9999
1996-03-23 18:55:30.000426
1999-01-09 14:55:29.9999
2010-07-10 16:55:29.9999
2019-04-19 15:55:29.9999

-NAME UnstructuredTimestampArithmeticSubtractInterval
-QUERY MATCH (a:person) RETURN a.unstrTimestampProp1 - interval('40 months 200 days 420 hour 320 minutes 312 seconds')
---- 8




1942-09-20 01:42:10
1958-06-18 19:46:10.562
2019-03-17 20:00:18
2027-12-25 19:00:18

-NAME StructuredTimestampArithmeticSubtractTimestamp
-QUERY MATCH (a:person) RETURN a.registerTime - timestamp('2013-01-02 14:22:31.45612')
---- 8
-37026 days -11:50:10.45612
-14765 days -01:00:00.777561
-13159 days -09:40:49.45612
-13159 days -03:00:49.45612
-1520 days -22:57:01.455594
-501 days -02:57:01.45612
3701 days 23:02:58.54388
6905 days 22:02:58.54388

-NAME UnstructuredTimestampArithmeticSubtractTimestamp
-QUERY MATCH (a:person) RETURN a.unstrTimestampProp1 - timestamp('1976-01-02 13:44:12')
---- 8




-10721 days -18:36:50
-4973 days -00:32:49.438
17216 days 23:41:18
20420 days 22:41:18

-NAME StructuredTimestampMixedArithmeticOperations
-QUERY MATCH (a:person) RETURN a.registerTime + interval('2 hours 48 minutes 1000 seconds') - interval('188 days 48 hours') - timestamp('1976-01-02 13:44:12')
---- 8
-23701 days -08:07:11
-1439 days -21:17:01.321441
165 days 18:02:10
166 days 00:42:10
11804 days 04:45:58.000526
12824 days 00:45:58
17027 days 02:45:58
20231 days 01:45:58

-NAME UnstructuredTimestampMixedArithmeticOperations
-QUERY MATCH (a:person) RETURN a.unstrTimestampProp1 - interval('2 years 18 days 24 minutes')  + interval('12 hours 100 seconds') - timestamp('1976-01-02 13:44:12')
---- 8




-11469 days -06:59:10
-5720 days -12:55:09.438
16469 days 11:18:58
19673 days 10:18:58

-NAME StructuredTimestampConcatenateString
-QUERY MATCH (a:person) RETURN concat(concat('Register Time: ', string(a.registerTime)), ' test')
---- 8
Register Time: 1911-08-20 02:32:21 test
Register Time: 1972-07-31 13:22:30.678559 test
Register Time: 1976-12-23 04:41:42 test
Register Time: 1976-12-23 11:21:42 test
Register Time: 2008-11-03 15:25:30.000526 test
Register Time: 2011-08-20 11:25:30 test
Register Time: 2023-02-21 13:25:30 test
Register Time: 2031-11-30 12:25:30 test

-NAME castToTimestamp
-QUERY MATCH (o:organisation) RETURN timestamp(o.unstrStringProp1)
---- 3


1955-11-23 15:22:31

-NAME StructuredTimestampExtractYearFuncTest
-QUERY MATCH (p:person) RETURN date_part("yeAr", p.registerTime)
---- 8
2011
2008
1911
2031
1976
1972
1976
2023

-NAME UnstructuredTimestampExtractYearFuncTest
-QUERY MATCH (p:person) RETURN date_part("Y", p.unstrTimestampProp1)
---- 8
2031
1946
1962
2023





-NAME StructuredTimestampExtractMicroFuncTest
-QUERY MATCH (p:person) RETURN date_part("microSeconds", p.registerTime)
---- 8
30000000
30000526
21000000
30000000
42000000
30678559
42000000
30000000

-NAME UnstructuredTimestampExtractMicroFuncTest
-QUERY MATCH (p:person) RETURN date_part("microsecond", p.unstrTimestampProp2)
---- 8
42000000
30000526







-NAME StructuredTimestampExtractMsFuncTest
-QUERY MATCH (p:person) RETURN date_part("millisEcond", p.registerTime)
---- 8
30000
30000
21000
30000
42000
30678
42000
30000

-NAME UnstructuredTimestampExtractMsFuncTest
-QUERY MATCH (p:person) RETURN date_part("miLlisEconds", p.unstrTimestampProp2)
---- 8
42000
30000







-NAME StructuredTimestampExtractSecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("seConds", p.registerTime)
---- 8
30
30
21
30
42
30
42
30

-NAME UnstructuredTimestampExtractSecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("seCOND", p.unstrTimestampProp2)
---- 8
42
30







-NAME StructuredTimestampExtractMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_part("minute", p.registerTime)
---- 8
25
25
32
25
21
22
41
25

-NAME UnstructuredTimestampExtractMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_part("miNutes", p.unstrTimestampProp2)
---- 8
21
25







-NAME StructuredTimestampExtractHourFuncTest
-QUERY MATCH (p:person) RETURN date_part("hours", p.registerTime)
---- 8
11
15
2
12
11
13
4
13

-NAME UnstructuredTimestampExtractHourFuncTest
-QUERY MATCH (p:person) RETURN date_part("Hour", p.unstrTimestampProp2)
---- 8
11
13







-NAME StructuredTimestampTruncDayFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Day", p.registerTime)
---- 8
2011-08-20 00:00:00
2008-11-03 00:00:00
1911-08-20 00:00:00
2031-11-30 00:00:00
1976-12-23 00:00:00
1972-07-31 00:00:00
1976-12-23 00:00:00
2023-02-21 00:00:00

-NAME UnstructuredTimestampTruncDayFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("daY", p.unstrTimestampProp2)
---- 8
1976-12-23 00:00:00
2008-11-03 00:00:00







-NAME StructuredTimestampTruncMicrosecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("MIcroseCond", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30.000526
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30.678559
1976-12-23 04:41:42
2023-02-21 13:25:30

-NAME UnstructuredTimestampTruncMicrosecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("MIcroseconds", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:42
2008-11-03 13:25:30.000526







-NAME StructuredTimestampTruncMillisecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("mIlliSecond", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30.678
1976-12-23 04:41:42
2023-02-21 13:25:30

-NAME UnstructuredTimestampTruncMillisecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("mIlliSeconds", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:42
2008-11-03 13:25:30







-NAME StructuredTimestampTruncSecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("secOnds", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30
1976-12-23 04:41:42
2023-02-21 13:25:30

-NAME UnstructuredTimestampTruncSecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("secondS", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:42
2008-11-03 13:25:30







-NAME StructuredTimestampTruncMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Minutes", p.registerTime)
---- 8
2011-08-20 11:25:00
2008-11-03 15:25:00
1911-08-20 02:32:00
2031-11-30 12:25:00
1976-12-23 11:21:00
1972-07-31 13:22:00
1976-12-23 04:41:00
2023-02-21 13:25:00

-NAME UnstructuredTimestampTruncMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("minutes", p.unstrTimestampProp2)
---- 8
1976-12-23 11:21:00
2008-11-03 13:25:00







-NAME StructuredTimestampTruncHourFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Hours", p.registerTime)
---- 8
2011-08-20 11:00:00
2008-11-03 15:00:00
1911-08-20 02:00:00
2031-11-30 12:00:00
1976-12-23 11:00:00
1972-07-31 13:00:00
1976-12-23 04:00:00
2023-02-21 13:00:00

-NAME UnstructuredTimestampTruncHourFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("houRs", p.unstrTimestampProp2)
---- 8
1976-12-23 11:00:00
2008-11-03 13:00:00







-NAME StructuredTimestampCenturyFuncTest
-QUERY MATCH (p:person) RETURN century(p.registerTime)
---- 8
21
21
20
21
20
20
20
21

-NAME UnstructuredTimestampCenturyFuncTest
-QUERY MATCH (p:person) RETURN century(p.unstrTimestampProp2)
---- 8
20
21







-NAME StructuredTimestampDaynameFuncTest
-QUERY MATCH (p:person) RETURN dayname(p.registerTime)
---- 8
Saturday
Monday
Sunday
Sunday
Thursday
Monday
Thursday
Tuesday

-NAME UnstructuredTimestampDaynameFuncTest
-QUERY MATCH (p:person) RETURN dayname(p.unstrTimestampProp2)
---- 8
Thursday
Monday







-NAME StructuredTimestampMonthNameFuncTest
-QUERY MATCH (p:person) RETURN monthname(p.registerTime)
---- 8
August
November
August
November
December
July
December
February

-NAME UnstructuredTimestampMonthNameFuncTest
-QUERY MATCH (p:person) RETURN monthname(p.unstrTimestampProp2)
---- 8
December
November







-NAME StructuredTimestampLastDayFuncTest
-QUERY MATCH (p:person) RETURN last_day(p.registerTime)
---- 8
2011-08-31
2008-11-30
1911-08-31
2031-11-30
1976-12-31
1972-07-31
1976-12-31
2023-02-28

-NAME UnstructuredTimestampLastDayFuncTest
-QUERY MATCH (p:person) RETURN last_day(p.unstrTimestampProp2)
---- 8
1976-12-31
2008-11-30







-NAME StructuredInt64EpochMsFuncTest
-QUERY MATCH (p:person) RETURN epoch_ms(p.age)
---- 8
1970-01-01 00:00:00.035
1970-01-01 00:00:00.03
1970-01-01 00:00:00.045
1970-01-01 00:00:00.02
1970-01-01 00:00:00.02
1970-01-01 00:00:00.025
1970-01-01 00:00:00.04
1970-01-01 00:00:00.083

-NAME UnstructuredInt64EpochMsFuncTest
-QUERY MATCH (p:person) RETURN epoch_ms(p.unstrInt64Prop)
---- 8
1970-01-06 05:20:44.124
1970-01-01 01:15:41.124
1970-01-01 01:13:32.124






-NAME StructuredInt64ToTimestampFuncTest
-QUERY MATCH (p:person) RETURN to_timestamp(p.age)
---- 8
1970-01-01 00:00:35
1970-01-01 00:00:30
1970-01-01 00:00:45
1970-01-01 00:00:20
1970-01-01 00:00:20
1970-01-01 00:00:25
1970-01-01 00:00:40
1970-01-01 00:01:23

-NAME UnstructuredInt64ToTimestampFuncTest
-QUERY MATCH (p:person) RETURN to_timestamp(p.unstrInt64Prop)
---- 8
1984-04-19 17:35:24
1970-02-22 13:25:24
1970-02-21 01:35:24






-NAME StructuredTimestampGreatestFuncTest
-QUERY MATCH (p:person) RETURN greatest(p.registerTime, timestamp("2006-02-12 11:25:33"))
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30.000526
2006-02-12 11:25:33
2031-11-30 12:25:30
2006-02-12 11:25:33
2006-02-12 11:25:33
2006-02-12 11:25:33
2023-02-21 13:25:30

-NAME UnstructuredTimestampGreatestFuncTest
-QUERY MATCH (p:person) RETURN greatest(p.unstrTimestampProp2, timestamp("1986-02-12 11:25:33"))
---- 8
1986-02-12 11:25:33
2008-11-03 13:25:30.000526







-NAME StructuredTimestampLeastFuncTest
-QUERY MATCH (p:person) RETURN least(p.registerTime, timestamp("2006-02-12 11:25:33"))
---- 8
2006-02-12 11:25:33
2006-02-12 11:25:33
1911-08-20 02:32:21
2006-02-12 11:25:33
1976-12-23 11:21:42
1972-07-31 13:22:30.678559
1976-12-23 04:41:42
2006-02-12 11:25:33

-NAME UnstructuredTimestampLeastFuncTest
-QUERY MATCH (p:person) RETURN least(p.unstrTimestampProp2, timestamp("1986-02-12 11:25:33"))
---- 8
1976-12-23 11:21:42
1986-02-12 11:25:33







-NAME StructuredTimestampComparisonAcrossNodesNonEquality
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime <> b.registerTime RETURN COUNT(*)
---- 1
14

-NAME StructuredTimestampComparisonAcrossNodesLessThan
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime < b.registerTime RETURN COUNT(*)
---- 1
6

-NAME StructuredTimestampComparisonAcrossNodesLessThanOrEqualTo
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime <= b.registerTime RETURN COUNT(*)
---- 1
6

-NAME StructuredTimestampComparisonAcrossNodesGreaterThan
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime > b.registerTime RETURN COUNT(*)
---- 1
8

-NAME TimestampLiteralGreaterThanComparison
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE b.registerTime > timestamp('2005-11-03 13:25:30.000526') RETURN COUNT(*)
-ENUMERATE
---- 1
9

-NAME TimestampLiteralLessThanComparison
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime < timestamp('1979-08-25 19:07:22') RETURN COUNT(*)
-ENUMERATE
---- 1
4

-NAME StructuredTimestampComparisonAcrossNodesEquality
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime = b.registerTime RETURN COUNT(*)
-ENUMERATE
---- 1
0

-NAME StructuredTimestampComparisonAcrossNodesGreaterThanOrEqualTo
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime >= b.registerTime RETURN COUNT(*)
-ENUMERATE
---- 1
8

-NAME StructuredTimestampComparisonAcrossEdges
-QUERY MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person) WHERE e1.meetTime = e2.meetTime AND id(a) <> id(c) RETURN COUNT(*)
-ENUMERATE
---- 1
2

-NAME StructuredTimestampComparisonAcrossEdgeAndNode
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime > e1.meetTime  RETURN COUNT(*)
-ENUMERATE
---- 1
7
