-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FunctionTimestamp

-NAME TimestampLiteralEqualityComparison
-QUERY MATCH (a:person) WHERE a.registerTime = timestamp('1976-12-23 11:21:42') RETURN COUNT(*)
---- 1
1

-NAME TimestampDateNotEqual
-QUERY MATCH (a:person) WHERE date_trunc("daY", a.registerTime) <> date('1976-12-23') RETURN COUNT(*)
---- 1
6

-NAME TimestampDateGreaterThan
-QUERY MATCH (a:person) WHERE a.registerTime > date('1976-12-23') RETURN COUNT(*)
---- 1
6

-NAME TimestampDateGreaterThanEqual
-QUERY MATCH (a:person) WHERE a.registerTime >= date('1976-12-23') RETURN COUNT(*)
---- 1
6

-NAME TimestampDateLessThan
-QUERY MATCH (a:person) WHERE a.registerTime < date('1976-12-23') RETURN COUNT(*)
---- 1
2

-NAME TimestampDateLessThanEqual
-QUERY MATCH (a:person) WHERE a.registerTime <= date('1976-12-23') RETURN COUNT(*)
---- 1
2

-NAME StructuredTimestampArithmeticAddInterval1
-QUERY MATCH (a:person) RETURN a.registerTime + interval('47 hours 30 minutes 30 seconds')
---- 8
1911-08-22 02:02:51
1972-08-02 12:53:00.678559
1976-12-25 04:12:12
1976-12-25 10:52:12
2008-11-05 14:56:00.000526
2011-08-22 10:56:00
2023-02-23 12:56:00
2031-12-02 11:56:00


-NAME StructuredTimestampArithmeticAddInterval2
-QUERY MATCH (a:person) RETURN a.registerTime + interval('2 years 3 days 34 h 28 minutes 300 milliseconds 20 us')
---- 8
1913-08-24 13:00:21.30002
1974-08-04 23:50:30.978579
1978-12-27 15:09:42.30002
1978-12-27 21:49:42.30002
2010-11-08 01:53:30.300546
2013-08-24 21:53:30.30002
2025-02-25 23:53:30.30002
2033-12-04 22:53:30.30002

-NAME StructuredTimestampArithmeticSubtractInterval
-QUERY MATCH (a:person) RETURN a.registerTime - interval('12 years 7 months 10 days 20 h 30 m 100 us')
---- 8
1899-01-09 06:02:20.9999
1959-12-20 16:52:30.678459
1964-05-12 08:11:41.9999
1964-05-12 14:51:41.9999
1996-03-23 18:55:30.000426
1999-01-09 14:55:29.9999
2010-07-10 16:55:29.9999
2019-04-19 15:55:29.9999

-NAME StructuredTimestampArithmeticSubtractTimestamp
-QUERY MATCH (a:person) RETURN a.registerTime - timestamp('2013-01-02 14:22:31.45612')
---- 8
-37026 days -11:50:10.45612
-14765 days -01:00:00.777561
-13159 days -09:40:49.45612
-13159 days -03:00:49.45612
-1520 days -22:57:01.455594
-501 days -02:57:01.45612
3701 days 23:02:58.54388
6905 days 22:02:58.54388

-NAME StructuredTimestampMixedArithmeticOperations
-QUERY MATCH (a:person) RETURN a.registerTime + interval('2 hours 48 minutes 1000 seconds') - interval('188 days 48 hours') - timestamp('1976-01-02 13:44:12')
---- 8
-23701 days -08:07:11
-1439 days -21:17:01.321441
165 days 18:02:10
166 days 00:42:10
11804 days 04:45:58.000526
12824 days 00:45:58
17027 days 02:45:58
20231 days 01:45:58

-NAME StructuredTimestampConcatenateString
-QUERY MATCH (a:person) RETURN concat(concat('Register Time: ', string(a.registerTime)), ' test')
---- 8
Register Time: 1911-08-20 02:32:21 test
Register Time: 1972-07-31 13:22:30.678559 test
Register Time: 1976-12-23 04:41:42 test
Register Time: 1976-12-23 11:21:42 test
Register Time: 2008-11-03 15:25:30.000526 test
Register Time: 2011-08-20 11:25:30 test
Register Time: 2023-02-21 13:25:30 test
Register Time: 2031-11-30 12:25:30 test

-NAME StructuredTimestampExtractYearFuncTest
-QUERY MATCH (p:person) RETURN date_part("yeAr", p.registerTime)
---- 8
2011
2008
1911
2031
1976
1972
1976
2023

-NAME StructuredTimestampExtractMicroFuncTest
-QUERY MATCH (p:person) RETURN date_part("microSeconds", p.registerTime)
---- 8
30000000
30000526
21000000
30000000
42000000
30678559
42000000
30000000

-NAME StructuredTimestampExtractMsFuncTest
-QUERY MATCH (p:person) RETURN date_part("millisEcond", p.registerTime)
---- 8
30000
30000
21000
30000
42000
30678
42000
30000

-NAME StructuredTimestampExtractSecondFuncTest
-QUERY MATCH (p:person) RETURN date_part("seConds", p.registerTime)
---- 8
30
30
21
30
42
30
42
30

-NAME StructuredTimestampExtractMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_part("minute", p.registerTime)
---- 8
25
25
32
25
21
22
41
25

-NAME StructuredTimestampExtractHourFuncTest
-QUERY MATCH (p:person) RETURN date_part("hours", p.registerTime)
---- 8
11
15
2
12
11
13
4
13

-NAME StructuredTimestampTruncDayFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Day", p.registerTime)
---- 8
2011-08-20 00:00:00
2008-11-03 00:00:00
1911-08-20 00:00:00
2031-11-30 00:00:00
1976-12-23 00:00:00
1972-07-31 00:00:00
1976-12-23 00:00:00
2023-02-21 00:00:00

-NAME StructuredTimestampTruncMicrosecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("MIcroseCond", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30.000526
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30.678559
1976-12-23 04:41:42
2023-02-21 13:25:30

-NAME StructuredTimestampTruncMillisecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("mIlliSecond", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30.678
1976-12-23 04:41:42
2023-02-21 13:25:30

-NAME StructuredTimestampTruncSecondsFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("secOnds", p.registerTime)
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30
1911-08-20 02:32:21
2031-11-30 12:25:30
1976-12-23 11:21:42
1972-07-31 13:22:30
1976-12-23 04:41:42
2023-02-21 13:25:30

-NAME StructuredTimestampTruncMinuteFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Minutes", p.registerTime)
---- 8
2011-08-20 11:25:00
2008-11-03 15:25:00
1911-08-20 02:32:00
2031-11-30 12:25:00
1976-12-23 11:21:00
1972-07-31 13:22:00
1976-12-23 04:41:00
2023-02-21 13:25:00

-NAME StructuredTimestampTruncHourFuncTest
-QUERY MATCH (p:person) RETURN date_trunc("Hours", p.registerTime)
---- 8
2011-08-20 11:00:00
2008-11-03 15:00:00
1911-08-20 02:00:00
2031-11-30 12:00:00
1976-12-23 11:00:00
1972-07-31 13:00:00
1976-12-23 04:00:00
2023-02-21 13:00:00

-NAME StructuredTimestampCenturyFuncTest
-QUERY MATCH (p:person) RETURN century(p.registerTime)
---- 8
21
21
20
21
20
20
20
21

-NAME StructuredTimestampDaynameFuncTest
-QUERY MATCH (p:person) RETURN dayname(p.registerTime)
---- 8
Saturday
Monday
Sunday
Sunday
Thursday
Monday
Thursday
Tuesday

-NAME StructuredTimestampMonthNameFuncTest
-QUERY MATCH (p:person) RETURN monthname(p.registerTime)
---- 8
August
November
August
November
December
July
December
February

-NAME StructuredTimestampLastDayFuncTest
-QUERY MATCH (p:person) RETURN last_day(p.registerTime)
---- 8
2011-08-31
2008-11-30
1911-08-31
2031-11-30
1976-12-31
1972-07-31
1976-12-31
2023-02-28

-NAME StructuredInt64EpochMsFuncTest
-QUERY MATCH (p:person) RETURN epoch_ms(p.age)
---- 8
1970-01-01 00:00:00.035
1970-01-01 00:00:00.03
1970-01-01 00:00:00.045
1970-01-01 00:00:00.02
1970-01-01 00:00:00.02
1970-01-01 00:00:00.025
1970-01-01 00:00:00.04
1970-01-01 00:00:00.083

-NAME StructuredInt64ToTimestampFuncTest
-QUERY MATCH (p:person) RETURN to_timestamp(p.age)
---- 8
1970-01-01 00:00:35
1970-01-01 00:00:30
1970-01-01 00:00:45
1970-01-01 00:00:20
1970-01-01 00:00:20
1970-01-01 00:00:25
1970-01-01 00:00:40
1970-01-01 00:01:23

-NAME StructuredTimestampGreatestFuncTest
-QUERY MATCH (p:person) RETURN greatest(p.registerTime, timestamp("2006-02-12 11:25:33"))
---- 8
2011-08-20 11:25:30
2008-11-03 15:25:30.000526
2006-02-12 11:25:33
2031-11-30 12:25:30
2006-02-12 11:25:33
2006-02-12 11:25:33
2006-02-12 11:25:33
2023-02-21 13:25:30

-NAME StructuredTimestampLeastFuncTest
-QUERY MATCH (p:person) RETURN least(p.registerTime, timestamp("2006-02-12 11:25:33"))
---- 8
2006-02-12 11:25:33
2006-02-12 11:25:33
1911-08-20 02:32:21
2006-02-12 11:25:33
1976-12-23 11:21:42
1972-07-31 13:22:30.678559
1976-12-23 04:41:42
2006-02-12 11:25:33

-NAME StructuredTimestampComparisonAcrossNodesNonEquality
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime <> b.registerTime RETURN COUNT(*)
---- 1
14

-NAME StructuredTimestampComparisonAcrossNodesLessThan
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime < b.registerTime RETURN COUNT(*)
---- 1
6

-NAME StructuredTimestampComparisonAcrossNodesLessThanOrEqualTo
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime <= b.registerTime RETURN COUNT(*)
---- 1
6

-NAME StructuredTimestampComparisonAcrossNodesGreaterThan
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime > b.registerTime RETURN COUNT(*)
---- 1
8

-NAME TimestampLiteralGreaterThanComparison
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE b.registerTime > timestamp('2005-11-03 13:25:30.000526') RETURN COUNT(*)
-ENUMERATE
---- 1
9

-NAME TimestampLiteralLessThanComparison
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime < timestamp('1979-08-25 19:07:22') RETURN COUNT(*)
-ENUMERATE
---- 1
4

-NAME StructuredTimestampComparisonAcrossNodesEquality
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime = b.registerTime RETURN COUNT(*)
-ENUMERATE
---- 1
0

-NAME StructuredTimestampComparisonAcrossNodesGreaterThanOrEqualTo
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime >= b.registerTime RETURN COUNT(*)
-ENUMERATE
---- 1
8

-NAME StructuredTimestampComparisonAcrossEdges
-QUERY MATCH (a:person)<-[e1:knows]-(b:person)-[e2:knows]->(c:person) WHERE e1.meetTime = e2.meetTime AND id(a) <> id(c) RETURN COUNT(*)
-ENUMERATE
---- 1
2

-NAME StructuredTimestampComparisonAcrossEdgeAndNode
-QUERY MATCH (a:person)-[e1:knows]->(b:person) WHERE a.registerTime > e1.meetTime  RETURN COUNT(*)
-ENUMERATE
---- 1
7
