-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FunctionUnion

-LOG UnionValueOnLiteral
-STATEMENT RETURN union_value(age := 36)
---- 1
36

-LOG UnionValueOnExpr
-STATEMENT MATCH (p:person)-[:knows]->(p1:person) return union_value(age := p.age) AS u1, union_value(age := p1.age) AS u2
---- 14
35|30
35|45
35|20
30|35
30|45
30|20
45|35
45|30
45|20
20|35
20|30
20|45
20|25
20|40

-LOG UnionValueOnList
-STATEMENT MATCH (p:person) RETURN union_value(workedHours := p.workedHours)
---- 8
[10,5]
[12,8]
[4,5]
[1,9]
[2]
[3,4,5,6,7]
[1]
[10,11,12,3,4,5,6,7]

-LOG UnionTagOnLiteral
-STATEMENT RETURN union_tag(union_value(numTuples := 100))
---- 1
numTuples

-LOG UnionTagOnLongString
-STATEMENT RETURN union_tag(union_value(longStringField := "This is a long string"))
---- 1
longStringField

-LOG UnionTagOnExpr
-STATEMENT MATCH (p:person)-[:knows]->(p1:person) return union_tag(union_value(age := p.age)), union_tag(union_value(PERSON_id := p1.ID))
---- 14
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id
age|PERSON_id

-LOG UnionExtractOnLiteral
-STATEMENT RETURN union_extract(union_value(numTuples := 100), 'numTuples')
---- 1
100

-LOG UnionExtractOnFlatUnflatExpr
-STATEMENT MATCH (p:person)-[:knows]->(p1:person) return union_extract(union_value(age := p.age), 'age') AS a, union_extract(union_value(age := p1.age), 'age') AS b
---- 14
35|30
35|45
35|20
30|35
30|45
30|20
45|35
45|30
45|20
20|35
20|30
20|45
20|25
20|40
