-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE FunctionUnion

-NAME UnionValueOnLiteral
-QUERY RETURN union_value(age := 36)
---- 1
36

-NAME UnionValueOnExpr
-QUERY MATCH (p:person)-[:knows]->(p1:person) return union_value(age := p.age), union_value(age := p1.age)
---- 14
35|30
35|45
35|20
30|35
30|45
30|20
45|35
45|30
45|20
20|35
20|30
20|45
20|25
20|40

-NAME UnionValueOnList
-QUERY MATCH (p:person) RETURN union_value(workedHours := p.workedHours)
---- 8
[10,5]
[12,8]
[4,5]
[1,9]
[2]
[3,4,5,6,7]
[1]
[10,11,12,3,4,5,6,7]

-NAME UnionTagOnLiteral
-QUERY RETURN union_tag(union_value(numTuples := 100))
---- 1
NUMTUPLES

-NAME UnionTagOnLongString
-QUERY RETURN union_tag(union_value(longStringField := "This is a long string"))
---- 1
LONGSTRINGFIELD

-NAME UnionTagOnExpr
-QUERY MATCH (p:person)-[:knows]->(p1:person) return union_tag(union_value(age := p.age)), union_tag(union_value(PERSON_id := p1.ID))
---- 14
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID
AGE|PERSON_ID

-NAME UnionExtractOnLiteral
-QUERY RETURN union_extract(union_value(numTuples := 100), 'numTuples')
---- 1
100

-NAME UnionExtractOnFlatUnflatExpr
-QUERY MATCH (p:person)-[:knows]->(p1:person) return union_extract(union_value(age := p.age), 'age'), union_extract(union_value(age := p1.age), 'age')
---- 14
35|30
35|45
35|20
30|35
30|45
30|20
45|35
45|30
45|20
20|35
20|30
20|45
20|25
20|40
