-NAME SingleSourceWithAllProperties
-QUERY MATCH p = (a:person)-[:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' RETURN *
---- 7
1|(label:person, 0:1, {ID:2, fName:Bob, gender:2, isStudent:True, isWorker:False, age:30, eyeSight:5.100000, birthdate:1900-01-01, registerTime:2008-11-03 15:25:30.000526, lastJobDuration:10 years 5 months 13:00:00.000024, workedHours:[12,8], usedNames:[Bobby], courseScoresPerTerm:[[8,9],[9,10]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
1|(label:person, 0:2, {ID:3, fName:Carol, gender:1, isStudent:False, isWorker:True, age:45, eyeSight:5.000000, birthdate:1940-06-22, registerTime:1911-08-20 02:32:21, lastJobDuration:48:24:11, workedHours:[4,5], usedNames:[Carmen,Fred], courseScoresPerTerm:[[8,10]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
1|(label:person, 0:3, {ID:5, fName:Dan, gender:2, isStudent:False, isWorker:True, age:20, eyeSight:4.800000, birthdate:1950-07-23, registerTime:2031-11-30 12:25:30, lastJobDuration:10 years 5 months 13:00:00.000024, workedHours:[1,9], usedNames:[Wolfeschlegelstein,Daniel], courseScoresPerTerm:[[7,4],[8,8],[9]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
2|(label:person, 0:4, {ID:7, fName:Elizabeth, gender:1, isStudent:False, isWorker:True, age:20, eyeSight:4.700000, birthdate:1980-10-26, registerTime:1976-12-23 11:21:42, lastJobDuration:48:24:11, workedHours:[2], usedNames:[Ein], courseScoresPerTerm:[[6],[7],[8]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
3|(label:person, 0:5, {ID:8, fName:Farooq, gender:2, isStudent:True, isWorker:False, age:25, eyeSight:4.500000, birthdate:1980-10-26, registerTime:1972-07-31 13:22:30.678559, lastJobDuration:00:18:00.024, workedHours:[3,4,5,6,7], usedNames:[Fesdwe], courseScoresPerTerm:[[8]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
3|(label:person, 0:6, {ID:9, fName:Greg, gender:2, isStudent:False, isWorker:False, age:40, eyeSight:4.900000, birthdate:1980-10-26, registerTime:1976-12-23 04:41:42, lastJobDuration:10 years 5 months 13:00:00.000024, workedHours:[1], usedNames:[Grad], courseScoresPerTerm:[[10]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
3|(label:person, 0:7, {ID:10, fName:Hubert Blaine Wolfeschlegelsteinhausenbergerdorff, gender:2, isStudent:False, isWorker:True, age:83, eyeSight:4.900000, birthdate:1990-11-27, registerTime:2023-02-21 13:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,11,12,3,4,5,6,7], usedNames:[Ad,De,Hi,Kye,Orlan], courseScoresPerTerm:[[7],[10],[6,7]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})

-NAME SingleSourceSingleDestinationQuery1
-QUERY MATCH p = (a:person)-[:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' AND b.fName = 'Bob' RETURN a.fName, b.fName, p.length
---- 1
Alice|Bob|1

-NAME SingleSourceAllDestinationsQuery2
-QUERY MATCH p = (a:person)-[:knows* SHORTEST 1..2]->(b:person) WHERE a.fName = 'Elizabeth' RETURN a.fName, b.fName, p.length
---- 5
Elizabeth|Alice|2
Elizabeth|Dan|2
Elizabeth|Farooq|1
Elizabeth|Greg|1
Elizabeth|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|1

-NAME SingleSourceUnreachableDestination
-QUERY MATCH p = (a:person)-[:knows* SHORTEST]->(b:person) WHERE a.fName = 'Alice' AND b.fName = 'Alice11' RETURN a.fName, b.fName, p.length
---- 0

-NAME AllSourcesSingleDestinationQuery
-QUERY MATCH p = (a:person)-[:knows* SHORTEST 1..30]->(b:person) WHERE b.fName = 'Alice' RETURN a.fName, b.fName, p.length
----- 6
Bob|Alice|1
Carol|Alice|1
Dan|Alice|1
Elizabeth|Alice|2
Farooq|Alice|2
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|Alice|1

-NAME MultipleSrcMultipleDstQuery
-QUERY MATCH p = (a:person)-[:knows* SHORTEST 1..10]->(b:person) WHERE a.isStudent = true AND b.isWorker = true RETURN a.fName, b.fName, p.length
----- 12
Alice|Carol|1
Alice|Dan|1
Alice|Elizabeth|2
Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|3
Bob|Carol|1
Bob|Dan|1
Bob|Elizabeth|1
Bob|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2
Farooq|Carol|3
Farooq|Dan|2
Farooq|Elizabeth|1
Farooq|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|1


# Runs queries on a larger dataset (refer to dataset/shortest-path-tests/eKnows.csv in this folder for rel edges)
# Alice11 connected to -> 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
# Alice12 connected to -> 13, 14, 15, 16, 17, 18, 19, 20, 21, 22
# This pattern is continued till Alice2500. Distance between Alice11 and Alice22 is 2, and so on.
# Distance between Alice11 and Alice100 is 9 because 11 -> 11,20,30,40,50,60,70,80,90,100
-NAME SingleSrcAllDstQueryLarge
-QUERY MATCH p = (a:person)-[:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice11' RETURN a.fName, b.fName, p.length
---- 300
Alice11|Alice100|9
Alice11|Alice101|9
Alice11|Alice102|10
Alice11|Alice103|10
Alice11|Alice104|10
Alice11|Alice105|10
Alice11|Alice106|10
Alice11|Alice107|10
Alice11|Alice108|10
Alice11|Alice109|10
Alice11|Alice110|10
Alice11|Alice111|10
Alice11|Alice112|11
Alice11|Alice113|11
Alice11|Alice114|11
Alice11|Alice115|11
Alice11|Alice116|11
Alice11|Alice117|11
Alice11|Alice118|11
Alice11|Alice119|11
Alice11|Alice120|11
Alice11|Alice121|11
Alice11|Alice122|12
Alice11|Alice123|12
Alice11|Alice124|12
Alice11|Alice125|12
Alice11|Alice126|12
Alice11|Alice127|12
Alice11|Alice128|12
Alice11|Alice129|12
Alice11|Alice12|1
Alice11|Alice130|12
Alice11|Alice131|12
Alice11|Alice132|13
Alice11|Alice133|13
Alice11|Alice134|13
Alice11|Alice135|13
Alice11|Alice136|13
Alice11|Alice137|13
Alice11|Alice138|13
Alice11|Alice139|13
Alice11|Alice13|1
Alice11|Alice140|13
Alice11|Alice141|13
Alice11|Alice142|14
Alice11|Alice143|14
Alice11|Alice144|14
Alice11|Alice145|14
Alice11|Alice146|14
Alice11|Alice147|14
Alice11|Alice148|14
Alice11|Alice149|14
Alice11|Alice14|1
Alice11|Alice150|14
Alice11|Alice151|14
Alice11|Alice152|15
Alice11|Alice153|15
Alice11|Alice154|15
Alice11|Alice155|15
Alice11|Alice156|15
Alice11|Alice157|15
Alice11|Alice158|15
Alice11|Alice159|15
Alice11|Alice15|1
Alice11|Alice160|15
Alice11|Alice161|15
Alice11|Alice162|16
Alice11|Alice163|16
Alice11|Alice164|16
Alice11|Alice165|16
Alice11|Alice166|16
Alice11|Alice167|16
Alice11|Alice168|16
Alice11|Alice169|16
Alice11|Alice16|1
Alice11|Alice170|16
Alice11|Alice171|16
Alice11|Alice172|17
Alice11|Alice173|17
Alice11|Alice174|17
Alice11|Alice175|17
Alice11|Alice176|17
Alice11|Alice177|17
Alice11|Alice178|17
Alice11|Alice179|17
Alice11|Alice17|1
Alice11|Alice180|17
Alice11|Alice181|17
Alice11|Alice182|18
Alice11|Alice183|18
Alice11|Alice184|18
Alice11|Alice185|18
Alice11|Alice186|18
Alice11|Alice187|18
Alice11|Alice188|18
Alice11|Alice189|18
Alice11|Alice18|1
Alice11|Alice190|18
Alice11|Alice191|18
Alice11|Alice192|19
Alice11|Alice193|19
Alice11|Alice194|19
Alice11|Alice195|19
Alice11|Alice196|19
Alice11|Alice197|19
Alice11|Alice198|19
Alice11|Alice199|19
Alice11|Alice19|1
Alice11|Alice200|19
Alice11|Alice201|19
Alice11|Alice202|20
Alice11|Alice203|20
Alice11|Alice204|20
Alice11|Alice205|20
Alice11|Alice206|20
Alice11|Alice207|20
Alice11|Alice208|20
Alice11|Alice209|20
Alice11|Alice20|1
Alice11|Alice210|20
Alice11|Alice211|20
Alice11|Alice212|21
Alice11|Alice213|21
Alice11|Alice214|21
Alice11|Alice215|21
Alice11|Alice216|21
Alice11|Alice217|21
Alice11|Alice218|21
Alice11|Alice219|21
Alice11|Alice21|1
Alice11|Alice220|21
Alice11|Alice221|21
Alice11|Alice222|22
Alice11|Alice223|22
Alice11|Alice224|22
Alice11|Alice225|22
Alice11|Alice226|22
Alice11|Alice227|22
Alice11|Alice228|22
Alice11|Alice229|22
Alice11|Alice22|2
Alice11|Alice230|22
Alice11|Alice231|22
Alice11|Alice232|23
Alice11|Alice233|23
Alice11|Alice234|23
Alice11|Alice235|23
Alice11|Alice236|23
Alice11|Alice237|23
Alice11|Alice238|23
Alice11|Alice239|23
Alice11|Alice23|2
Alice11|Alice240|23
Alice11|Alice241|23
Alice11|Alice242|24
Alice11|Alice243|24
Alice11|Alice244|24
Alice11|Alice245|24
Alice11|Alice246|24
Alice11|Alice247|24
Alice11|Alice248|24
Alice11|Alice249|24
Alice11|Alice24|2
Alice11|Alice250|24
Alice11|Alice251|24
Alice11|Alice252|25
Alice11|Alice253|25
Alice11|Alice254|25
Alice11|Alice255|25
Alice11|Alice256|25
Alice11|Alice257|25
Alice11|Alice258|25
Alice11|Alice259|25
Alice11|Alice25|2
Alice11|Alice260|25
Alice11|Alice261|25
Alice11|Alice262|26
Alice11|Alice263|26
Alice11|Alice264|26
Alice11|Alice265|26
Alice11|Alice266|26
Alice11|Alice267|26
Alice11|Alice268|26
Alice11|Alice269|26
Alice11|Alice26|2
Alice11|Alice270|26
Alice11|Alice271|26
Alice11|Alice272|27
Alice11|Alice273|27
Alice11|Alice274|27
Alice11|Alice275|27
Alice11|Alice276|27
Alice11|Alice277|27
Alice11|Alice278|27
Alice11|Alice279|27
Alice11|Alice27|2
Alice11|Alice280|27
Alice11|Alice281|27
Alice11|Alice282|28
Alice11|Alice283|28
Alice11|Alice284|28
Alice11|Alice285|28
Alice11|Alice286|28
Alice11|Alice287|28
Alice11|Alice288|28
Alice11|Alice289|28
Alice11|Alice28|2
Alice11|Alice290|28
Alice11|Alice291|28
Alice11|Alice292|29
Alice11|Alice293|29
Alice11|Alice294|29
Alice11|Alice295|29
Alice11|Alice296|29
Alice11|Alice297|29
Alice11|Alice298|29
Alice11|Alice299|29
Alice11|Alice29|2
Alice11|Alice300|29
Alice11|Alice301|29
Alice11|Alice302|30
Alice11|Alice303|30
Alice11|Alice304|30
Alice11|Alice305|30
Alice11|Alice306|30
Alice11|Alice307|30
Alice11|Alice308|30
Alice11|Alice309|30
Alice11|Alice30|2
Alice11|Alice310|30
Alice11|Alice311|30
Alice11|Alice31|2
Alice11|Alice32|3
Alice11|Alice33|3
Alice11|Alice34|3
Alice11|Alice35|3
Alice11|Alice36|3
Alice11|Alice37|3
Alice11|Alice38|3
Alice11|Alice39|3
Alice11|Alice40|3
Alice11|Alice41|3
Alice11|Alice42|4
Alice11|Alice43|4
Alice11|Alice44|4
Alice11|Alice45|4
Alice11|Alice46|4
Alice11|Alice47|4
Alice11|Alice48|4
Alice11|Alice49|4
Alice11|Alice50|4
Alice11|Alice51|4
Alice11|Alice52|5
Alice11|Alice53|5
Alice11|Alice54|5
Alice11|Alice55|5
Alice11|Alice56|5
Alice11|Alice57|5
Alice11|Alice58|5
Alice11|Alice59|5
Alice11|Alice60|5
Alice11|Alice61|5
Alice11|Alice62|6
Alice11|Alice63|6
Alice11|Alice64|6
Alice11|Alice65|6
Alice11|Alice66|6
Alice11|Alice67|6
Alice11|Alice68|6
Alice11|Alice69|6
Alice11|Alice70|6
Alice11|Alice71|6
Alice11|Alice72|7
Alice11|Alice73|7
Alice11|Alice74|7
Alice11|Alice75|7
Alice11|Alice76|7
Alice11|Alice77|7
Alice11|Alice78|7
Alice11|Alice79|7
Alice11|Alice80|7
Alice11|Alice81|7
Alice11|Alice82|8
Alice11|Alice83|8
Alice11|Alice84|8
Alice11|Alice85|8
Alice11|Alice86|8
Alice11|Alice87|8
Alice11|Alice88|8
Alice11|Alice89|8
Alice11|Alice90|8
Alice11|Alice91|8
Alice11|Alice92|9
Alice11|Alice93|9
Alice11|Alice94|9
Alice11|Alice95|9
Alice11|Alice96|9
Alice11|Alice97|9
Alice11|Alice98|9
Alice11|Alice99|9

-NAME MultipleSrcAllDstQueryLarge
-QUERY MATCH p = (a:person)-[:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice11' OR a.fName = 'Alice' RETURN a.fName, b.fName, p.length
---- 307
Alice11|Alice100|9
Alice11|Alice101|9
Alice11|Alice102|10
Alice11|Alice103|10
Alice11|Alice104|10
Alice11|Alice105|10
Alice11|Alice106|10
Alice11|Alice107|10
Alice11|Alice108|10
Alice11|Alice109|10
Alice11|Alice110|10
Alice11|Alice111|10
Alice11|Alice112|11
Alice11|Alice113|11
Alice11|Alice114|11
Alice11|Alice115|11
Alice11|Alice116|11
Alice11|Alice117|11
Alice11|Alice118|11
Alice11|Alice119|11
Alice11|Alice120|11
Alice11|Alice121|11
Alice11|Alice122|12
Alice11|Alice123|12
Alice11|Alice124|12
Alice11|Alice125|12
Alice11|Alice126|12
Alice11|Alice127|12
Alice11|Alice128|12
Alice11|Alice129|12
Alice11|Alice12|1
Alice11|Alice130|12
Alice11|Alice131|12
Alice11|Alice132|13
Alice11|Alice133|13
Alice11|Alice134|13
Alice11|Alice135|13
Alice11|Alice136|13
Alice11|Alice137|13
Alice11|Alice138|13
Alice11|Alice139|13
Alice11|Alice13|1
Alice11|Alice140|13
Alice11|Alice141|13
Alice11|Alice142|14
Alice11|Alice143|14
Alice11|Alice144|14
Alice11|Alice145|14
Alice11|Alice146|14
Alice11|Alice147|14
Alice11|Alice148|14
Alice11|Alice149|14
Alice11|Alice14|1
Alice11|Alice150|14
Alice11|Alice151|14
Alice11|Alice152|15
Alice11|Alice153|15
Alice11|Alice154|15
Alice11|Alice155|15
Alice11|Alice156|15
Alice11|Alice157|15
Alice11|Alice158|15
Alice11|Alice159|15
Alice11|Alice15|1
Alice11|Alice160|15
Alice11|Alice161|15
Alice11|Alice162|16
Alice11|Alice163|16
Alice11|Alice164|16
Alice11|Alice165|16
Alice11|Alice166|16
Alice11|Alice167|16
Alice11|Alice168|16
Alice11|Alice169|16
Alice11|Alice16|1
Alice11|Alice170|16
Alice11|Alice171|16
Alice11|Alice172|17
Alice11|Alice173|17
Alice11|Alice174|17
Alice11|Alice175|17
Alice11|Alice176|17
Alice11|Alice177|17
Alice11|Alice178|17
Alice11|Alice179|17
Alice11|Alice17|1
Alice11|Alice180|17
Alice11|Alice181|17
Alice11|Alice182|18
Alice11|Alice183|18
Alice11|Alice184|18
Alice11|Alice185|18
Alice11|Alice186|18
Alice11|Alice187|18
Alice11|Alice188|18
Alice11|Alice189|18
Alice11|Alice18|1
Alice11|Alice190|18
Alice11|Alice191|18
Alice11|Alice192|19
Alice11|Alice193|19
Alice11|Alice194|19
Alice11|Alice195|19
Alice11|Alice196|19
Alice11|Alice197|19
Alice11|Alice198|19
Alice11|Alice199|19
Alice11|Alice19|1
Alice11|Alice200|19
Alice11|Alice201|19
Alice11|Alice202|20
Alice11|Alice203|20
Alice11|Alice204|20
Alice11|Alice205|20
Alice11|Alice206|20
Alice11|Alice207|20
Alice11|Alice208|20
Alice11|Alice209|20
Alice11|Alice20|1
Alice11|Alice210|20
Alice11|Alice211|20
Alice11|Alice212|21
Alice11|Alice213|21
Alice11|Alice214|21
Alice11|Alice215|21
Alice11|Alice216|21
Alice11|Alice217|21
Alice11|Alice218|21
Alice11|Alice219|21
Alice11|Alice21|1
Alice11|Alice220|21
Alice11|Alice221|21
Alice11|Alice222|22
Alice11|Alice223|22
Alice11|Alice224|22
Alice11|Alice225|22
Alice11|Alice226|22
Alice11|Alice227|22
Alice11|Alice228|22
Alice11|Alice229|22
Alice11|Alice22|2
Alice11|Alice230|22
Alice11|Alice231|22
Alice11|Alice232|23
Alice11|Alice233|23
Alice11|Alice234|23
Alice11|Alice235|23
Alice11|Alice236|23
Alice11|Alice237|23
Alice11|Alice238|23
Alice11|Alice239|23
Alice11|Alice23|2
Alice11|Alice240|23
Alice11|Alice241|23
Alice11|Alice242|24
Alice11|Alice243|24
Alice11|Alice244|24
Alice11|Alice245|24
Alice11|Alice246|24
Alice11|Alice247|24
Alice11|Alice248|24
Alice11|Alice249|24
Alice11|Alice24|2
Alice11|Alice250|24
Alice11|Alice251|24
Alice11|Alice252|25
Alice11|Alice253|25
Alice11|Alice254|25
Alice11|Alice255|25
Alice11|Alice256|25
Alice11|Alice257|25
Alice11|Alice258|25
Alice11|Alice259|25
Alice11|Alice25|2
Alice11|Alice260|25
Alice11|Alice261|25
Alice11|Alice262|26
Alice11|Alice263|26
Alice11|Alice264|26
Alice11|Alice265|26
Alice11|Alice266|26
Alice11|Alice267|26
Alice11|Alice268|26
Alice11|Alice269|26
Alice11|Alice26|2
Alice11|Alice270|26
Alice11|Alice271|26
Alice11|Alice272|27
Alice11|Alice273|27
Alice11|Alice274|27
Alice11|Alice275|27
Alice11|Alice276|27
Alice11|Alice277|27
Alice11|Alice278|27
Alice11|Alice279|27
Alice11|Alice27|2
Alice11|Alice280|27
Alice11|Alice281|27
Alice11|Alice282|28
Alice11|Alice283|28
Alice11|Alice284|28
Alice11|Alice285|28
Alice11|Alice286|28
Alice11|Alice287|28
Alice11|Alice288|28
Alice11|Alice289|28
Alice11|Alice28|2
Alice11|Alice290|28
Alice11|Alice291|28
Alice11|Alice292|29
Alice11|Alice293|29
Alice11|Alice294|29
Alice11|Alice295|29
Alice11|Alice296|29
Alice11|Alice297|29
Alice11|Alice298|29
Alice11|Alice299|29
Alice11|Alice29|2
Alice11|Alice300|29
Alice11|Alice301|29
Alice11|Alice302|30
Alice11|Alice303|30
Alice11|Alice304|30
Alice11|Alice305|30
Alice11|Alice306|30
Alice11|Alice307|30
Alice11|Alice308|30
Alice11|Alice309|30
Alice11|Alice30|2
Alice11|Alice310|30
Alice11|Alice311|30
Alice11|Alice31|2
Alice11|Alice32|3
Alice11|Alice33|3
Alice11|Alice34|3
Alice11|Alice35|3
Alice11|Alice36|3
Alice11|Alice37|3
Alice11|Alice38|3
Alice11|Alice39|3
Alice11|Alice40|3
Alice11|Alice41|3
Alice11|Alice42|4
Alice11|Alice43|4
Alice11|Alice44|4
Alice11|Alice45|4
Alice11|Alice46|4
Alice11|Alice47|4
Alice11|Alice48|4
Alice11|Alice49|4
Alice11|Alice50|4
Alice11|Alice51|4
Alice11|Alice52|5
Alice11|Alice53|5
Alice11|Alice54|5
Alice11|Alice55|5
Alice11|Alice56|5
Alice11|Alice57|5
Alice11|Alice58|5
Alice11|Alice59|5
Alice11|Alice60|5
Alice11|Alice61|5
Alice11|Alice62|6
Alice11|Alice63|6
Alice11|Alice64|6
Alice11|Alice65|6
Alice11|Alice66|6
Alice11|Alice67|6
Alice11|Alice68|6
Alice11|Alice69|6
Alice11|Alice70|6
Alice11|Alice71|6
Alice11|Alice72|7
Alice11|Alice73|7
Alice11|Alice74|7
Alice11|Alice75|7
Alice11|Alice76|7
Alice11|Alice77|7
Alice11|Alice78|7
Alice11|Alice79|7
Alice11|Alice80|7
Alice11|Alice81|7
Alice11|Alice82|8
Alice11|Alice83|8
Alice11|Alice84|8
Alice11|Alice85|8
Alice11|Alice86|8
Alice11|Alice87|8
Alice11|Alice88|8
Alice11|Alice89|8
Alice11|Alice90|8
Alice11|Alice91|8
Alice11|Alice92|9
Alice11|Alice93|9
Alice11|Alice94|9
Alice11|Alice95|9
Alice11|Alice96|9
Alice11|Alice97|9
Alice11|Alice98|9
Alice11|Alice99|9
Alice|Bob|1
Alice|Carol|1
Alice|Dan|1
Alice|Elizabeth|2
Alice|Farooq|3
Alice|Greg|3
Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|3
