-NAME SingleSourceAllDestinationsSSP
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' RETURN a.fName, b.fName, r._length
-PARALLELISM 1
---- 7
Alice|Bob|1
Alice|Carol|1
Alice|Dan|1
Alice|Elizabeth|2
Alice|Farooq|3
Alice|Greg|3
Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|3

