-GROUP ShortestPathTest
-DATASET CSV shortest-path-tests

--

-CASE Bfs

#Alice|Bob|{_NODES: [0:0,0:1], _RELS: [1:0]}
#Alice|Carol|{_NODES: [0:0,0:2], _RELS: [1:1]}
#Alice|Dan|{_NODES: [0:0,0:3], _RELS: [1:2]}
#Alice|Elizabeth|{_NODES: [0:0,0:1,0:4], _RELS: [1:0,1:6]}
#Alice|Farooq|{_NODES: [0:0,0:1,0:4,0:5], _RELS: [1:0,1:6,1:13]}
#Alice|Greg|{_NODES: [0:0,0:1,0:4,0:6], _RELS: [1:0,1:6,1:14]}
#Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|{_NODES: [0:0,0:1,0:4,0:7], _RELS: [1:0,1:6,1:15]}
-NAME SingleSourceAllDestinationsSSP
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' RETURN a.fName, b.fName, rels(r), (nodes(r)[2]).fName
---- 7
Alice|Bob|[{_ID: 1:0}]|Bob
Alice|Carol|[{_ID: 1:1}]|Carol
Alice|Dan|[{_ID: 1:2}]|Dan
Alice|Elizabeth|[{_ID: 1:0},{_ID: 1:6}]|Bob
Alice|Farooq|[{_ID: 1:0},{_ID: 1:6},{_ID: 1:13}]|Bob
Alice|Greg|[{_ID: 1:0},{_ID: 1:6},{_ID: 1:14}]|Bob
Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|[{_ID: 1:0},{_ID: 1:6},{_ID: 1:15}]|Bob

#Bob|Alice|{_NODES: [0:0,0:1], _RELS: [1:3]}
#Carol|Alice|{_NODES: [0:0,0:2], _RELS: [1:7]}
#Dan|Alice|{_NODES: [0:0,0:3], _RELS: [1:10]}
#Elizabeth|Alice|{_NODES: [0:0,0:7,0:4], _RELS: [1:20,1:15]}
#Farooq|Alice|{_NODES: [0:0,0:7,0:5], _RELS: [1:20,1:17]}
#Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|Alice|{_NODES: [0:0,0:7], _RELS: [1:20]}
-NAME AllSourcesSingleDestinationQuery
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE b.fName = 'Alice' RETURN a.fName, b.fName, rels(r), (nodes(r)[2]).fName
---- 6
Bob|Alice|[{_ID: 1:3}]|Bob
Carol|Alice|[{_ID: 1:7}]|Carol
Dan|Alice|[{_ID: 1:10}]|Dan
Elizabeth|Alice|[{_ID: 1:20},{_ID: 1:15}]|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
Farooq|Alice|[{_ID: 1:20},{_ID: 1:17}]|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|Alice|[{_ID: 1:20}]|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff


-NAME SingleSourceWithAllProperties
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' RETURN length(r), b, a
---- 7
1|(label:person, 0:1, {ID:2, fName:Bob, gender:2, isStudent:True, isWorker:False, age:30, eyeSight:5.100000, birthdate:1900-01-01, registerTime:2008-11-03 15:25:30.000526, lastJobDuration:10 years 5 months 13:00:00.000024, workedHours:[12,8], usedNames:[Bobby], courseScoresPerTerm:[[8,9],[9,10]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
1|(label:person, 0:2, {ID:3, fName:Carol, gender:1, isStudent:False, isWorker:True, age:45, eyeSight:5.000000, birthdate:1940-06-22, registerTime:1911-08-20 02:32:21, lastJobDuration:48:24:11, workedHours:[4,5], usedNames:[Carmen,Fred], courseScoresPerTerm:[[8,10]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
1|(label:person, 0:3, {ID:5, fName:Dan, gender:2, isStudent:False, isWorker:True, age:20, eyeSight:4.800000, birthdate:1950-07-23, registerTime:2031-11-30 12:25:30, lastJobDuration:10 years 5 months 13:00:00.000024, workedHours:[1,9], usedNames:[Wolfeschlegelstein,Daniel], courseScoresPerTerm:[[7,4],[8,8],[9]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
2|(label:person, 0:4, {ID:7, fName:Elizabeth, gender:1, isStudent:False, isWorker:True, age:20, eyeSight:4.700000, birthdate:1980-10-26, registerTime:1976-12-23 11:21:42, lastJobDuration:48:24:11, workedHours:[2], usedNames:[Ein], courseScoresPerTerm:[[6],[7],[8]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
3|(label:person, 0:5, {ID:8, fName:Farooq, gender:2, isStudent:True, isWorker:False, age:25, eyeSight:4.500000, birthdate:1980-10-26, registerTime:1972-07-31 13:22:30.678559, lastJobDuration:00:18:00.024, workedHours:[3,4,5,6,7], usedNames:[Fesdwe], courseScoresPerTerm:[[8]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
3|(label:person, 0:6, {ID:9, fName:Greg, gender:2, isStudent:False, isWorker:False, age:40, eyeSight:4.900000, birthdate:1980-10-26, registerTime:1976-12-23 04:41:42, lastJobDuration:10 years 5 months 13:00:00.000024, workedHours:[1], usedNames:[Grad], courseScoresPerTerm:[[10]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})
3|(label:person, 0:7, {ID:10, fName:Hubert Blaine Wolfeschlegelsteinhausenbergerdorff, gender:2, isStudent:False, isWorker:True, age:83, eyeSight:4.900000, birthdate:1990-11-27, registerTime:2023-02-21 13:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,11,12,3,4,5,6,7], usedNames:[Ad,De,Hi,Kye,Orlan], courseScoresPerTerm:[[7],[10],[6,7]]})|(label:person, 0:0, {ID:0, fName:Alice, gender:1, isStudent:True, isWorker:False, age:35, eyeSight:5.000000, birthdate:1900-01-01, registerTime:2011-08-20 11:25:30, lastJobDuration:3 years 2 days 13:02:00, workedHours:[10,5], usedNames:[Aida], courseScoresPerTerm:[[10,8],[6,7,8]]})

-NAME SingleSourceSingleDestination
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' AND b.fName = 'Bob' RETURN a.fName, b.fName, length(r)
---- 1
Alice|Bob|1

#Elizabeth|Alice|{_NODES: [0:4,0:7,0:0], _RELS: [1:15,1:20]}
#Elizabeth|Dan|{_NODES: [0:4,0:7,0:3], _RELS: [1:15,1:21]}
#Elizabeth|Farooq|{_NODES: [0:4,0:5], _RELS: [1:13]}
#Elizabeth|Greg|{_NODES: [0:4,0:6], _RELS: [1:14]}
#Elizabeth|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|{_NODES: [0:4,0:7], _RELS: [1:15]}
-NAME SingleSourceAllDestinations2
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..2]->(b:person) WHERE a.fName = 'Elizabeth' RETURN a.fName, b.fName, rels(r), (nodes(r)[2]).fName
---- 5
Elizabeth|Alice|[{_ID: 1:15},{_ID: 1:20}]|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
Elizabeth|Dan|[{_ID: 1:15},{_ID: 1:21}]|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
Elizabeth|Farooq|[{_ID: 1:13}]|Farooq
Elizabeth|Greg|[{_ID: 1:14}]|Greg
Elizabeth|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|[{_ID: 1:15}]|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff


-NAME SingleSourceUnreachableDestination
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' AND b.fName = 'Alice11' RETURN a.fName, b.fName, r
---- 0


-NAME MultipleSrcMultipleDstQuery
-QUERY MATCH (a:person)-[r:knows* SHORTEST 1..10]->(b:person) WHERE a.isStudent = true AND b.isWorker = true RETURN a.fName, b.fName, length(r)
---- 12
Alice|Carol|1
Alice|Dan|1
Alice|Elizabeth|2
Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|3
Bob|Carol|1
Bob|Dan|1
Bob|Elizabeth|1
Bob|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2
Farooq|Carol|3
Farooq|Dan|2
Farooq|Elizabeth|1
Farooq|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|1

-NAME SSPWithExtend
-QUERY MATCH (c:person)<-[:knows* SHORTEST 1..30]-(a:person)-[r:knows* SHORTEST 1..30]->(b:person), (b)-[:knows]->(c) WHERE a.fName = 'Alice' AND b.ID < 6 AND c.ID > 5 RETURN a.fName, b.fName, c.fName
---- 1
Alice|Bob|Elizabeth

-NAME MultiPart
-QUERY MATCH (a)-[r:knows* SHORTEST 1..30]->(b:person) WHERE b.ID > 6 AND a.fName = 'Alice' WITH a, b, r MATCH (c:person)<-[:knows]-(a:person) RETURN b.fName, length(r), COUNT(*)
---- 4
Elizabeth|2|3
Farooq|3|3
Greg|3|3
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|3|3
