-GROUP ShortestPathTest
-DATASET CSV shortest-path-tests

--

-CASE BfsCSV

-LOG SingleSourceAllDestinationsSSP
-STATEMENT MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' RETURN a.fName, b.fName, properties(nodes(r), 'fName')
---- 7
Alice|Bob|[]
Alice|Carol|[]
Alice|Dan|[]
Alice|Elizabeth|[Bob]
Alice|Farooq|[Bob,Elizabeth]
Alice|Greg|[Bob,Elizabeth]
Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|[Bob,Elizabeth]

-LOG AllSourcesSingleDestinationQuery
-STATEMENT MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE b.fName = 'Alice' RETURN a.fName, b.fName, properties(nodes(r), 'usedNames')
---- 6
Bob|Alice|[]
Carol|Alice|[]
Dan|Alice|[]
Elizabeth|Alice|[[Ad,De,Hi,Kye,Orlan]]
Farooq|Alice|[[Ad,De,Hi,Kye,Orlan]]
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|Alice|[]

-LOG SingleSourceWithAllProperties
-STATEMENT MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' RETURN length(r), b.*, a.*
---- 7
1|2|Bob|2|True|False|30|5.100000|1900-01-01|2008-11-03 15:25:30.000526|10 years 5 months 13:00:00.000024|[12,8]|[Bobby]|[[8,9],[9,10]]|0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]
1|3|Carol|1|False|True|45|5.000000|1940-06-22|1911-08-20 02:32:21|48:24:11|[4,5]|[Carmen,Fred]|[[8,10]]|0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]
1|5|Dan|2|False|True|20|4.800000|1950-07-23|2031-11-30 12:25:30|10 years 5 months 13:00:00.000024|[1,9]|[Wolfeschlegelstein,Daniel]|[[7,4],[8,8],[9]]|0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]
2|7|Elizabeth|1|False|True|20|4.700000|1980-10-26|1976-12-23 11:21:42|48:24:11|[2]|[Ein]|[[6],[7],[8]]|0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]
3|10|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2|False|True|83|4.900000|1990-11-27|2023-02-21 13:25:30|3 years 2 days 13:02:00|[10,11,12,3,4,5,6,7]|[Ad,De,Hi,Kye,Orlan]|[[7],[10],[6,7]]|0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]
3|8|Farooq|2|True|False|25|4.500000|1980-10-26|1972-07-31 13:22:30.678559|00:18:00.024|[3,4,5,6,7]|[Fesdwe]|[[8]]|0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]
3|9|Greg|2|False|False|40|4.900000|1980-10-26|1976-12-23 04:41:42|10 years 5 months 13:00:00.000024|[1]|[Grad]|[[10]]|0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]

-LOG SingleSourceSingleDestination
-STATEMENT MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' AND b.fName = 'Bob' RETURN a.fName, b.fName, length(r)
---- 1
Alice|Bob|1

-LOG SingleSourceAllDestinations2
-STATEMENT MATCH (a:person)-[r:knows* SHORTEST 1..2]->(b:person) WHERE a.fName = 'Elizabeth' RETURN a.fName, b.fName, properties(nodes(r), '_Label')
---- 5
Elizabeth|Alice|[person]
Elizabeth|Dan|[person]
Elizabeth|Farooq|[]
Elizabeth|Greg|[]
Elizabeth|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|[]

-LOG SingleSourceUnreachableDestination
-STATEMENT MATCH (a:person)-[r:knows* SHORTEST 1..30]->(b:person) WHERE a.fName = 'Alice' AND b.fName = 'Alice11' RETURN a.fName, b.fName, r
---- 0


-LOG MultipleSrcMultipleDstQuery
-STATEMENT MATCH (a:person)-[r:knows* SHORTEST 1..10]->(b:person) WHERE a.isStudent = true AND b.isWorker = true RETURN a.fName, b.fName, length(r)
---- 12
Alice|Carol|1
Alice|Dan|1
Alice|Elizabeth|2
Alice|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|3
Bob|Carol|1
Bob|Dan|1
Bob|Elizabeth|1
Bob|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2
Farooq|Carol|3
Farooq|Dan|2
Farooq|Elizabeth|1
Farooq|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|1

-LOG SSPWithExtend
-STATEMENT MATCH (c:person)<-[:knows* SHORTEST 1..30]-(a:person)-[r:knows* SHORTEST 1..30]->(b:person), (b)-[:knows]->(c) WHERE a.fName = 'Alice' AND b.ID < 6 AND c.ID > 5 RETURN a.fName, b.fName, c.fName
---- 1
Alice|Bob|Elizabeth

-LOG MultiPart
-STATEMENT MATCH (a)-[r:knows* SHORTEST 1..30]->(b:person) WHERE b.ID > 6 AND a.fName = 'Alice' WITH a, b, r MATCH (c:person)<-[:knows]-(a:person) RETURN b.fName, length(r), COUNT(*)
---- 4
Elizabeth|2|3
Farooq|3|3
Greg|3|3
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|3|3
