-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MultiLabel

-LOG NodeMultiLabelTest
-STATEMENT MATCH (a)-[e:knows*1..2]->(b) RETURN COUNT(*)
---- 1
50

-LOG NodeUndirectedTest
-STATEMENT MATCH (a)-[e:knows*1..2]-(b) WHERE a.fName = 'Alice' AND b.fName = 'Bob' RETURN COUNT(*)
---- 1
10

#{_NODES: [0:4,0:5,0:4], _RELS: [3:12,3:12]}
#{_NODES: [0:4,0:5,1:0], _RELS: [3:12,4:2]}
#{_NODES: [0:4,0:5], _RELS: [3:12]}
#{_NODES: [0:4,0:6,0:4], _RELS: [3:13,3:13]}
#{_NODES: [0:4,0:6], _RELS: [3:13]}
#{_NODES: [0:4,1:2,0:3], _RELS: [5:2,5:1]}
#{_NODES: [0:4,1:2,0:4], _RELS: [5:2,5:2]}
#{_NODES: [0:4,1:2], _RELS: [5:2]}
-LOG NodeUndirectedTest2
-STATEMENT MATCH (a)-[e:knows|:studyAt|:workAt*1..2]-(b) WHERE a.ID=7 RETURN id(rels(e)[1]), (rels(e)[1]).rating, (nodes(e)[2]).ID
---- 8
3:12||8
3:12||8
3:12||8
3:13||9
3:13||9
5:2|9.200000|6
5:2|9.200000|6
5:2|9.200000|6


#1|{_NODES: [0:0,0:1,1:0], _RELS: [3:0,4:1]}
#1|{_NODES: [0:0,0:1,1:0], _RELS: [6:0,4:1]}
#1|{_NODES: [0:0,0:1,1:0], _RELS: [7:0,4:1]}
#1|{_NODES: [0:0,1:0], _RELS: [4:0]}
#4|{_NODES: [0:0,0:2,1:1], _RELS: [3:1,5:0]}
#6|{_NODES: [0:0,0:3,1:2], _RELS: [3:2,5:1]}
-LOG RelMultiLabelTest
-STATEMENT MATCH (a:person)-[e*1..2]->(b:organisation) WHERE a.fName = 'Alice' RETURN b.ID, id(rels(e)[1]), (nodes(e)[2]).ID
---- 6
1|3:0|2
1|4:0|1
1|6:0|2
1|7:0|2
4|3:1|3
6|3:2|5

#1|{_NODES: [0:0,0:1,1:0], _RELS: [6:0,4:1]}
#1|{_NODES: [0:0,0:1,1:0], _RELS: [7:0,4:1]}
#5|{_NODES: [0:0,0:1,0:3], _RELS: [6:0,6:1]}
#5|{_NODES: [0:0,0:1,0:3], _RELS: [7:0,6:1]}
-LOG MixMultiLabelTest2
-STATEMENT MATCH (a:person)-[e:meets|:marries|:studyAt*2..2]->(b) WHERE a.fName = 'Alice' RETURN b.ID, id(rels(e)[2]), (nodes(e)[3]).ID
---- 4
1|4:1|1
1|4:1|1
5|6:1|5
5|6:1|5

-LOG MixMultiLabelTest3
-STATEMENT MATCH (a:person)-[e:meets|:marries|:studyAt*2..2]->(b) WHERE a.fName = 'Alice' AND b.ID < 5 RETURN COUNT(*)
-ENUMERATE
---- 1
2

-LOG MixMultiLabelTest4
-STATEMENT MATCH (a:person)-[e*2..2]->(b:organisation) WHERE a.fName = 'Alice' RETURN COUNT(*)
---- 1
5

-LOG MixMultiLabelTest5
-STATEMENT MATCH (a:person)-[e*2..2 (r, _ | WHERE offset(id(r)) > 0)]->(b:organisation) WHERE a.fName = 'Alice' RETURN rels(e)
---- 1
[{_id: 3:2, date: 2021-06-30, meetTime: 2012-12-11 20:07:22, validInterval: 10 days, comments: [ioji232,jifhe8w99u43434], year: , places: , length: , grading: , rating: , location: , times: , data: , usedAddress: , address: , note: },{_id: 5:1, date: , meetTime: , validInterval: , comments: , year: 2010, places: , length: , grading: [2.100000,4.400000], rating: 7.600000, location: , times: , data: , usedAddress: , address: , note: }]
