# In the knows relation of the tiny-snb dataset, Node 0,2,3,5 extends to each other, Node 7 extends to Node 8,9 and
# all other nodes don't have adjacent nodes.
# In level 1, there are 14 nodes (Node 0 extends to Node 2,3,5; Node 2 extends to Node 0,3,5; Node 3 extends to Node
# 0,2,5; Node 5 extends to Node 0,3,5 and Node 7 extends to Node 8,9). So level 1 has 3 * Node 0,2,3,5 and Node 8,9.
# In level 2,  Node 0,2,3,5 extends to each other so we have 3 * 3 * Node 0,2,3,5 = 36 nodes. Node 8,9 doesn't have
# adjacent nodes. # In level 3, Node 0,2,3,5 extends to each other so we have 3 * 3 * 3 * Node 0,2,3,5 = 108 nodes.
# In general the formula is this: nth level will have 4 * (3 ^ n) number of nodes (n > 1), and the first level has
# 14 nodes.

-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE VarLengthExtendNNTests

-LOG KnowsThreeHopMinLenEqualsMaxLen
-STATEMENT MATCH (a:person)-[e:knows*3..3]->(b:person) RETURN COUNT(*)
-PARALLELISM 1
---- 1
108

-LOG KnowsKnows2To4HopTest
-STATEMENT MATCH (a:person)-[:knows]->(b:person)-[:knows*2..4]->(c:person) RETURN COUNT(*)
---- 1
1404

-LOG KnowsLongPathTest
-STATEMENT MATCH (a:person)-[:knows*8..11]->(b:person) RETURN COUNT(*)
-PARALLELISM 1
---- 1
1049760

-LOG KnowsOneToTwoHopWithFilterTest
-STATEMENT MATCH (a:person)-[:knows*1..2]->(b:person) WHERE a.ID = 7 RETURN b.fName
---- 2
Farooq
Greg

-LOG KnowsWithOptionalMatch
-STATEMENT MATCH (a:person) OPTIONAL MATCH (a)-[:knows*2..3]->(b:person) RETURN COUNT(*)
---- 1
148

-LOG KnowsOneToTwoHopTest
-STATEMENT MATCH (a:person)-[e:knows*1..2]->(b:person) WHERE a.fName='Alice' RETURN properties(rels(e), '_id'), b.fName
---- 12
[3:0,3:3]|Alice
[3:0,3:4]|Carol
[3:0,3:5]|Dan
[3:0]|Bob
[3:1,3:6]|Alice
[3:1,3:7]|Bob
[3:1,3:8]|Dan
[3:1]|Carol
[3:2,3:10]|Bob
[3:2,3:11]|Carol
[3:2,3:9]|Alice
[3:2]|Dan

-LOG KnowsOneToTwoHopFilterTest
-STATEMENT MATCH (a:person)-[e:knows*1..2 {date: date("2021-06-30")}]->(b:person) WHERE a.fName='Alice' RETURN id(rels(e)[1]), len(nodes(e)), length(e)
---- 6
3:0|0|1
3:0|1|2
3:1|0|1
3:1|1|2
3:2|0|1
3:2|1|2

-LOG KnowsOneToTwoHopFilterTest2
-STATEMENT MATCH (a:person)-[e:knows*1..2 (r,_ | WHERE list_contains(r.comments, 'rnme'))]->(b:person) WHERE a.fName='Alice' RETURN COUNT(*)
---- 1
1

-LOG SelfLoop
-STATEMENT MATCH (a:person)-[e:knows*1..3]->(a) WHERE a.fName='Alice' RETURN COUNT(*)
---- 1
9
