# In the knows relation of the tiny-snb dataset, Node 0,2,3,5 extends to each other, Node 7 extends to Node 8,9 and
# all other nodes don't have adjacent nodes.
# In level 1, there are 14 nodes (Node 0 extends to Node 2,3,5; Node 2 extends to Node 0,3,5; Node 3 extends to Node
# 0,2,5; Node 5 extends to Node 0,3,5 and Node 7 extends to Node 8,9). So level 1 has 3 * Node 0,2,3,5 and Node 8,9.
# In level 2,  Node 0,2,3,5 extends to each other so we have 3 * 3 * Node 0,2,3,5 = 36 nodes. Node 8,9 doesn't have
# adjacent nodes. # In level 3, Node 0,2,3,5 extends to each other so we have 3 * 3 * 3 * Node 0,2,3,5 = 108 nodes.
# In general the formula is this: nth level will have 4 * (3 ^ n) number of nodes (n > 1), and the first level has
# 14 nodes.

-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE VarLengthExtendNNTests

-NAME KnowsThreeHopMinLenEqualsMaxLen
-QUERY MATCH (a:person)-[e:knows*3..3]->(b:person) RETURN COUNT(*)
-PARALLELISM 1
---- 1
108

-NAME KnowsKnows2To4HopTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:knows*2..4]->(c:person) RETURN COUNT(*)
---- 1
1404

-NAME KnowsLongPathTest
-QUERY MATCH (a:person)-[:knows*8..11]->(b:person) RETURN COUNT(*)
-PARALLELISM 1
---- 1
1049760

-NAME KnowsOneToTwoHopWithFilterTest
-QUERY MATCH (a:person)-[:knows*1..2]->(b:person) WHERE a.ID = 7 RETURN b.fName
---- 2
Farooq
Greg

-NAME KnowsWithOptionalMatch
-QUERY MATCH (a:person) OPTIONAL MATCH (a)-[:knows*2..3]->(b:person) RETURN COUNT(*)
---- 1
148

#[3:0,3:3]|Bob
#[3:0,3:4]|Bob
#[3:0,3:5]|Bob
#[3:0]|Bob
#[3:1,3:6]|Carol
#[3:1,3:7]|Carol
#[3:1,3:8]|Carol
#[3:1]|Carol
#[3:2,3:10]|Dan
#[3:2,3:11]|Dan
#[3:2,3:9]|Dan
#[3:2]|Dan
-NAME KnowsOneToTwoHopTest
-QUERY MATCH (a:person)-[e:knows*1..2]->(b:person) WHERE a.fName='Alice' RETURN id(rels(e)[1]), ((nodes(e))[2]).fName
---- 12
3:0|Bob
3:0|Bob
3:0|Bob
3:0|Bob
3:1|Carol
3:1|Carol
3:1|Carol
3:1|Carol
3:2|Dan
3:2|Dan
3:2|Dan
3:2|Dan
