-NAME q02
-QUERY MATCH (comment:Comment) WHERE comment.length > 200 RETURN MIN(comment.ID)
---- 1
8638313