-NAME UnionAllTwoQueriesTest
-QUERY MATCH (p:person) RETURN p.age UNION ALL MATCH (p1:person) RETURN p1.age
---- 16
20
20
20
20
25
25
30
30
35
35
40
40
45
45
83
83

-NAME UnionAllMultipleQueriesTest
-QUERY MATCH (p:person) RETURN p.age UNION ALL MATCH (p1:person) RETURN p1.age UNION ALL MATCH (p2:person) RETURN p2.age
---- 24
20
20
20
20
20
20
25
25
25
30
30
30
35
35
35
40
40
40
45
45
45
83
83
83

-NAME UnionAllMultipleColumnsTest
-QUERY MATCH (p:person) RETURN p.age, p.eyeSight UNION ALL MATCH (p1:person) RETURN p1.age, p1.eyeSight
---- 16
20|4.700000
20|4.700000
20|4.800000
20|4.800000
25|4.500000
25|4.500000
30|5.100000
30|5.100000
35|5.000000
35|5.000000
40|4.900000
40|4.900000
45|5.000000
45|5.000000
83|4.900000
83|4.900000
