-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE CyclicMultiLabel

-NAME MultiLabelCyclicTest
-QUERY MATCH (a:person)-[:workAt|:knows|:studyAt]->(b:organisation), (a)-[:workAt]->(b) RETURN COUNT(*)
---- 1
3

-NAME MultiLabelTriangleTest
-QUERY MATCH (a:person)-[:knows]->(b:person)-[:studyAt|:meets]->(c:organisation:person), (a)-[:studyAt|:meets]->(c) RETURN COUNT(*)
-ENUMERATE
---- 1
4
