-NAME MultiLabelCyclicTest
-QUERY MATCH (a:person)-[:workAt|:knows|:studyAt]->(b:organisation), (a)-[:mixed|:workAt]->(b) RETURN COUNT(*)
-ENUMERATE
---- 1
6

# TODO(Guodong): generic extend sames to give correct output but not getting correct final result
#-NAME MultiLabelTriangleTest
#-QUERY MATCH (a:person)-[:knows]->(b:person)-[:studyAt|:mixed]->(c:organisation), (a)-[:studyAt]->(c) RETURN COUNT(*)
#-ENUMERATE
#---- 1
#2
