-DATASET CSV vector-index
-BUFFER_POOL_SIZE 1036870912

--

-CASE CREATE_VECTOR_INDEX

-STATEMENT CALL threads=1;
---- ok
#-STATEMENT EXPLAIN MATCH (p:persons)-[:person_resources]->(:resources)-[:resource_embeddings]->(e:embeddings) WHERE p.birth_date >= date('1973-01-01') AND p.birth_date < date('1975-01-01') RETURN count(*);
#---- 1
#1
-STATEMENT CREATE VECTOR INDEX ON dataset.embedding (samplingProbability=0.05, alpha=1.0, numVectorsPerPartition=50000000, efConstruction=64, maxNbrsAtUpperLevel=16, maxNbrsAtLowerLevel=32);
---- ok
-STATEMENT UPDATE VECTOR INDEX ON dataset.embedding;
-PARALLELISM 1
---- ok
-STATEMENT MATCH (e:dataset) WHERE e.chunk_id < 1000 CALL ANN_SEARCH(e.embedding, [0.0375, 0.03, 0.0332, 0.0338, 0.0308, 0.1471, 0.1394, 0.0315, 0.0258, 0.0404, 0.0366, 0.0169, 0.0279, 0.0834,
                                                                0.0935, 0.032, 0.0353, 0.0298, 0.0387, 0.0376, 0.0361, 0.1084, 0.1276, 0.0358, 0.0312, 0.0305, 0.0358, 0.0199,
                                                                0.0326, 0.0743, 0.0965, 0.0376, 0.0476, 0.0406, 0.0341, 0.0456, 0.0458, 0.0563, 0.0598, 0.0437, 0.0385, 0.0282,
                                                                0.0241, 0.0192, 0.0489, 0.0457, 0.0679, 0.0431, 0.0641, 0.0585, 0.1009, 0.0875, 0.0704, 0.066, 0.0775, 0.0755,
                                                                0.0503, 0.0341, 0.0833, 0.081, 0.0844, 0.0417, 0.0978, 0.0835, 0.0981, 0.0871, 0.157, 0.1555, 0.0876, 0.0513,
                                                                0.1656, 0.1805, 0.0851, 0.045, 0.1882, 0.1899, 0.1231, 0.068, 0.1911, 0.1648, 0.0791, 0.0737, 0.0867, 0.0771,
                                                                0.0444, 0.07, 0.1309, 0.0931, 0.0771, 0.0481, 0.0732, 0.0753, 0.0652, 0.0793, 0.1012, 0.0959, 0.044, 0.0497,
                                                                0.0604, 0.0471, 0.0385, 0.0835, 0.0915, 0.0258, 0.034, 0.048, 0.0281, 0.0191, 0.0333, 0.0433, 0.0525, 0.0306,
                                                                0.0334, 0.0365, 0.0457, 0.0311, 0.0372, 0.1053, 0.1141, 0.0302, 0.0287, 0.0486, 0.0303, 0.0201, 0.0258, 0.0652,
                                                                0.0744, 0.0246, 0.0306, 0.063, 0.085, 0.0607, 0.0433, 0.1606, 0.1637, 0.04, 0.0241, 0.0373, 0.049, 0.0226, 0.0332,
                                                                0.104, 0.124, 0.0597, 0.0302, 0.0546, 0.0374, 0.0357, 0.0485, 0.0973, 0.1131, 0.0381, 0.0314, 0.0255, 0.0433,
                                                                0.0149, 0.0241, 0.0752, 0.1051, 0.0488, 0.0714, 0.0666, 0.0278, 0.0614, 0.0717, 0.0382, 0.0511, 0.0352, 0.0374,
                                                                0.0424, 0.0223, 0.0199, 0.0573, 0.0624, 0.0397, 0.0619, 0.0665, 0.0599, 0.1322, 0.1044, 0.0768, 0.0549, 0.078,
                                                                0.0815, 0.0829, 0.047, 0.1049, 0.06, 0.1246, 0.0755, 0.0687, 0.0632, 0.0904, 0.0722, 0.2035, 0.1951, 0.0504,
                                                                0.0302, 0.1855, 0.1769, 0.1022, 0.075, 0.2155, 0.1175, 0.1449, 0.1114, 0.1818, 0.0985, 0.0491, 0.0674, 0.083,
                                                                0.102, 0.0621, 0.1006, 0.1259, 0.1322, 0.0832, 0.0681, 0.0818, 0.08, 0.0704, 0.0884, 0.0835, 0.0634, 0.0561,
                                                                0.0525, 0.0456, 0.0557, 0.083, 0.096, 0.0776, 0.0387, 0.0513, 0.0474, 0.0379, 0.0324, 0.0281, 0.0441, 0.0504,
                                                                0.0445, 0.0427, 0.0414, 0.0638, 0.0517, 0.0369, 0.089, 0.1146, 0.0515, 0.0341, 0.0302, 0.0513, 0.0437, 0.0401,
                                                                0.0723, 0.0599, 0.0345, 0.019, 0.0592, 0.0654, 0.0487, 0.0306, 0.1112, 0.1002, 0.0155, 0.0316, 0.0548, 0.0573,
                                                                0.025, 0.0252, 0.0674, 0.1314, 0.0562, 0.0336, 0.0552, 0.0986, 0.0871, 0.0677, 0.0892, 0.0655, 0.0612, 0.1112,
                                                                0.0549, 0.087, 0.0861, 0.0788, 0.0698, 0.0714, 0.0506, 0.0396, 0.0692, 0.1915, 0.1827, 0.0649, 0.089, 0.1621,
                                                                0.1652, 0.2071, 0.1113, 0.1484, 0.193, 0.1318, 0.1114, 0.1291, 0.1505, 0.0357, 0.0461, 0.1191, 0.0728, 0.1024,
                                                                0.1365, 0.0748, 0.0646, 0.1425, 0.1292, 0.0734, 0.0732, 0.0579, 0.1108, 0.0833, 0.0707, 0.0615, 0.0353, 0.0333,
                                                                0.0396, 0.0428, 0.1515, 0.157, 0.0326, 0.0501, 0.0414, 0.0302, 0.0199, 0.0394, 0.0763, 0.076, 0.032, 0.0509,
                                                                0.0322, 0.0448, 0.0464, 0.0533, 0.1063, 0.121, 0.0334, 0.0413, 0.0306, 0.032, 0.0225, 0.0409, 0.0705, 0.0758,
                                                                0.03, 0.0649, 0.0369, 0.046, 0.0594, 0.0629, 0.0643, 0.0549, 0.0293, 0.0589, 0.0314, 0.0227, 0.0207, 0.0562,
                                                                0.0435, 0.0639, 0.0406, 0.0809, 0.0549, 0.1019, 0.1069, 0.0878, 0.0759, 0.0797, 0.0762, 0.0745, 0.0438, 0.0888,
                                                                0.0843, 0.1036, 0.0406, 0.1029, 0.0957, 0.1214, 0.081, 0.1608, 0.1782, 0.1163, 0.0609, 0.1826, 0.1949, 0.1237,
                                                                0.0572, 0.2056, 0.1943, 0.1465, 0.0668, 0.1916, 0.1703, 0.0898, 0.0753, 0.0842, 0.0878, 0.06, 0.0824, 0.1448,
                                                                0.0996, 0.0992, 0.0544, 0.0802, 0.079, 0.0784, 0.0764, 0.1021, 0.1019, 0.0596, 0.05, 0.0602, 0.052, 0.0512,
                                                                0.0934, 0.1133, 0.0367, 0.0469, 0.0459, 0.0295, 0.0221, 0.0403, 0.043, 0.0517, 0.0371, 0.0463, 0.0378, 0.045,
                                                                0.0364, 0.0537, 0.1131, 0.1293, 0.0297, 0.0465, 0.0486, 0.0309, 0.0212, 0.0314, 0.0615, 0.063, 0.0285, 0.0548,
                                                                0.0782, 0.0909, 0.0624, 0.0511, 0.1756, 0.1843, 0.0418, 0.032, 0.0416, 0.0475, 0.0211, 0.0409, 0.0963, 0.1103,
                                                                0.0626, 0.0514, 0.0629, 0.0455, 0.0395, 0.0665, 0.1028, 0.1143, 0.0362, 0.041, 0.0273, 0.0403, 0.0192, 0.0324,
                                                                0.0648, 0.0824, 0.042, 0.0846, 0.0586, 0.0296, 0.0672, 0.0922, 0.046, 0.0469, 0.0327, 0.057, 0.0501, 0.0206, 0.02,
                                                                0.0635, 0.0576, 0.0312, 0.0631, 0.0853, 0.0506, 0.1321, 0.1163, 0.1049, 0.0665, 0.0788, 0.0915, 0.1107, 0.0637,
                                                                0.1052, 0.0637, 0.1353, 0.0737, 0.0745, 0.0705, 0.1204, 0.0711, 0.2109, 0.2138, 0.0803, 0.0327, 0.2042, 0.1949,
                                                                0.1432, 0.0966, 0.2295, 0.1412, 0.1623, 0.1194, 0.1914, 0.1045, 0.0728, 0.0689, 0.0904, 0.1153, 0.0812, 0.1064,
                                                                0.1417, 0.1488, 0.1111, 0.0765, 0.0912, 0.0979, 0.0763, 0.0915, 0.0909, 0.0731, 0.094, 0.0671, 0.052, 0.0617,
                                                                0.1119, 0.1135, 0.0875, 0.0459, 0.0682, 0.0456, 0.0381, 0.0408, 0.0353, 0.0492, 0.0501, 0.059, 0.0642, 0.0496,
                                                                0.0552, 0.053, 0.047, 0.0969, 0.1211, 0.0448, 0.0512, 0.0331, 0.0527, 0.0444, 0.0472, 0.0734, 0.0524, 0.0374,
                                                                0.0182, 0.061, 0.0635, 0.0438, 0.0414, 0.1164, 0.1043, 0.0176, 0.0451, 0.0543, 0.052, 0.0234, 0.0318, 0.0656,
                                                                0.1235, 0.0582, 0.0495, 0.0582, 0.099, 0.0794, 0.0916, 0.1058, 0.0666, 0.0664, 0.1408, 0.0706, 0.0797, 0.087,
                                                                0.1009, 0.0716, 0.0667, 0.0543, 0.0503, 0.0707, 0.1944, 0.1754, 0.0751, 0.0857, 0.1671, 0.1718, 0.2596, 0.151,
                                                                0.1488, 0.2008, 0.1441, 0.1174, 0.1292, 0.1478, 0.0265, 0.051, 0.1193, 0.0743, 0.1182, 0.1397, 0.0757, 0.0689,
                                                                0.176, 0.14, 0.0681, 0.0805, 0.0702, 0.1182, 0.0799, 0.0659, 0.0643, 0.0344, 0.0272, 0.0393, 0.0587, 0.1367, 0.11,
                                                                0.0273, 0.0591, 0.0421, 0.0181, 0.0292, 0.0388, 0.0572, 0.055, 0.0333, 0.0587, 0.0294, 0.0301, 0.0372, 0.0598,
                                                                0.0951, 0.0846, 0.0248, 0.0641, 0.0336, 0.0242, 0.0321, 0.0398, 0.0503, 0.0574, 0.0273, 0.0613, 0.0383, 0.0274,
                                                                0.0395, 0.0697, 0.0679, 0.0499, 0.0273, 0.0627, 0.031, 0.0233, 0.0215, 0.0692, 0.041, 0.0574, 0.0369, 0.0693,
                                                                0.0613, 0.0703, 0.0681, 0.0824, 0.0784, 0.0618, 0.054, 0.0889, 0.0534, 0.0679, 0.0747, 0.1094, 0.0432, 0.0781,
                                                                0.0732, 0.1085, 0.0876, 0.1061, 0.1032, 0.1019, 0.0643, 0.1226, 0.1284, 0.1239, 0.0646, 0.1469, 0.1671, 0.1552,
                                                                0.0673, 0.1317, 0.1245, 0.0881, 0.0813, 0.0575, 0.0487, 0.081, 0.0906, 0.1031, 0.0666, 0.1491, 0.0706, 0.0615,
                                                                0.0705, 0.0832, 0.0735, 0.0693, 0.0629, 0.0656, 0.0517, 0.0444, 0.035, 0.0826, 0.0853, 0.0812, 0.03, 0.0728,
                                                                0.0457, 0.0226, 0.0313, 0.0487, 0.0399, 0.0445, 0.0323, 0.0484, 0.0374, 0.0296, 0.0316, 0.0732, 0.1085, 0.0971,
                                                                0.0252, 0.0523, 0.0397, 0.021, 0.0196, 0.0343, 0.0499, 0.0572, 0.0268, 0.0625, 0.0699, 0.0699, 0.0623, 0.048,
                                                                0.154, 0.1401, 0.0284, 0.0376, 0.0304, 0.0313, 0.027, 0.0442, 0.0759, 0.0815, 0.0569, 0.0565, 0.0481, 0.0301,
                                                                0.0251, 0.0603, 0.0962, 0.086, 0.0303, 0.0485, 0.0199, 0.0237, 0.0275, 0.0448, 0.0473, 0.0606, 0.033, 0.0777,
                                                                0.0496, 0.0186, 0.0477, 0.0868, 0.0457, 0.0361, 0.023, 0.0525, 0.0421, 0.0134, 0.023, 0.075, 0.0428, 0.028,
                                                                0.0602, 0.0812, 0.0431, 0.0879, 0.0775, 0.1136, 0.0595, 0.0542, 0.064, 0.1167, 0.0618, 0.0795, 0.0567, 0.122,
                                                                0.0668, 0.0556, 0.0583, 0.1112, 0.06, 0.1311, 0.1421, 0.0652, 0.0301, 0.1206, 0.1265, 0.1377, 0.0987, 0.1636,
                                                                0.1097, 0.1547, 0.1147, 0.1406, 0.0751, 0.0766, 0.068, 0.056, 0.0817, 0.0768, 0.1039, 0.0873, 0.1025, 0.1135,
                                                                0.0896, 0.067, 0.0787, 0.0733, 0.0893, 0.0649, 0.0525, 0.0951, 0.0717, 0.0361, 0.0412, 0.1189, 0.1053, 0.0657,
                                                                0.0352, 0.0615, 0.0388, 0.0211, 0.0321, 0.0365, 0.0419, 0.0318, 0.0447, 0.0625, 0.0475, 0.0382, 0.0459, 0.0542,
                                                                0.0888, 0.091, 0.0244, 0.0454, 0.0255, 0.0292, 0.0211, 0.0462, 0.0608, 0.0353, 0.0342, 0.0207, 0.0496, 0.0473,
                                                                0.0308, 0.0395, 0.0956, 0.0852, 0.0188, 0.0424, 0.0446, 0.0371, 0.0164, 0.0376, 0.0522, 0.0904, 0.0478, 0.0527,
                                                                0.0493, 0.0667, 0.0469, 0.0927, 0.092, 0.0483, 0.0514, 0.1368, 0.0716, 0.0558, 0.0718, 0.0991, 0.0648, 0.0512,
                                                                0.0479, 0.0481, 0.0511, 0.133, 0.115, 0.0708, 0.0681, 0.1155, 0.1219, 0.2542, 0.1607, 0.1055, 0.1646, 0.1419,
                                                                0.113, 0.0943, 0.117, 0.0234, 0.0405, 0.0831, 0.0512, 0.1106, 0.1203, 0.0532, 0.0496, 0.1673, 0.135, 0.0477,
                                                                0.0698, 0.0683, 0.1033, 0.0573, 0.0492], 10, 120, 1, true, false) RETURN e.chunk_id;
---- 10
0
147
241
257
262
485
791
858
960
977
