-DATASET CSV complex-vector-index

--

-CASE CREATE_VECTOR_INDEX

-STATEMENT MATCH (n:persons) RETURN count(n);
---- 1
10000
-STATEMENT CREATE VECTOR INDEX ON embeddings.embedding (samplingProbability=0.05, alpha=1.1, numVectorsPerPartition=50000000, efConstruction=200, maxNbrsAtUpperLevel=32, maxNbrsAtLowerLevel=64);
---- ok
-STATEMENT UPDATE VECTOR INDEX ON embeddings.embedding;
---- 1
1
#-STATEMENT MATCH (n1:embeddings)-[e]->(n2:embeddings) RETURN ID(n1), ID(e), ID(n2) LIMIT 10000;
#---- 1
#-STATEMENT CALL ANN_SEARCH(embeddings.embedding, [0.0459], 100, 100, false) RETURN Id(_node), _distance;
#---- 1
#1
-STATEMENT EXPLAIN MATCH (n:persons)-[r *1..2]->(e:embeddings) WHERE n.birth_date > DATE('1997-01-01') CALL ANN_SEARCH(e.embedding, [0.8472442030906677, -1.178100347518921, -2.8202922344207764, 0.06369080394506454, -0.3985813856124878, 0.889857828617096, -1.042545199394226, -0.6588157415390015, -0.38941439986228943, -0.6800646185874939, -0.5718896985054016, -0.4102952480316162, -0.7181394100189209, -1.0396848917007446, 0.13861939311027527, 0.8288902640342712, -0.15628282725811005, 0.07924233376979828, 0.41990897059440613, 0.28837716579437256, 1.2226237058639526, -1.35808527469635, -0.9057787656784058, 0.02372600883245468, -0.22279827296733856, 0.3928222954273224, 0.4427640736103058, -0.8178670406341553, 1.0986418724060059, -0.033105988055467606, 0.7310979962348938, -0.8285185098648071, 0.28807878494262695, 0.37829524278640747, 0.006295030936598778, -0.45414412021636963, -0.3637041747570038, -1.3233702182769775, -0.7047383785247803, -1.3785927295684814, 0.272381454706192, -1.53277587890625, 0.8330798745155334, -0.39218729734420776, 0.5352246761322021, 0.7356187701225281, -0.5548012852668762, 0.16175639629364014, -0.8598811030387878, -0.9394757151603699, -1.0770318508148193, -0.9929920434951782, 0.7064226269721985, -1.1465122699737549, 0.25705739855766296, 0.8223068714141846, -0.6860508322715759, 0.5170392394065857, -1.3252009153366089, 0.1022363007068634, -0.0767773687839508, -0.44294223189353943, -1.1610469818115234, 0.5078968405723572, 0.48495081067085266, 0.3447939157485962, 0.09652712941169739, 0.8034068942070007, 1.5474392175674438, 0.7646178603172302, -0.20267519354820251, -0.9642817378044128, -0.6019238233566284, -0.8415358066558838, 0.6780306100845337, -0.48794955015182495, 0.06264615058898926, 0.24782207608222961, 0.8451581597328186, -0.17488524317741394, 0.6142369508743286, 0.39630770683288574, 0.1325317621231079, 1.2098866701126099, -0.8493026494979858, -0.4151734709739685, 0.21050502359867096, 0.446249783039093, -0.9445545077323914, 0.6017937660217285, -0.4169835150241852, -0.5592649579048157, 0.33076903223991394, 0.04594220966100693, -0.3239067494869232, 1.0572819709777832, 0.5757842063903809, -0.14548686146736145, -0.1206170916557312, 1.8899588584899902, -0.16270878911018372, -0.6307420134544373, 0.6535478830337524, -0.27266567945480347, -0.4822079539299011, -0.401922345161438, -0.006336972117424011, -0.059601277112960815, -0.0275583453476429, 1.3641469478607178, 0.23640412092208862, -0.9795833230018616, -0.1822327971458435, -0.35934415459632874, -0.3643065392971039, 0.0816764384508133, 1.0558589696884155, 0.16615207493305206, 0.20774757862091064, 0.2202320247888565, -0.28927046060562134, -0.7581804394721985, -0.34457123279571533, 0.2637076675891876, 0.43277111649513245, 0.07198356091976166, -0.07978083193302155, 0.08555339276790619, 0.34910619258880615, 1.6282602548599243, 0.7556455135345459, 0.6658833026885986, -0.39817214012145996, -0.13866862654685974, 0.09343979507684708, -0.12759225070476532, 0.9118388891220093, 1.6995093822479248, -0.22224943339824677, -0.018592214211821556, -0.577276885509491, 0.40211281180381775, -0.055343784391880035, 0.4305124580860138, -1.6073062419891357, -0.813032329082489, -0.4067343473434448, -0.7795974612236023, -0.3886149823665619, 0.7130701541900635, -1.4729647636413574, 0.5020487904548645, -0.8315269351005554, 0.2548794448375702, -1.5603200197219849, 0.1999860554933548, -0.42461708188056946, -0.6206870079040527, -0.20306119322776794, -0.8024170398712158, -0.886584997177124, -0.39149487018585205, 0.1663585603237152, 0.47545289993286133, 0.03596750646829605, -1.0868866443634033, 1.8032160997390747, -0.22346864640712738, -0.777733325958252, -0.31871649622917175, 1.0093717575073242, -0.36689549684524536, 0.4624561071395874, 0.4029635787010193, 0.14771544933319092, 0.8622502088546753, -0.6005709171295166, 0.2636944651603699, 0.19158706068992615, 1.3936595916748047, -0.369789183139801, 1.6266491413116455, -0.30342578887939453, 0.5998079180717468, 0.2676706314086914, 0.45519202947616577, -0.3028520345687866, 0.6758683323860168, -0.3663257658481598, 1.5003585815429688, -1.4098132848739624, -1.4514851570129395, -0.5719239711761475, 1.77935791015625, -0.5178578495979309, -0.49102550745010376, 1.4271183013916016, -0.5654858946800232, -0.6875065565109253, 0.04019089788198471, 0.7762945294380188, 0.324373722076416, 0.6318493485450745, 0.17424917221069336, -0.09415246546268463, 0.4393898844718933, 0.819692850112915, -0.6518716216087341, -0.03760087490081787, -0.95545893907547, 0.4338121712207794, -0.48367995023727417, -0.07343301177024841, 2.1706278324127197, 0.15691231191158295, 0.5736529231071472, -0.8583784699440002, 0.1547205150127411, -0.5507504343986511, -0.13111652433872223, 1.8454818725585938, -0.48266473412513733, 1.8470360040664673, -0.23158416152000427, -0.5484917163848877, 1.1088309288024902, 0.856181800365448, 0.14844746887683868, 0.07262498140335083, 2.226609945297241, 0.928887665271759, 0.1331051141023636, 0.8473464250564575, -0.3705984950065613, -0.7798397541046143, 1.2525835037231445, -0.5039034485816956, -0.5178688168525696, -0.6191786527633667, 0.1497776210308075, 0.2843073606491089, 0.6334151029586792, 0.5520423650741577, 0.17995324730873108, -0.6137123703956604, -0.2666962742805481, 0.5572169423103333, -1.6544345617294312, -1.212422251701355, 0.2621411383152008, 0.6356021761894226, 0.0872124433517456, -0.1706489473581314, 0.46303611993789673, 1.6080414056777954, 1.1267427206039429, -0.6905941367149353, 0.5774577856063843, 0.7150481343269348, 0.36764049530029297, 0.0050147417932748795, 0.9627878069877625, 0.8374823927879333, 0.6291736960411072, 1.0692585706710815, -1.8606781959533691, 0.06306874752044678, 0.3219083845615387, -0.0799764022231102, 0.25141051411628723, 0.6420859098434448, 0.8458833694458008, 0.2279772162437439, 1.1389983892440796, -0.2156720757484436, -0.5441340208053589, 0.16181297600269318, -0.11140069365501404, -0.2803984582424164, 0.15268854796886444, -0.41445642709732056, -0.6413412690162659, -0.29056042432785034, 1.1762166023254395, -0.4967048764228821, 1.025012731552124, -0.20664675533771515, -0.23860520124435425, 0.8971208930015564, 0.1384899616241455, -0.43514111638069153, -0.1322428435087204, -0.45951390266418457, -0.0513145849108696, 0.5033687353134155, -0.07314305007457733, 0.38914233446121216, -0.4365559220314026, 0.9895674586296082, 0.6966854929924011, -0.4399014115333557, 0.7637941241264343, -0.8251860737800598, -0.7955719828605652, 0.008998088538646698, -0.056471358984708786, -0.02302105352282524, 0.1988067328929901, 0.4691978394985199, -0.3339993953704834, 0.28873205184936523, 0.38852351903915405, 0.6249942779541016, -0.15755344927310944, 0.7107514142990112, 1.5230952501296997, -0.2957662343978882, 0.16293865442276, 0.9005976915359497, 1.4211629629135132, 0.32670632004737854, 0.4666840434074402, 0.011055013164877892, -0.015634194016456604, 0.7971588373184204, -0.057933010160923004, 0.17718783020973206, -0.04494202882051468, 0.3442121744155884, -0.06543652713298798, 0.2716359794139862, 0.3563903868198395, -0.8461679220199585, -0.19857898354530334, 0.16458705067634583, 0.600755512714386, 0.10688440501689911, -0.6974116563796997, -1.2700854539871216, 1.311801552772522, -0.7266355156898499, 0.14700224995613098, -1.2336616516113281, 0.919742226600647, 0.39655622839927673, 0.3721495270729065, 0.9378100037574768, 0.728834331035614, -0.28304392099380493, -0.050826430320739746, 0.19384972751140594, -0.005443515256047249, 0.8398887515068054, -0.3357126712799072, -0.32215404510498047, 0.6308756470680237, 0.36468780040740967, -0.6452084183692932, 0.06620737910270691, 0.28610026836395264, -0.5827646255493164, 0.012645471841096878, -0.0909578949213028, -0.6703624725341797, -0.04059070348739624, -0.9612109661102295, -0.10362810641527176, -1.303157091140747, 0.40109485387802124, 0.1380423754453659, 1.2602559328079224, -0.062343765050172806, -0.0016373628750443459, 0.8343756794929504, -1.2030390501022339, -0.36658594012260437, 0.3595830798149109, -0.052308034151792526, -0.08133292198181152, 0.4824298322200775, 1.4286640882492065, -0.3544429838657379, -0.7177316546440125, -0.16495537757873535, 0.8139103651046753, -0.014120541512966156, -2.0440673828125, -0.20596590638160706, 0.27733099460601807, -0.6442307829856873, -0.6874532699584961, -0.7391976714134216, -0.41856563091278076, -0.048854924738407135, 0.13543152809143066, 0.8842098712921143, -0.8276829719543457, 1.2125823497772217, 1.5408867597579956, 1.1165817975997925, -2.0529162883758545, 0.2348472625017166, -0.41367483139038086, -0.05307721346616745, -0.8392689824104309, -0.1014833077788353, -0.9048293232917786, 0.8260729312896729, 1.610308289527893, 1.6002944707870483, 0.029003912582993507, 0.19249919056892395, 0.8413251042366028, 0.004498571157455444, -0.6670281291007996, -0.04160115867853165, -1.3073632717132568, -0.4839102625846863, -1.3332128524780273, -0.41611990332603455, 0.48462948203086853, -0.33330467343330383, 0.3600412905216217, -0.5833913087844849, -0.2413739264011383, 0.38692060112953186, 0.5073853731155396, 0.4016992747783661, -1.8665268421173096, -0.056138914078474045, -0.3441861569881439, 0.7568961381912231, 0.6157447099685669, -0.06606811285018921, 0.40490344166755676, 0.08161769807338715, 0.4027107357978821, 0.32206934690475464, -0.480050653219223, 1.9693140983581543, -0.5886980295181274, 0.8419027328491211, 0.25148457288742065, -0.5653271079063416, -0.6062421202659607, -0.2880144715309143, -0.02867792174220085, 0.09948545694351196, -0.9213563203811646, -0.6364974975585938, -0.7805690765380859, 0.44250747561454773, 1.0427762269973755, -0.4708545207977295, -0.0599093958735466, 1.609291911125183, 0.22602775692939758, -0.6838040351867676, -0.16273339092731476, -0.9910304546356201, -0.5279178023338318, 0.867012619972229, -0.9121544361114502, -1.1040478944778442, 1.7406560182571411, -0.44505125284194946, 0.5003082752227783, -0.8870251178741455, 0.7794113755226135, -0.5969249606132507, -0.37922418117523193, -0.14053712785243988, 0.649030327796936, -0.7121009230613708, 0.1717665195465088, -0.49289971590042114, -0.04312901198863983, 1.155617117881775, -1.3507078886032104, -0.12392152845859528, -0.14948269724845886, -0.06497784703969955, 0.4070068299770355, 0.9743162393569946, -0.054902732372283936, -0.8108430504798889, -0.2894338071346283, -0.9151129126548767, -1.0775264501571655, 1.052459478378296, -0.7271749973297119, -0.6770780086517334, 0.2391938418149948, -1.2555928230285645, -0.7137677073478699, 0.602236807346344, 0.220230832695961, -0.7954488396644592, -0.002551816403865814, 0.12420810759067535, 0.2965286374092102, 0.20506435632705688, -0.2925362288951874, -0.3482808470726013, -0.3383585214614868, -0.16775523126125336, 1.7001457214355469, 0.7202324271202087, -0.7364940643310547, -0.9112159609794617, 0.5199820399284363, 1.045729398727417, 0.3564566671848297, -1.1409929990768433, 0.8303775191307068, -0.16500291228294373, -0.5995725989341736, -0.9509360790252686, -1.6081856489181519, 0.35547009110450745, -0.02824488654732704, 0.6921281814575195, 0.5760679244995117, -0.47638773918151855, -0.34980764985084534, 0.04446670413017273, -0.37231266498565674, 0.20187900960445404, 1.3710476160049438, -0.6220108270645142, 1.156433343887329, 0.22316575050354004, -0.491997629404068, -0.699997067451477, -0.40708571672439575, -0.17763769626617432, 0.22193244099617004, -0.22553899884223938, 0.44438308477401733, -0.9643245935440063, -0.4645434021949768, -1.509763240814209, 0.1244608610868454, 0.6394634246826172, 0.49611878395080566, 0.6327047944068909, -0.01555541530251503, -1.43417227268219, -0.6761236786842346, -0.40084171295166016, -0.1450350284576416, -0.8109228014945984, 0.977243185043335, 1.2561581134796143, -0.43827423453330994, -0.17301657795906067, -0.07929795980453491, -0.24237869679927826, -0.540472149848938, -0.7955865263938904, -0.1037684753537178, -0.8150014877319336, -1.1547412872314453, 0.29962337017059326, -0.23783889412879944, 2.724776268005371, 0.06513777375221252, -1.055924415588379, -0.48837044835090637, 0.7531723976135254, -0.19512289762496948, -0.10232599079608917, 0.07613858580589294, 0.8732653260231018, 0.7561862468719482, 0.05523501709103584, -1.0416086912155151, 0.31915566325187683, -0.2751057744026184, 2.1515893936157227, -0.20368601381778717, -0.2905452251434326, 0.44884151220321655, -0.20531748235225677, -1.7933684587478638, 0.8633428812026978, -0.03817267715930939, 0.35121428966522217, 0.10444802790880203, 0.32164350152015686, 0.6167343854904175, -1.5101802349090576, 1.577056646347046, 0.6079360842704773, -0.6326912045478821, 0.15845799446105957, -0.014045880176126957, -1.2903257608413696, -0.344952791929245, 0.27406957745552063, -0.8507104516029358, -0.5594149827957153, 0.1341775506734848, -1.3321090936660767, -1.1632015705108643, 1.2667288780212402, -0.47023993730545044, 0.5162243247032166, 2.08254075050354, -0.14888064563274384, -0.3157374858856201, 0.33152449131011963, 0.17175523936748505, -0.038319047540426254, 0.5767497420310974, 0.5576651096343994, 0.8155764937400818, 1.162164330482483, 0.45093294978141785, 0.08711281418800354, 0.18235652148723602, -1.3512088060379028, 0.17587555944919586, -1.327104926109314, 1.0555028915405273, 1.517191767692566, 0.28801947832107544, -0.052092473953962326, 0.1301092952489853, 0.5775070190429688, -0.917858362197876, -0.7071555256843567, -1.8276134729385376, 0.47007471323013306, 1.1538043022155762, -0.377949982881546, -0.0749950110912323, -1.106711745262146, 0.9188583493232727, -0.21089066565036774, 1.3178505897521973, 1.0544471740722656, 0.6397698521614075, 0.9658308029174805, -0.7168787121772766, -0.05920260027050972, -0.0565335638821125, 0.13088440895080566, 0.15983854234218597, 0.018522197380661964, 0.3598785996437073, -0.16645774245262146, -0.6591262817382812, -0.6902474164962769, -0.028147922828793526, 0.15249618887901306, -0.00538218766450882, 0.5087301731109619, -0.5686904191970825, 1.1133817434310913, -0.3549489676952362, -0.004833337850868702, 0.00827617198228836, -0.5815714597702026, -0.39049965143203735, 1.216299057006836, 0.20438286662101746, 0.32699689269065857, -0.8622168898582458, -0.90875244140625, 1.1206278800964355, 0.2229871153831482, -1.08017897605896, 0.5219941139221191, -0.672444760799408, -0.1980094015598297, -0.021514778956770897, -1.8053388595581055, -0.14235225319862366, 0.32924404740333557, -0.06292150169610977, -1.446587085723877, 0.09573069214820862, -1.0228936672210693, 0.0026569515466690063, 0.32268697023391724, 0.9574832320213318, -0.56023108959198, -0.22030718624591827, -1.526080846786499, 0.31418490409851074, 0.7392832040786743, 0.6543259024620056, 0.48345428705215454, 0.2070818990468979, -1.07607901096344, -0.22894874215126038, 0.34613385796546936, -0.3188345432281494, 1.2112889289855957, 1.0927484035491943, 0.23441408574581146, 0.004405105486512184, -0.5465271472930908, -0.014241684228181839, -1.1157199144363403, 0.18945398926734924, 0.9001654386520386, -0.4895056188106537, 0.24859023094177246, 1.5366560220718384, 0.4661926329135895, 0.5536768436431885, 1.0698069334030151, 1.0310677289962769, 0.7771683931350708, 0.6380038261413574, 0.8490486145019531, -0.5874370336532593, -0.8601566553115845, 0.864520788192749, 1.6826680898666382, -0.10953846573829651, -0.37615880370140076, 0.32290226221084595, 0.7377352118492126, 1.0095670223236084, -1.4756159782409668, -1.1042872667312622, -0.48804405331611633, -0.7821968793869019, -0.1691562533378601, 0.12325295060873032, -0.5004149079322815, 1.4054733514785767, -0.052029337733983994, 0.523798406124115, 1.1627260446548462, 1.0432324409484863, -0.5906100273132324, -1.8311214447021484, 0.6510191559791565, -0.9656969904899597, 0.7801598906517029, 0.48812955617904663, 0.03785456717014313, 0.4849408268928528, 0.10371381789445877, 0.0861087515950203, 0.06374116241931915, 1.2537280321121216, -0.14652091264724731, -0.9993208050727844, -0.7888821363449097, -0.5925332307815552, 0.22798097133636475, -0.5870468020439148, 0.0897548496723175, -0.37163981795310974, -0.4470796585083008, 1.2851312160491943, 1.115394115447998, 0.30741122364997864, -0.6985076069831848, -0.3111400008201599, 1.4332917928695679, 1.0214723348617554, 0.47046518325805664, -1.3382227420806885, -1.177740216255188, 0.3591585159301758, 0.6208593249320984, 0.3827894926071167, -0.3791365921497345, -0.01641211099922657, 0.3528979420661926, -0.008462333120405674, 0.0019148532301187515, 0.3313103914260864, -0.8805183172225952, -0.027849804610013962, 0.13571350276470184, -0.8383896946907043, -0.5163909196853638, -0.5574530959129333, 0.752816915512085, 1.752173900604248, 0.328855037689209, -0.9740747213363647, -0.7048570513725281, -0.18347570300102234, -0.395925909280777, -1.6472059488296509, 0.0653521865606308, 0.3761056065559387, 0.3077344000339508, 0.6898528337478638, -0.39280787110328674, -0.8485819101333618, -1.2964917421340942, -0.026455597952008247, 0.48531144857406616, -1.9389793872833252, -0.9212703704833984, -0.04955253005027771, 0.4622425436973572, 0.8699575662612915, -0.3510342538356781, -0.32592201232910156, -0.16513966023921967, 0.42419686913490295, -0.7192525267601013, -0.996368944644928, -0.7594863772392273, 0.897542417049408, -0.4338931441307068, 0.8385009169578552, -0.43026334047317505, 0.2681356370449066, 0.47174033522605896, -0.5454085469245911, -0.11895450204610825, 0.7885780334472656, 0.16468827426433563, 0.6948983669281006, 0.06882273405790329, -1.4236586093902588, 0.3336705267429352, -0.7336018681526184, -0.3281925618648529, 0.17090100049972534, 0.42268162965774536, -0.31881800293922424, 0.6294621825218201, -0.9244397878646851, -0.4101097583770752, -1.152974009513855, 0.39373499155044556, -0.8868982791900635, -0.29031822085380554, 0.9509576559066772, 0.8522160053253174, -1.3246454000473022, -0.24882817268371582, -0.5908239483833313, 0.6377270221710205, 0.6483822464942932, 1.4978750944137573, -1.1030528545379639, 0.19849203526973724, 0.2425306886434555, -0.5354548692703247, 0.2546115219593048, -0.09421128034591675, 0.567085325717926, 0.7319818735122681, -0.28435030579566956, 1.1225250959396362, -1.3266180753707886, -1.1103661060333252, 0.0926833301782608, 1.056012511253357, 0.44967615604400635, 0.15285390615463257, -0.036187928169965744, 1.5259524583816528, 0.9244184494018555, -0.16384705901145935, 0.18418709933757782, 0.8507039546966553, 0.08699722588062286, 0.36479783058166504, -0.9071277379989624, 0.5389696359634399, -0.0342583954334259, -0.849400520324707, 0.5499931573867798, 0.5653005242347717, 0.8679966926574707, 0.08412293344736099, -0.41981232166290283, -0.5111717581748962, 0.09015963971614838, 0.5185067057609558, 0.2979678213596344, 0.010432640090584755, 0.3698817789554596, 0.2254423201084137, -0.24348866939544678, -0.32486915588378906, 0.5617870092391968, -0.6404617428779602, -0.48463544249534607, 0.14193224906921387, -0.4678572416305542, -1.2984782457351685, -0.2440386265516281, 0.03723329305648804, 0.7455443739891052, -0.27319055795669556, 0.35174059867858887, 0.5461193323135376, 0.2690623700618744, 0.06685031205415726, 1.0368390083312988, -0.021742936223745346, 0.811788022518158, 0.38612183928489685, 0.8074471950531006, 1.1809371709823608, -0.28139257431030273, 1.2566437721252441, -0.1007133275270462, -1.3294768333435059, -0.5819311738014221, 0.034243807196617126, 1.6430524587631226, 0.18817217648029327, 1.2624493837356567, 1.1006882190704346, -0.7891839742660522, -0.12712496519088745, -0.6500173211097717, 0.2469525784254074, -0.2517029941082001, -0.4989808201789856, -1.4550232887268066, -0.426021933555603, -0.07836740463972092, -0.44793999195098877, -0.27636072039604187, 0.17019827663898468, -0.25878334045410156, -0.2277027815580368, 0.13850101828575134, -0.5232668519020081, 0.2791823446750641, 0.5750832557678223, 0.02750035747885704, 0.11054474860429764, 0.11395499855279922, -0.6187257170677185, 0.8401421904563904, 0.6111823320388794, -1.062873363494873, -1.1527084112167358, -0.22264409065246582, 0.4488471746444702, 0.4799576699733734, 0.18311859667301178, -0.39897969365119934, -0.6503360867500305, 0.23083963990211487, 0.14483137428760529, 0.4827110469341278, -0.747855544090271, 0.9350609183311462, 1.4578239917755127, 0.3199390470981598, -0.6641838550567627, 0.8370362520217896, -0.7248219847679138, 0.8802807927131653, 0.21712788939476013, 0.7804964184761047, -0.7932466864585876, -0.8369737863540649, 2.3678135871887207, -0.18253737688064575, 1.7663829326629639, -0.6189755797386169, 1.3850499391555786, 0.08655340224504471, -0.20711013674736023, 0.8778886795043945, 1.9908028841018677, 1.0029977560043335, -0.5169734954833984, -0.08633314073085785, 1.658974528312683, -0.05817602202296257, 0.6383229494094849, -0.7867442965507507, 0.6125648617744446, -1.1707669496536255, -0.21003355085849762, 0.19111870229244232, 1.41093909740448, 0.7746576070785522, -0.3460460603237152, 0.051052697002887726, 0.027729086577892303, 0.3267028033733368, 0.26146435737609863, 0.2699981927871704, -0.7493757605552673, -2.1047635078430176, 0.5034969449043274, 0.40405067801475525, -0.9314557313919067, 0.19211412966251373, 1.302931785583496, -1.318119764328003, 0.9071676731109619, 0.47063300013542175, 0.175241157412529, 0.5654274821281433, -0.11283420026302338, 0.6714466214179993, -1.067655324935913, 0.2668610215187073, -0.2481505274772644, 0.3647942543029785, -0.8360062837600708, 0.4752753973007202, 0.3892400860786438, 0.8235119581222534, 0.9600221514701843, 0.9269548058509827, 0.3864172399044037, -0.17094799876213074, -0.47478872537612915, 0.12530498206615448, -0.6222497224807739], 100, 200, 32, false) RETURN e.id, _distance;
---- 1
1

#MATCH (n:dataset) WHERE n.id > 800000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 128, 100000000, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 850000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 250, 100000000, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 900000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 250, 100000000, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 950000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 128, 100000000, false) RETURN Id(_node), _distance;
#
#MATCH (n:dataset) WHERE n.id > 800000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 320, 32, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 850000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 330, 32, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 900000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 300, 32, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 950000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 200, 8, false) RETURN Id(_node), _distance;
