-DATASET CSV vector-index

--

-CASE CREATE_VECTOR_INDEX

-STATEMENT MATCH (n:embeddings) RETURN count(n);
---- 1
10000
-STATEMENT CREATE VECTOR INDEX ON embeddings.embedding (samplingProbability=0.2, alpha=1.0);
---- ok
-STATEMENT UPDATE VECTOR INDEX ON embeddings.embedding;
---- ok
#-STATEMENT MATCH (n1:embeddings)-[e]->(n2:embeddings) RETURN ID(n1), ID(e), ID(n2) LIMIT 10000;
#---- 1
-STATEMENT CALL ANN_SEARCH(embeddings.embedding, [0.0459], 100, 100, false) RETURN Id(_node), _distance;
---- 1
1
