-DATASET CSV vector-index
-BUFFER_POOL_SIZE 1036870912

--

-CASE CREATE_VECTOR_INDEX

-STATEMENT CALL threads=1;
---- ok
#-STATEMENT MATCH (e:embeddings) WHERE e.chunk_id < 10 RETURN e.id LIMIT 1;
#---- 1
#10000
-STATEMENT CREATE VECTOR INDEX ON dataset.embedding (samplingProbability=0.05, alpha=1.0, numVectorsPerPartition=50000000, efConstruction=32, maxNbrsAtUpperLevel=8, maxNbrsAtLowerLevel=16);
---- ok
-STATEMENT UPDATE VECTOR INDEX ON dataset.embedding;
---- 1
1
#-STATEMENT MATCH (n1:embeddings)-[e]->(n2:embeddings) RETURN ID(n1), ID(e), ID(n2) LIMIT 10000;
#---- 1
#-STATEMENT CALL ANN_SEARCH(embeddings.embedding, [0.0459], 100, 100, false) RETURN Id(_node), _distance;
#---- 1
#1
#-STATEMENT EXPLAIN MATCH (p:persons)-[r]->(e:embeddings) CALL ANN_SEARCH(e.embedding, [0.9345602989,0.3516958058,-0.3699700832,0.6464700103,-0.0051191002,0.1901056617,-0.6494457126,0.6592976451,-0.3324870467,-1.8486443758,0.1670958549,-0.4703142643,-0.7063878775,0.3781740963,-0.8445044756,0.3324673772,0.5130634904,-0.3399160206,-0.3135127723,-0.0425650887,-0.6606317759,-0.7583562136,-0.2559657693,0.3376826644,1.0485016108,-0.9493110180,-0.4168295860,-1.0623620749,-0.2233869284,-0.5392091870,0.9910181165,-0.1902675927,0.2193402201,-0.5628473759,-0.1058912501,-0.0731445849,0.7648085356,-0.7680616379,0.6492784023,-0.8156388998,-0.5567196608,0.1914550662,0.2092951685,-0.1709162295,-0.0663615316,0.3102305532,0.7788730264,-1.1010421515,-0.2058919966,0.0560052842,-0.3217823207,0.6256670952,0.0112747867,0.7940005064,0.5653358698,0.1135423258,0.2802402377,0.2003615797,0.0277437437,0.7352414131,-0.2442698181,0.4351690114,0.0586279854,-0.2696811855,-0.5366117358,-0.7870680094,-0.0514620692,-0.1918468773,1.8259142637,0.8860780597,0.7798768878,-0.9456485510,0.1938944310,0.8133299947,-0.6202048063,0.4735247493,0.0453916788,0.0256587174,-0.4485376179,0.4470308423,-0.0479467139,-0.0801830962,0.1642927378,1.0482258797,0.3290217519,-0.1707559079,0.8887743950,-0.4178168178,0.3108623326,0.2958409488,-0.0952216238,-0.5197758079,-0.7118791342,0.3352150321,0.5924757123,-0.7316297293,-0.0307280943,0.7761306167,0.7827879786,1.3988311291,1.8479368687,0.8297441006,0.4163652062,0.3610360026,0.6455091238,-0.2768564224,-0.3970848322,-1.7249760628,-0.5364888310,1.6479914188,0.3439319134,0.5141903758,-0.3722252846,-1.0044952631,0.0697491318,-0.8744603992,0.6098037362,-0.5549165010,1.3042641878,0.7904000878,-0.2474898100,0.6903604865,-0.4700182676,-1.2732446194,0.1016478539,-0.8355982304,-0.0695740879,0.5448973179,-0.0535997041,0.3819672465,0.1103220731,0.4036526084,0.3575894535,-0.0985932797,0.1816684902,-0.0399916619,0.2338221520,1.0038088560,-0.7226974368,-0.4097599089,0.1944292188,-0.6005170941,0.0320572034,0.3904862106,-0.6983782053,-0.0061364435,-0.1386093497,-0.2768156230,0.2632497847,0.5253951550,0.0849193335,0.1428594291,-0.5117708445,0.1393161714,-1.6594072580,-0.2396283746,1.1761345863,0.1457426399,-0.2710433602,-0.6402140856,-0.6530045271,-0.5945470929,-1.3672268391,-0.8966912031,1.0800950527,-0.4371989369,-0.0153167676,1.1188040972,-0.2294539213,0.2910774350,-0.2268345356,0.6105698943,0.6410363317,0.0496572293,0.5890899897,-0.6900884509,0.5562170148,1.6311461926,0.4191218913,1.5104928017,1.3479669094,0.7507336140,-0.3168544769,0.5053893924,0.1382045150,-0.3584392071,-0.6717157364,0.0888925493,-0.6364105344,1.0191127062,-0.3243710697,-0.7235078812,-0.7403106689,0.5875930786,-0.1870464385,0.0128090270,-1.2359956503,-0.3445188403,0.2812179923,-1.3159754276,-0.2196784019,-0.5018225908,0.4493801594,1.5471235514,-0.1783576012,0.3202459812,-0.6292784810,0.4003628790,-0.0408667624,-1.2210818529,-0.4427977502,-0.0151143186,0.5617831945,1.0962730646,0.3142991066,0.0908467397,1.3577922583,0.6439783573,-0.7807786465,0.6844717860,0.1154831052,-0.3546380401,0.7771703005,0.1515785158,-0.0694555342,-0.4818218946,-0.1925639808,1.2967158556,1.3892998695,-0.0791875571,-0.5779584050,0.3637446761,0.6977861524,0.2081884742,0.4193653762,-0.1788998246,-0.6458813548,1.3509135246,0.3644755781,0.3337354362,-0.2308368087,-0.1083837971,-0.6977221370,0.4162903428,0.1680233777,0.2402698547,1.2161082029,-1.0197538137,-0.5500980020,0.1226472557,0.2784285843,-0.3987185657,0.4067897797,0.2798598707,-0.5859481692,0.4570459723,-0.3234679401,-0.5884459019,0.5544129014,0.1085147783,0.5816527605,0.3103162050,-0.4785453379,-1.2368254662,1.5157072544,-2.0818800926,0.2975227833,0.1336414516,0.2660682499,-0.3136654794,-0.4397514760,0.2610940933,-0.2059388012,0.8486213684,0.7581412196,0.4857176244,-0.1169442236,-0.5156872272,-0.4768244326,0.7971833944,0.4032962918,0.0820339769,0.9841399193,0.6013058424,0.1527892649,0.1646098495,0.6375347972,0.1830424219,0.1814115494,-0.4110368192,-0.4399368167,-0.8876962066,-0.0087732989,0.8604729176,0.3879655898,-0.8230612278,0.7701832056,0.5466707349,1.3523527384,0.1008367538,-0.5105193853,-0.3112450838,-0.1950964481,0.8246389031,-0.1661550999,1.3579763174,0.3754545450,0.7272607684,-0.7122267485,-0.8031406999,0.4039377868,0.2774880826,-0.1560651809,-0.7650151849,0.3281931579,0.8795391917,-1.6668385267,0.2732526064,-0.7170993090,-2.1219036579,0.1179406047,-0.1041674465,-0.4632508755,-1.2510206699,0.5808879137,2.2797055244,1.1379363537,0.2825442255,0.3016313612,-0.3652026057,-1.0667282343,0.0946461037,0.3953834772,0.5705730319,-0.0989395082,0.0229044519,0.3357965350,0.4646827877,-0.4108612537,0.3768613338,-0.4739345610,-0.2743298709,-0.3521809280,0.4761364758,-0.0054993848,-0.9573597312,-0.5344414115,1.3521655798,-0.1485500634,-0.2242943645,0.1162917390,0.3804809153,-1.1062651873,0.8530967832,-0.1878880560,0.9160916805,-1.0148516893,-1.2370823622,0.5741415620,0.2765681446,0.2768971324,1.3961918354,0.5351815820,0.1102794707,-0.7512411475,-0.2429808676,0.4303845167,1.2344224453,0.5625381470,0.0327212065,0.0281336512,-0.3241064548,0.2308264226,0.5435184240,-0.4671714306,0.0319915116,-0.3064266443,1.0452880859,0.1446816027,-0.0601055250,-0.0174041409,1.2949973345,0.5266866088,1.0790321827,-0.2387660742,-0.6678582430,-1.4286694527,-0.1334769130,0.5560927987,-0.8942350745,-0.8935456276,-1.0841190815,-1.3263930082,-0.4327652752,0.2484137267,-1.4099357128,-0.6302907467,-0.1619252861,-0.1759816259,-1.8814101219,-2.1784250736,0.1719372422,-0.2888586521,-1.7470711470,0.3380121291,0.4632411301,-0.0418749154,0.8070653677,-0.5639259815,0.5351925492,-1.2439268827,0.0064467471,0.1672568917,1.1936851740,0.4960376024,-0.2842783630,0.2605215013,-0.0038484149,-0.3665599823,0.1901094764,0.8030899167,-0.5578899980,0.4747359157,-0.1859519482,0.5819941759,-0.4493630230,0.1071591750,-0.8011573553,-0.3353287280,-0.9315965772,0.9335856438,0.4788865149,-0.0632761866,1.3279278278,0.6458507180,-0.0741139725,1.0525883436,0.7324820757,-0.3023039401,0.5153490305,-1.2458777428,0.0217436589,0.2255637348,0.4502491653,-0.3991944790,0.1965229660,0.2105283886,-0.0986913145,-0.7310372591,-0.3684863448,0.3225127459,-0.3834201097,0.4932961464,0.5935889482,0.2422866821,-0.6298631430,0.6530699134,0.3664472699,-0.3731464446,-0.2297900617,-0.3567811549,-0.3629868031,-0.9411189556,-1.3108059168,0.6208108664,1.0109655857,0.9356895089,0.2635667026,1.1855210066,0.0760897547,0.2736266255,1.3333380222,-0.8675491214,0.8244047761,-0.2109207362,-0.3754794300,0.1461059898,0.7166336179,0.1436091065,1.1506118774,-0.0165011510,-0.1830297261,0.8956706524,0.3950432837,0.0065888306,-1.3776448965,-0.3613976538,-0.9236240387,-0.4553536475,-0.1263360381,0.4804947972,-0.0084930323,-0.6588051915,-1.0138856173,-0.6622502804,-0.3701840043,-0.0654317886,0.5360110402,-0.1544922292,0.7834382653,-0.2864798009,0.5645533800,-0.2287870198,0.0147341825,0.2598021328,-0.5430952907,1.2475017309,0.1036000624,0.4819896519,-0.3286532164,-0.4316067994,0.0953571498,0.1148282290,-0.0895411447,0.0762995183,-0.6762874126,-0.5686867833,-0.7181727290,-1.4290555716,0.4257959425,0.8349025846,1.1388951540,-0.1297527850,0.7136529088,-0.2969466448,-1.1299349070,0.4652304947,1.0485092402,-0.4376462102,0.1931522787,0.1314420998,-0.1674726903,0.3221138418,0.2158034146,-0.2692326903,0.5088620782,0.2093392015,0.3901309073,0.3193941414,-0.4837864041,-0.6499451399,-0.0166767128,0.3041540086,0.3848906755,-0.6216560006,0.2190511227,0.8263145089,0.2998526394,-0.3634107709,-0.7409484386,0.1616494060,-1.1254786253,0.9237872362,0.4903515279,-0.0254427455,0.2196242809,-0.8990036845,-0.6245098710,0.8764553070,1.0465461016,-0.2930119038,0.8550795317,-0.5417657495,1.0140284300,-0.7744697928,1.0247441530,0.3047273159,-0.8229593039,-0.2697378099,0.3275917172,-0.4310218096,-0.0577286221,-0.0071468046,-0.1280326545,0.9808990955,0.1066064686,-0.4530718327,0.4305432737,-0.2318315953,1.5372350216,0.4770570397,-0.3334834874,0.9441083670,0.2332375795,-2.2884533405,0.1538852751,-0.4205454588,0.1856600344,0.8819646835,0.1638001353,0.4961611331,-0.4001593888,0.9842246771,0.3878536522,-0.6697090864,0.7433186769,-0.0764399171,1.3458460569,-1.8758901358,-0.1591298282,0.3475215137,0.1500542015,-0.5762928128,0.4031805396,0.5850310922,0.4055538774,0.0908068269,0.1272068471,0.9986871481,0.3477927148,-1.0677380562,-0.1747986823,-0.5286790133,0.7462934256,1.0162706375,-0.2591190338,1.3432736397,-0.4384903014,-0.7073900104,0.3068886399,0.1335912347,0.0684302896,0.4835569263,-0.4562380016,0.0401829518,-0.3946934342,0.4513454437,-0.6263619065,-1.1136198044,0.4087659121,0.5327127576,-0.3944357634,0.1952880025,-0.1874342859,-1.0252764225,0.4853097498,0.5049654245,0.1304508299,1.2888656855,-1.1865533590,-0.9900895357,0.1462895572,0.8907606006,0.0008306075,-0.5297138691,-1.3575271368,0.5995661616,-0.3195022345,0.0715507120,-0.7243511677,-0.2978675961,0.0935601369,0.2113900632,0.8054902554,-0.2038113922,-0.1743383706,0.9227657914,0.2845858932,-0.2571411133,-0.2604764998,-0.9796953201,0.1505062431,0.4402669072,0.4764048159,0.4028138816,-0.6306864023,0.3748995662,-0.4437824488,0.2965121865,0.0784799308,0.1271498501,0.4895201027,-1.2069978714,-0.1178889796,0.5814674497,0.6326947808,-0.0857941136,-0.8956437111,-0.1770491898,-1.1515660286,-0.1430795193,-1.3983237743,-0.1603495777,-0.2216231525,1.0921300650,0.4328949749,0.1529746354,0.6281296015,-0.4515798986,-0.0677909032,1.0742294788,-0.0465895794,0.5687287450,1.1077548265,-0.0565815717,-1.4553886652,0.0860259831,-0.0822809711,-0.5500521064,-0.0128520168,0.1582472622,0.7038859725,0.5128412843,-0.1217065156,-0.3609096408,-1.4601233006,0.2281694412,0.1641802639,-0.2857346237,-0.1629987210,0.5740531087,-0.5998672843,1.4532052279,-0.6793450713,0.3098063171,-0.6861256957,0.5491373539,-1.0548108816,-1.2160656452,-0.0420603305,0.0193779953,1.3113780022,0.3756844103,-0.0671695098,-0.0552153587,-0.0172161050,-0.0905616060,-1.1884782314,-0.4546452165,0.6396499872,0.1455890238,-0.2317118943,0.0143179670,-0.8425310850,1.7269258499,0.1201509759,0.3041382730,-0.5129872561,0.3640749454,0.4016531110,0.7015708685,0.0566906184,-0.1854026467,-0.5622750521,-0.9045796990,0.3987714350,0.5972661972,0.4680677056,0.3342359364,-0.0416109450,-0.1030500457,0.4343987405,1.1724637747,-1.2542438507,-0.7351049185,0.2308610976,0.7061869502,-0.6791523695,0.0794785023,-0.7742102146,0.5935772657,0.2149517685,0.4797420204,0.4059185386,0.5804028511,-0.4118138850,-0.0280024372,0.7426470518,-0.0354109108,0.4937309027,-0.5893226862,0.1742519289,0.1910978258,0.1838141233,-0.1610354334,-0.3258605897,-0.3130138516,1.2774220705,-0.5842401385,-0.5782862306,0.3910604119,0.1975892186,0.0741558746,-1.1016647816,-0.0831500888,0.3028296530,-0.2620613873,0.2780410647,-0.6734805703,0.5313099027,-0.3186136484,-0.3507630229,0.1336046457,0.2664844394,-0.2050008327,0.4570130706,-0.3575265110,0.6248670220,0.0936185196,1.1753556728,-0.4160138667,0.5252364278,0.7763914466,0.1131375805,-0.4966948628,0.9737643600,-0.4469394386,0.7286185026,0.8739143014,-0.2787840366,-0.9216789603,-0.0379665717,-0.4823312759,-0.0235136878,-0.2616366148,-0.6013877392,0.1475154161,-0.4653856754,0.2378168553,0.7246811390,0.7428553700,-0.3950136006,0.0780763179,-0.1656126827,0.4907963872,0.1529953331,-0.8476092815,-1.5821558237,-0.3070649803,0.2069006711,0.1685958505,-1.3076630831,-0.1525597423,-0.0589423478,-0.8453422189,1.1727445126,-0.0914056599,0.9383997917,-1.1929122210,-0.0393142290,-0.8231812119,0.1332879961,0.6625736952,-0.6963185668,0.2965284586,0.5766004324,-0.8847033978,-0.4020878375,-0.1817419678,0.1875036508,0.0535929054,-1.3402702808,-0.3514555395,-0.3529890180,-0.2410054952,-0.5374456644,0.0292281918,-1.0599507093,0.7597736716,0.6804797053,0.4562001526,-0.4910306334,-0.6190931201,-0.3366918862,-1.1889758110,1.2893750668,0.7357776165,1.1494642496,0.5613036156,-0.0387221575,0.4052069187,-0.0074574384,-0.4673246145,-0.2854131460,-0.7052047253,0.3355478942,-0.5987812877,-1.0462849140,0.1490595192,-0.5722298622,0.1063884273,-1.0214332342,-0.6016763449,0.8192497492,1.1285768747,-0.3775299191,0.6667815447,-1.0210989714,-0.2610098422,-1.0360052586,0.7183095813,0.8043932915,-0.9655222893,0.7177476883,0.7758089304,-0.4580791295,-0.4925376177,-0.6952249408,0.9565050006,1.1133381128,-0.6553283930,-0.0851445496,0.5010125637,0.0360840634,-0.6300324202,0.7420631647,0.1663611680,-1.0353248119,0.0785169899,-0.2496958673,-0.6696653366,0.3615265787,0.3144558072,-0.1657141894,-0.1029356271,0.3417115808,0.4866890907,0.7484501600,0.9801460505,-0.2360759228,-0.3556689620,-0.2126475573,0.1479545981,-0.7079901695,0.6934206486,-0.3042137623,0.1009406447,0.3456227481,0.1249802783,0.1055084318,-0.3475068212,0.4310313165,0.0375793576,-0.0907774344,-0.0094062388,0.4539944828,-0.9170788527,0.3081185520,-0.2783477604,-0.2020548284,0.2545443475,0.1067549139,0.6302369833,0.0823983625,0.1285206676,0.0723186359,0.4970146418,-0.6784709096,-1.1959445477,-0.0398774333,-0.7682592273,1.4254790545,-1.6039898396,1.5108342171,-1.3717253208,-0.6149474978,0.0268441308,-0.7293106318,0.0343009345,-1.0721608400,-0.0641062781,-0.3603757024,0.0635394230,-0.1388617009,0.3408928216,-0.2590414286,-0.5432212353,0.9920213819,1.3762301207,0.1935712993,-1.7896277905,0.3097203076,-1.4081331491,-0.6876699328,0.7915245295,-0.2669388950,-0.5097162724,0.0043228557,0.1721480340,-0.4329960048,0.7290068269,0.7174295783,0.2664978802,1.1338015795,-1.0299082994,-0.8669632077,0.0854984596,-0.7112109065,-0.9277819991,0.3150381446,0.6102077365,0.1197856888,0.3045895994,-0.8056252599,0.2081037164,0.0866254792,-0.1450729966,1.3244899511,0.1724049598,-0.9338613749,0.5033512712,0.1144178137,0.2487770319,0.5640631318,0.6159973145,-0.3790127039,0.2650041878,-0.6404040456,-0.0620649531,0.1399217844,0.7280440927,-0.7559967041,-0.4443195462,1.1779701710,1.0864623785,-0.2797495127,0.6645542979,0.1969545186,-0.0768443346,0.9201970696,-0.1238547340,0.1050624549,0.3880662918,-0.0628807768], 100, 200, 1, false) RETURN e.id;
#---- 1
#1

#-STATEMENT EXPLAIN MATCH (e:embeddings) CALL ANN_SEARCH(e.embedding, [0.0459,0.0439,0.0251,0.0318,0.0159,0.0564,0.0335,0.0273,0.0156,0.0627,0.0504,0.0116,0.0289,0.0432,0.0388,0.0282,0.0405,0.0417,0.0309,0.0338,0.0165,0.0291,0.0245,0.0208,0.0207,0.0727,0.0386,0.0145,0.0347,0.0462,0.0238,0.0333,0.0616,0.0418,0.0344,0.0448,0.0221,0.0348,0.0275,0.0319,0.0445,0.1036,0.0365,0.0168,0.0539,0.0554,0.0224,0.0432,0.1612,0.0764,0.0892,0.1059,0.0974,0.057,0.064,0.072,0.1108,0.1132,0.0399,0.035,0.0914,0.0654,0.0676,0.0481,0.2254,0.0976,0.1954,0.1424,0.1787,0.0932,0.0989,0.0909,0.1794,0.0632,0.104,0.0889,0.1972,0.0874,0.1693,0.1058,0.0982,0.0606,0.1163,0.0678,0.0728,0.065,0.029,0.0384,0.0692,0.0409,0.0631,0.0669,0.1183,0.0573,0.0792,0.1229,0.0317,0.0608,0.0381,0.0357,0.0282,0.0554,0.0146,0.0199,0.0332,0.0343,0.0357,0.0265,0.0308,0.0283,0.0285,0.0467,0.0312,0.0634,0.0273,0.0298,0.0189,0.0766,0.0253,0.0241,0.0218,0.0432,0.0398,0.0132,0.0252,0.0278,0.0262,0.0261,0.0442,0.0496,0.0578,0.0428,0.0215,0.077,0.0415,0.0274,0.0247,0.0802,0.0313,0.0157,0.0308,0.0564,0.0409,0.0171,0.0445,0.0431,0.0398,0.0338,0.015,0.0268,0.0264,0.0234,0.0342,0.0785,0.044,0.0111,0.0373,0.0732,0.0441,0.0267,0.062,0.0705,0.052,0.0588,0.0347,0.0398,0.0434,0.0626,0.0348,0.0771,0.0439,0.0277,0.0688,0.1063,0.0426,0.0315,0.1182,0.108,0.1233,0.1331,0.1333,0.0894,0.084,0.147,0.1676,0.0873,0.0449,0.0598,0.1058,0.1296,0.1083,0.0598,0.3077,0.171,0.2578,0.1343,0.3025,0.148,0.1543,0.115,0.3003,0.129,0.1667,0.1124,0.2835,0.1885,0.268,0.1088,0.1394,0.0846,0.1385,0.0723,0.1257,0.1025,0.0347,0.0402,0.096,0.0779,0.0715,0.1003,0.1399,0.1198,0.1459,0.1709,0.0286,0.0901,0.0579,0.0447,0.0259,0.072,0.027,0.0172,0.0401,0.0367,0.0308,0.0446,0.0333,0.0428,0.0485,0.0842,0.0423,0.0993,0.0507,0.0226,0.0334,0.1118,0.0455,0.0215,0.034,0.0626,0.0287,0.0151,0.0331,0.0358,0.0273,0.0148,0.0481,0.0572,0.1005,0.041,0.0327,0.039,0.0301,0.0316,0.0348,0.0455,0.0162,0.0291,0.0381,0.0462,0.0711,0.0388,0.1661,0.0992,0.131,0.1682,0.2028,0.1029,0.1002,0.1855,0.1282,0.0897,0.0436,0.0749,0.1315,0.1428,0.0925,0.0733,0.3956,0.2322,0.2294,0.3246,0.4046,0.2421,0.1451,0.292,0.3793,0.2134,0.1256,0.2624,0.3962,0.2613,0.2024,0.2949,0.1559,0.1304,0.1246,0.1057,0.1153,0.1169,0.0454,0.0656,0.1537,0.0689,0.0724,0.1378,0.1997,0.1151,0.1348,0.1879,0.0378,0.0295,0.0267,0.0348,0.0299,0.1118,0.0764,0.0252,0.0216,0.0718,0.0883,0.024,0.0255,0.0446,0.0302,0.0252,0.0384,0.0321,0.0286,0.0506,0.0365,0.0743,0.0723,0.0205,0.0279,0.1004,0.076,0.0191,0.0269,0.0528,0.0361,0.0294,0.0602,0.0421,0.0368,0.0597,0.0258,0.0539,0.0689,0.023,0.05,0.1801,0.0726,0.0224,0.0318,0.051,0.028,0.0313,0.1244,0.0621,0.0508,0.0942,0.077,0.0747,0.1127,0.0799,0.0912,0.1698,0.0911,0.05,0.1001,0.049,0.0347,0.0251,0.1328,0.0812,0.1235,0.0955,0.1485,0.0946,0.1559,0.0929,0.1354,0.0936,0.1809,0.1137,0.1718,0.0684,0.12,0.0801,0.0574,0.0528,0.0601,0.0403,0.0676,0.0763,0.0613,0.0456,0.0588,0.0613,0.1312,0.0859,0.0948,0.0499,0.052,0.0911,0.0325,0.0321,0.025,0.0217,0.0272,0.068,0.0372,0.0287,0.0296,0.0501,0.0738,0.0348,0.0293,0.0277,0.0336,0.0375,0.0297,0.0363,0.0249,0.0299,0.0266,0.0953,0.0633,0.0312,0.0307,0.0476,0.0782,0.0227,0.024,0.0336,0.0265,0.023,0.035,0.0365,0.0427,0.0366,0.0246,0.0864,0.0795,0.0218,0.0382,0.0744,0.0657,0.0357,0.0228,0.0661,0.0471,0.0146,0.0397,0.0349,0.0395,0.0464,0.0203,0.0447,0.0729,0.0205,0.0433,0.075,0.083,0.0212,0.04,0.0859,0.0581,0.0338,0.0453,0.0414,0.0623,0.0866,0.0264,0.0572,0.0933,0.0392,0.0314,0.109,0.092,0.0258,0.0393,0.0864,0.0511,0.037,0.0811,0.074,0.0903,0.1156,0.092,0.1179,0.1505,0.1201,0.1061,0.1405,0.1053,0.0583,0.0773,0.0845,0.0484,0.026,0.2203,0.1299,0.1846,0.0925,0.2102,0.1497,0.2352,0.0999,0.188,0.1712,0.2815,0.1449,0.1963,0.1609,0.1918,0.0808,0.0825,0.0618,0.0858,0.0531,0.0997,0.0804,0.0711,0.0411,0.0658,0.1118,0.1539,0.1242,0.096,0.1132,0.0893,0.122,0.0253,0.0549,0.0244,0.0252,0.0308,0.0559,0.0656,0.0236,0.0404,0.0322,0.0613,0.0598,0.0347,0.0375,0.039,0.0451,0.0408,0.0565,0.0381,0.0251,0.033,0.1151,0.089,0.0261,0.0415,0.0602,0.0762,0.0268,0.032,0.0312,0.0475,0.0221,0.0496,0.0325,0.0585,0.0332,0.0408,0.0616,0.0698,0.0395,0.0429,0.0651,0.082,0.0386,0.0405,0.0342,0.0579,0.0271,0.0939,0.0647,0.0884,0.0954,0.14,0.1124,0.1252,0.105,0.1049,0.1092,0.0498,0.0511,0.1082,0.1031,0.0545,0.0474,0.2339,0.1581,0.1452,0.1777,0.2803,0.2541,0.1426,0.1622,0.2905,0.2539,0.141,0.1648,0.2805,0.2083,0.1199,0.1783,0.0945,0.072,0.0748,0.0624,0.077,0.116,0.0494,0.0385,0.1258,0.0837,0.095,0.0853,0.1383,0.0923,0.0896,0.1217,0.0219,0.0325,0.0252,0.0218,0.0134,0.0766,0.057,0.0276,0.024,0.0582,0.0787,0.0289,0.021,0.0314,0.028,0.0213,0.0291,0.0395,0.0382,0.0296,0.0175,0.0512,0.0698,0.0267,0.0245,0.0752,0.0793,0.0232,0.0263,0.0335,0.0342,0.0296,0.0329,0.0374,0.029,0.0595,0.0235,0.043,0.0518,0.0456,0.0474,0.111,0.0492,0.0248,0.0317,0.0458,0.0297,0.0271,0.0739,0.0451,0.0458,0.0813,0.0789,0.0538,0.0909,0.0962,0.0869,0.1304,0.0801,0.0452,0.0858,0.0506,0.0496,0.0315,0.0812,0.0385,0.0875,0.0608,0.131,0.0597,0.1399,0.0882,0.1321,0.0864,0.1482,0.0969,0.1444,0.0704,0.0887,0.0552,0.0418,0.0448,0.0561,0.0491,0.0658,0.0617,0.057,0.0653,0.0605,0.0585,0.0923,0.0708,0.0723,0.0571,0.0414,0.0629,0.0273,0.0428,0.0371,0.0306,0.0345,0.0721,0.0302,0.0345,0.0224,0.052,0.0572,0.0428,0.0288,0.0317,0.0263,0.0414,0.0285,0.0348,0.0291,0.0282,0.0206,0.0705,0.049,0.0296,0.0214,0.0694,0.0656,0.0416,0.0306,0.0256,0.0202,0.0232,0.0167,0.0198,0.0256,0.0207,0.0189,0.0481,0.0428,0.0321,0.0217,0.0511,0.0531,0.0196,0.0206,0.0283,0.0257,0.0161,0.0169,0.0269,0.0302,0.0294,0.0173,0.0262,0.0316,0.0299,0.019,0.0491,0.0637,0.0251,0.0201,0.0426,0.0338,0.0233,0.0246,0.0225,0.0354,0.0744,0.0202,0.0372,0.049,0.039,0.0322,0.0636,0.0502,0.0283,0.0233,0.0521,0.0461,0.0285,0.0469,0.0615,0.0489,0.0993,0.0668,0.0872,0.1215,0.0866,0.0879,0.0996,0.0837,0.0378,0.055,0.0551,0.041,0.0295,0.1195,0.0654,0.1101,0.0597,0.1516,0.0881,0.1781,0.0614,0.1401,0.109,0.2157,0.0452,0.1375,0.085,0.1214,0.035,0.0435,0.0465,0.0585,0.0344,0.0746,0.0636,0.0506,0.0325,0.0465,0.1114,0.134,0.0451,0.0784,0.0642,0.0518,0.0704,0.0234,0.0486,0.038,0.0358,0.0266,0.0543,0.0312,0.0305,0.022,0.0611,0.0565,0.0329,0.0256,0.0419,0.0432,0.052,0.023,0.0339,0.0296,0.0324,0.0156,0.0747,0.0633,0.0197,0.0167,0.0449,0.058,0.0261,0.0237,0.0272,0.0337,0.0182,0.024,0.0259,0.0207,0.0165,0.0301,0.047,0.0439,0.0349,0.0306,0.0499,0.0622,0.0369,0.0214,0.0234,0.0291,0.0225,0.0373,0.0298,0.0386,0.0449,0.0865,0.0706,0.0773,0.0548,0.0537,0.0741,0.0339,0.0295,0.0573,0.0492,0.0204,0.0413,0.0796,0.0449,0.0652,0.0425,0.1487,0.1466,0.0773,0.0685,0.1442,0.1594,0.0879,0.0544,0.1113,0.0798,0.0579,0.0586,0.0448,0.0493,0.0358,0.0171,0.0489,0.0726,0.0282,0.0228,0.0583,0.0614,0.0752,0.0312,0.0539,0.0429,0.0458,0.0461], 100, 200, 1, false) RETURN e.id, _distance;
#---- 1
#1
