-DATASET CSV vector-index

--

-CASE CREATE_VECTOR_INDEX

-STATEMENT MATCH (n:embeddings) RETURN count(n);
---- 1
5000
-STATEMENT CREATE VECTOR INDEX ON embeddings.embedding (M=16);
---- ok
