-DATASET CSV complex-vector-index

--

-CASE CREATE_VECTOR_INDEX

-STATEMENT MATCH (n:persons) RETURN count(n);
---- 1
10000
-STATEMENT CREATE VECTOR INDEX ON embeddings.embedding (samplingProbability=0.05, alpha=1.1, numVectorsPerPartition=50000000, efConstruction=200, maxNbrsAtUpperLevel=32, maxNbrsAtLowerLevel=64);
---- ok
-STATEMENT UPDATE VECTOR INDEX ON embeddings.embedding;
---- 1
1
#-STATEMENT MATCH (n1:embeddings)-[e]->(n2:embeddings) RETURN ID(n1), ID(e), ID(n2) LIMIT 10000;
#---- 1
#-STATEMENT CALL ANN_SEARCH(embeddings.embedding, [0.0459], 100, 100, false) RETURN Id(_node), _distance;
#---- 1
#1
-STATEMENT EXPLAIN MATCH (n:persons)-[r]->(e:embeddings) WHERE n.birth_date > DATE('1997-01-01') CALL ANN_SEARCH(e.embedding, [-0.13074035942554474, -0.11036457121372223, -1.2414557933807373, 0.6815852522850037, 0.5377219319343567, 0.353532075881958, -0.1961292326450348, -0.8198744654655457, 0.7403571009635925, -0.4667998254299164, -0.25637614727020264, 0.4690445065498352, -0.35455217957496643, -0.9163416624069214, 0.3384556770324707, 0.10572801530361176, -0.24479854106903076, -0.06863178312778473, -1.0084848403930664, -0.6793057322502136, 1.5745874643325806, -0.5046554803848267, 0.5119291543960571, -0.5269959568977356, -0.19540132582187653, 0.26367616653442383, 0.8618758320808411, -0.6465486884117126, -0.22201575338840485, 0.7980281114578247, -0.04780108109116554, 0.3250841200351715, 0.30059510469436646, -0.9767253398895264, -0.09649553149938583, 0.27558958530426025, 0.4848115146160126, 0.7396630048751831, -0.38177913427352905, -0.6647166609764099, -0.049349937587976456, -0.6210650205612183, -0.5652395486831665, -0.41253218054771423, -0.10697898268699646, -0.38550588488578796, -0.8549039959907532, -0.27531898021698, -0.18516220152378082, -0.5123472213745117, -0.2281123399734497, 0.19447505474090576, 0.9511458873748779, -0.11440638452768326, -0.004122218117117882, 0.6278058290481567, 0.3504989743232727, 0.4083824157714844, -0.18714682757854462, -0.0863538533449173, 0.38927772641181946, -0.9098357558250427, -0.11634360253810883, -0.025028884410858154, 0.058488041162490845, 0.4826410412788391, -0.2619604170322418, 0.5785018801689148, 0.16742053627967834, -0.3366076350212097, -0.19301541149616241, 0.09694435447454453, -1.0056109428405762, 0.43280670046806335, -0.5824068188667297, 0.26788294315338135, -0.7796151638031006, -0.5966677069664001, 0.6393744945526123, 0.8842452764511108, -0.6160180568695068, -0.5705506801605225, 0.036082614213228226, -0.22053667902946472, -0.3459427058696747, 0.5491650700569153, 0.37335580587387085, 0.6734334826469421, 0.6774606704711914, -0.1586034744977951, 0.4593186676502228, 1.2434828281402588, 0.08183547854423523, 0.10435431450605392, -0.11881409585475922, -0.3758099675178528, 0.009363062679767609, -0.43553876876831055, -0.5817691087722778, 0.9612753987312317, -0.24862349033355713, 1.0704150199890137, -0.30473592877388, 0.2752782106399536, -0.4995260238647461, -0.9751267433166504, 0.8851644396781921, 0.7291184663772583, -0.8572035431861877, 0.9964689016342163, 0.21247714757919312, -0.40725961327552795, 0.006748013198375702, 0.08450144529342651, -0.6118457913398743, -0.7197007536888123, 0.9241440296173096, -0.14576801657676697, 0.95381760597229, 0.5320149064064026, -0.39271655678749084, 0.1592126041650772, 0.5574715733528137, 0.5320626497268677, -1.169288992881775, 0.24277664721012115, 0.2389252930879593, 0.20720882713794708, 0.8248850703239441, -0.5503953099250793, 1.3515030145645142, 0.36216121912002563, 0.2620912492275238, 0.2882139980792999, 0.06135851889848709, 0.5234391689300537, -0.10515328496694565, 1.1265206336975098, -0.5196458697319031, -0.087828129529953, -1.2023265361785889, 0.594163179397583, 0.6360912322998047, -0.21345622837543488, 0.6753940582275391, -0.6261899471282959, -0.18282869458198547, 0.4296554625034332, 0.9794951677322388, -0.16463498771190643, 0.06256166845560074, 0.1602323055267334, 0.11834081262350082, -0.6154771447181702, -0.7918299436569214, 0.6052373051643372, -0.38821858167648315, 0.2618519961833954, -1.9243477582931519, -0.45992645621299744, -0.14461176097393036, -0.3991948366165161, 0.6412429213523865, 0.9274112582206726, -0.22624097764492035, 0.7727318406105042, 0.8133514523506165, -0.22035464644432068, -0.21434220671653748, 0.02333163656294346, 1.0356028079986572, 0.38951608538627625, 0.6331484913825989, 0.15391002595424652, 0.6593054533004761, 0.4135391414165497, 0.1767040193080902, -0.15625321865081787, 0.5365511178970337, -0.4225902259349823, 0.8233226537704468, 0.7644411325454712, -0.35406017303466797, -0.9158075451850891, 0.2188451588153839, 0.18407222628593445, 0.7303085327148438, -0.39395126700401306, -0.29788780212402344, 0.6811335682868958, -0.2765071988105774, -1.1046104431152344, 0.45021992921829224, 0.5995920300483704, 0.5714607238769531, 0.25433602929115295, -0.1400507092475891, 0.45163798332214355, 0.4218161106109619, -0.4612651467323303, -0.42856383323669434, -0.03574340045452118, 0.7206312417984009, 0.6691804528236389, -0.4896898567676544, 0.37016791105270386, -0.3177448809146881, -1.4918144941329956, -0.7186225652694702, -0.38037580251693726, 0.4900917410850525, 0.3072184920310974, 0.661041259765625, -0.2999073266983032, 1.3978192806243896, 0.16702181100845337, -0.09190159291028976, -0.3138386309146881, -0.3071138560771942, -0.5588959455490112, 1.0512938499450684, -0.06841009855270386, -0.24829764664173126, 0.06548576802015305, -0.19451871514320374, 0.30930376052856445, -0.28665706515312195, -1.0299557447433472, 0.325422465801239, -0.6059971451759338, -0.4098717272281647, 0.09915813058614731, -0.7161926031112671, -0.35477298498153687, -0.5595853924751282, 0.2593274414539337, 0.03326287120580673, -0.0965123325586319, -0.21239851415157318, 0.12880243360996246, -0.1371186375617981, -0.5499994158744812, 0.6519421935081482, 0.074730783700943, -1.4190539121627808, -0.7767025232315063, 0.7924820780754089, -0.7088330388069153, -0.1368263065814972, 0.7221221327781677, -0.2186584323644638, 0.39660733938217163, -0.21995539963245392, -0.4618210196495056, -0.5733336210250854, 0.15978187322616577, 0.04328206926584244, 0.21146172285079956, -0.027861595153808594, 0.3487309515476227, 0.1403103768825531, 0.8208160996437073, -0.2602258026599884, -0.6765721440315247, -0.03690372779965401, -1.349219560623169, -0.3390048146247864, 0.3573794960975647, -0.02892671339213848, -0.5551645755767822, 0.2233714610338211, 0.3564055263996124, 0.35798245668411255, 0.501941442489624, -0.551741898059845, -0.1524120271205902, 0.09438050538301468, 0.572634220123291, 0.26024097204208374, 0.49173450469970703, 0.624290406703949, 0.6633930802345276, -0.01377280242741108, 0.4761071503162384, 1.0152783393859863, -0.016177304089069366, -0.27278202772140503, 0.9685368537902832, 0.6993628740310669, 0.7564641237258911, 0.29732099175453186, -1.178373098373413, -0.05693601071834564, 0.4251946210861206, 0.2555442750453949, -0.4838487505912781, 0.057924363762140274, -0.737518310546875, 1.5661221742630005, -0.2527580261230469, -0.6280278563499451, -0.8071920871734619, -0.4305080473423004, -0.3923994302749634, -0.00784275308251381, -0.04959530010819435, -0.4633139967918396, -0.13055382668972015, 0.2746550142765045, 0.857121467590332, 0.6688046455383301, 0.8519638776779175, -0.16404183208942413, -0.41949209570884705, 0.15249106287956238, 0.010947417467832565, -0.31254321336746216, -0.49096134305000305, 0.3106284737586975, 0.4332907199859619, 0.29152873158454895, 0.4490765333175659, 0.4756567180156708, 0.48296505212783813, 0.6083718538284302, 0.849477231502533, 0.5987112522125244, 0.4984220862388611, -0.3886954188346863, -0.21472759544849396, -0.31259581446647644, 0.312087744474411, -0.24766801297664642, 0.2727981209754944, 0.5823768973350525, 0.14776873588562012, 0.265203595161438, 0.032167062163352966, -0.08487091213464737, 0.6640534996986389, -0.18754027783870697, -0.026962988078594208, -1.040297508239746, 0.9522789716720581, 1.362983226776123, -0.2520598769187927, 0.20677129924297333, -0.17081956565380096, -0.5096174478530884, -0.5927988886833191, -0.506130576133728, 0.46430590748786926, 0.32281187176704407, 0.25332820415496826, -0.30970636010169983, 0.04118546098470688, -0.159049853682518, 0.29734304547309875, -0.8258192539215088, 0.18341797590255737, 0.03816942870616913, 0.09719513356685638, 0.923629879951477, -0.24744130671024323, 0.2922091484069824, -0.6902499794960022, -1.1379485130310059, -0.00509006530046463, -0.29622676968574524, -0.16189181804656982, 0.276840478181839, 0.6270783543586731, -1.1700352430343628, 1.097442388534546, -0.37429186701774597, 0.6817194223403931, -0.33489108085632324, -1.3626505136489868, -0.13178694248199463, 0.0884157046675682, -0.6412010788917542, 0.26443883776664734, -0.5150936245918274, 1.0495654344558716, -0.5900075435638428, 0.5355010032653809, 0.5758801698684692, -0.37277650833129883, 0.9216927289962769, 0.25103282928466797, 0.005261768586933613, 0.4641280472278595, -0.34338873624801636, 1.08322274684906, 0.6335599422454834, -0.08648069202899933, 0.9146289825439453, 0.3047792613506317, 0.36445897817611694, 0.18717321753501892, -0.8506467938423157, -0.04221927374601364, 0.26498475670814514, 0.03805266320705414, -0.02015915885567665, 0.16208809614181519, 0.6739467978477478, -0.0764971524477005, 0.35809943079948425, 0.3578987717628479, -0.02218819223344326, -0.013222483918070793, 0.9562284350395203, 0.7786144614219666, 0.46849700808525085, 0.7081804871559143, 0.04094918072223663, -0.4056905508041382, -0.2869454026222229, -0.43369194865226746, 0.6661877036094666, -0.733906090259552, 0.3187004029750824, -0.29815322160720825, -0.6323134899139404, -0.6250150799751282, -0.2477591633796692, -0.5138943195343018, -0.09441506862640381, -0.4900527000427246, 0.3781292736530304, 0.47252917289733887, 0.3518756628036499, 0.368022084236145, -0.06584055721759796, 0.7607429027557373, -0.42523282766342163, -0.9460334181785583, -0.10889387130737305, 1.2614332437515259, 0.6833429932594299, 0.1234462559223175, -0.09768283367156982, -0.8757755756378174, 0.17707276344299316, -0.2879883944988251, 0.7519082427024841, 0.5765071511268616, -0.3893662095069885, -0.1800331175327301, -0.4346093237400055, 0.5134881138801575, 1.2702062129974365, 0.38909459114074707, 0.9887557625770569, 0.594173789024353, -0.03339424729347229, -1.1062941551208496, 0.5238312482833862, -0.542709469795227, -0.47670087218284607, -0.4184873402118683, -0.09969478845596313, -0.9565403461456299, 0.7834238409996033, -0.08024375140666962, 1.1928703784942627, -0.024204205721616745, 0.568061113357544, -0.03730738162994385, -1.4514307975769043, -0.23739930987358093, 0.38706451654434204, 0.5631852746009827, -0.8751484751701355, 0.5723654627799988, 0.13284440338611603, 0.6163075566291809, 0.9983178973197937, -1.0183502435684204, 0.5068255066871643, -0.2453719526529312, -0.7264794707298279, 0.09063280373811722, 0.09761454164981842, 0.14245973527431488, -0.4126587510108948, -0.5663182139396667, 0.34064552187919617, -0.16869165003299713, 0.3151043653488159, 0.31112468242645264, 0.04030108451843262, 0.35838404297828674, -0.5315074324607849, -0.27814921736717224, -0.31853288412094116, 0.55865079164505, 0.6788144707679749, 1.2807952165603638, -1.6179171800613403, -0.2886742949485779, -0.44120821356773376, -0.6399502158164978, 0.001557566225528717, -0.18502818048000336, 0.10154140740633011, 0.03163488954305649, -0.5207124352455139, 0.07896797358989716, 0.12120930850505829, -0.5173678994178772, -0.16742698848247528, -0.7108670473098755, -0.5840961337089539, -0.3227190375328064, -0.6401781439781189, 0.3787587881088257, -0.5673178434371948, 0.10622943937778473, -0.46107420325279236, 0.6555370092391968, -0.3464455306529999, 0.523051381111145, 0.42914479970932007, 0.6307687759399414, 0.7146127820014954, 0.4234393239021301, 0.12089976668357849, 0.30983686447143555, 0.415393203496933, 0.3669547140598297, 0.04435012862086296, 0.7112900614738464, 0.387023389339447, 0.2535112500190735, 0.8347364068031311, 0.01942327991127968, -0.8447588682174683, 0.9911845922470093, -0.9132509827613831, -0.4359651207923889, 0.3956478536128998, 0.9902136325836182, -0.024531200528144836, 0.0313916876912117, -0.499372273683548, 0.057985737919807434, 0.2888503968715668, -0.9989596605300903, -0.6559337973594666, -1.0287442207336426, 0.7433280348777771, 0.47823864221572876, 0.5069094300270081, 0.24162504076957703, 0.27045756578445435, 0.8797525763511658, -0.621334433555603, 0.7337746620178223, -0.5276381373405457, -0.02412819303572178, 0.3664776384830475, 0.25268808007240295, -0.9876944422721863, 1.1418074369430542, 0.04744264855980873, -0.537581205368042, 0.5430002212524414, -0.08428993076086044, -0.04429946839809418, 0.7654014229774475, 0.3711727559566498, -0.5045211911201477, -0.48981350660324097, -0.0007620875257998705, -0.026935644447803497, -0.7636025547981262, -0.5515347123146057, 0.9922566413879395, 0.5274873375892639, 0.3886861801147461, 0.6923630237579346, 0.24672751128673553, -1.254912257194519, -0.7579625844955444, 1.366312026977539, 0.5796763896942139, -0.19303590059280396, -0.6264544725418091, 0.13312947750091553, -0.4268529713153839, 0.18329507112503052, -0.14938004314899445, -0.4423808753490448, 0.06522759050130844, -0.15961655974388123, 0.39361000061035156, 0.4131615161895752, -0.5186626315116882, -0.22211506962776184, 0.05584784224629402, -0.4278424382209778, 0.7219953536987305, 0.6700669527053833, 0.6791077852249146, -0.7448801398277283, 0.4942110776901245, 0.0028099119663238525, -0.6215088367462158, 0.2800661325454712, 0.20046024024486542, -0.017103396356105804, -0.47838541865348816, 1.5701135396957397, 0.9050946235656738, -0.3641430139541626, -0.2413972169160843, 0.736062228679657, 0.482975572347641, -0.2594573497772217, -0.6296876072883606, -0.10585068166255951, -0.6217472553253174, 0.8421958684921265, -0.8408044576644897, -0.28654271364212036, 0.09863048791885376, -0.8757769465446472, -0.3787761330604553, -0.48482605814933777, 0.2392248511314392, -0.12110593169927597, 0.24845659732818604, 0.2064381241798401, -0.4326985776424408, 0.28804171085357666, -0.22870704531669617, 0.9699743986129761, -0.46826690435409546, 1.366092324256897, 0.5516701936721802, 0.3556593954563141, -0.5267589688301086, 0.34464240074157715, -0.3680407702922821, -0.12369169294834137, 0.9599516987800598, -0.043482497334480286, -0.34543657302856445, 0.004530707374215126, 0.08470965921878815, -0.02288917824625969, -1.4609485864639282, 0.17200340330600739, -0.11900677531957626, 0.5332058668136597, 0.9684373736381531, -0.22142969071865082, -0.3990885317325592, -0.9426301717758179, -0.2529869079589844, -0.15284880995750427, 0.2391422986984253, 0.010938037186861038, -0.18392224609851837, -0.39595508575439453, -0.6901044249534607, -1.106490969657898, -0.4080739915370941, 0.13250970840454102, 0.6209744215011597, -0.5973653793334961, 0.28769445419311523, -0.2961288392543793, 0.5450214743614197, -0.2815045118331909, -0.9465480446815491, 0.06431195139884949, 0.8281475305557251, -0.10856524854898453, -2.019564151763916, -0.11162042617797852, 0.43942224979400635, -0.3658788800239563, -0.8208853602409363, -0.6686201095581055, -0.7265767455101013, 0.2632545232772827, 1.352971076965332, 0.5683966279029846, 0.6512981653213501, 0.21209421753883362, 0.06294172257184982, 0.0028734374791383743, -1.8066891431808472, 0.8028349876403809, 0.5696085691452026, 0.041280291974544525, 0.6207804679870605, 0.5119217038154602, 0.03753206506371498, -0.8906672596931458, 0.5618933439254761, -0.3021780252456665, -1.084492802619934, -0.09891759604215622, 0.5454154014587402, 1.633004903793335, 0.8000105619430542, 0.4208681881427765, -0.63043212890625, -0.34781837463378906, -1.3773013353347778, 0.6967601180076599, -0.32874178886413574, 0.45021891593933105, -0.8373060822486877, 0.05298539623618126, -0.23152592778205872, 0.1433958113193512, 1.1797535419464111, 0.20769524574279785, -1.0104186534881592, 0.48518964648246765, -0.24887584149837494, 0.9020652770996094, -0.4540117383003235, -0.1230897381901741, 1.4456169605255127, -0.1274988204240799, -0.21411937475204468, -0.47916316986083984, -0.3433413505554199, 1.1198383569717407, -0.3114195764064789, 0.06299616396427155, -0.5370457172393799, -0.4140097200870514, 0.5737070441246033, 1.1634955406188965, 0.1487913876771927, 0.38505053520202637, -0.9344167113304138, -0.9277029633522034, 0.16395346820354462, 0.3320539593696594, 0.23699891567230225, 0.31140658259391785, 0.02299998328089714, -0.21247535943984985, 0.06643027067184448, -0.20101307332515717, -0.5771570205688477, 0.012997820973396301, -0.47961631417274475, 0.6221598386764526, 0.48598575592041016, 0.5555008053779602, -0.7429556846618652, 0.6364368200302124, -0.10308833420276642, 1.458645224571228, 0.01620340533554554, -0.5475060343742371, -0.5103349089622498, -0.02432176098227501, -0.864327609539032, 0.27250969409942627, 0.5027845501899719, -0.19394449889659882, 0.1413383185863495, -1.0658241510391235, -0.7476648688316345, 0.5782466530799866, 0.21587985754013062, -0.8671123385429382, -0.42719200253486633, -0.05235139653086662, 0.0813378170132637, 0.5968199968338013, -0.5199946165084839, -0.1718023419380188, -1.1163344383239746, -0.6516939997673035, -0.045177165418863297, 0.9468977451324463, 0.5095664858818054, -0.5929527878761292, 0.3330574631690979, -0.9506452679634094, -0.3453025817871094, -0.061136022210121155, 0.6180916428565979, 1.049346685409546, 0.3813122808933258, -0.22918778657913208, -0.0099015012383461, -0.2510607838630676, 0.7125244736671448, -0.04601225256919861, -0.7024540305137634, -0.3445565104484558, 0.20632930099964142, -0.29596900939941406, 0.06805571168661118, -0.7417154312133789, 1.0418118238449097, -1.3616371154785156, -0.3698262572288513, -0.5044902563095093, 0.10371407866477966, 0.010764434933662415, -0.027296317741274834, 0.14120066165924072, -0.14588910341262817, -0.14851464331150055, -0.3887437582015991, 0.5220301151275635, 0.5379598140716553, -0.015033338218927383, -0.5342329740524292, -0.3328529894351959, -0.46826717257499695, 1.0567688941955566, -0.18180766701698303, 0.049674633890390396, -1.0564372539520264, 0.4505860507488251, -0.5123749375343323, 0.1501673460006714, 0.9988366961479187, 0.5986960530281067, 0.7847064733505249, 0.4866750240325928, -0.45825281739234924, 0.5751414895057678, -0.4180316627025604, -0.4885708689689636, -0.09924910962581635, -0.3770284354686737, 0.6180554032325745, 0.07422380149364471, -0.04155183956027031, 0.40941321849823, 0.5398247241973877, -0.1268339455127716, -0.2952859401702881, 0.28336870670318604, 0.3568403720855713, -0.23384316265583038, -1.0909607410430908, -0.28861019015312195, 0.4683801233768463, 0.5935954451560974, 0.2397431880235672, 0.1036461591720581, 0.10776828229427338, 1.4077118635177612, 0.20196199417114258, -0.6557294726371765, -0.42835548520088196, 0.007985103875398636, 0.048405926674604416, -0.4178199768066406, 0.12309111654758453, 0.46883219480514526, 0.8194401264190674, -0.2795904576778412, -0.059001266956329346, 0.07375232875347137, -0.26085278391838074, -0.2603853940963745, -0.26033541560173035, -0.1362144649028778, -0.5481361150741577, -0.3747352063655853, -0.46848854422569275, 0.3791272044181824, 0.4343808591365814, -0.3275081217288971, 0.3339744508266449, -0.31247881054878235, 1.3322850465774536, 0.25955870747566223, 0.11836998909711838, 0.3477562367916107, -0.35778042674064636, -0.5810141563415527, -1.42190420627594, -0.22054320573806763, 0.2244642823934555, 0.6331892013549805, 0.7728080749511719, -0.23501960933208466, -0.5062177181243896, 0.7179355621337891, 0.5094927549362183, 0.36346811056137085, -0.43370577692985535, 0.16224488615989685, 0.3926389813423157, 0.23500403761863708, -0.14201799035072327, -0.35070616006851196, 0.5164827108383179, 0.39421194791793823, -0.6310678720474243, 0.7765716910362244, -0.06388802081346512, 0.6766571402549744, 0.3225356340408325, 0.7614443302154541, -0.4922490417957306, 0.16277800500392914, 0.2812950909137726, 0.02633090317249298, -0.4748026430606842, 0.22681662440299988, 0.8378726840019226, 1.0898535251617432, -0.07347562909126282, 0.7843826413154602, 0.6342518329620361, -0.12320339679718018, 0.3026354908943176, -0.9450458288192749, -0.5434502959251404, -0.9262956380844116, -0.5257783532142639, 0.668209969997406, -0.7107778787612915, 0.40733301639556885, 0.42423775792121887, -0.5679957866668701, 0.03834345564246178, 0.13208892941474915, 1.3913003206253052, -0.6483384370803833, -0.018366433680057526, 0.0033455598168075085, 0.2036278396844864, -0.3901989758014679, 0.7946901917457581, 0.4535962641239166, 1.7979084253311157, 0.30311712622642517, 0.35980260372161865, -0.32719045877456665, 0.6483407020568848, 0.0036623310297727585, 0.3837459981441498, -0.5834952592849731, 0.1879209727048874, -0.410665363073349, 0.9985879063606262, -0.4582669138908386, 1.0156991481781006, 0.20251528918743134, 0.4687712788581848, 0.07838734239339828, -0.9620279669761658, 0.4789705276489258, -0.1251530945301056, -0.30528679490089417, -0.7327426671981812, 0.4570245146751404, 1.0064730644226074, 0.42017853260040283, 1.118128776550293, -0.2769273817539215, 1.0270578861236572, -0.767580509185791, -0.28797781467437744, 0.553601861000061, -0.19498468935489655, -0.11761461943387985, 0.6458606719970703, 0.10912056267261505, 0.2554228603839874, 0.6598545908927917, 1.2473936080932617, -0.9370859265327454, 0.08623422682285309, 1.7019277811050415, 0.02836770750582218, -0.025981400161981583, -0.27050602436065674, 0.7065056562423706, 0.40600916743278503, -1.79569411277771, 0.3063056766986847, -0.7750577330589294, 0.29416558146476746, 0.4677976071834564, -0.45163944363594055, 0.06629878282546997, -0.21315264701843262, 1.062420129776001, -1.1194350719451904, 0.8277050256729126, 0.3637703061103821, -0.7486276030540466, -0.5353367328643799, -0.7669677138328552, 0.43453818559646606, 0.4747556149959564, 0.35538917779922485, 0.535586416721344, -0.30967506766319275, 0.6870360374450684, -1.0070325136184692, -0.13316400349140167, -0.1982230246067047, 0.6257407069206238, 0.3101324439048767, 0.42929312586784363, 0.49556252360343933, 0.5634082555770874, 0.2200520783662796, 0.67030268907547, -0.8224767446517944, 0.41406577825546265, -1.3664606809616089], 100, 200, 32, false) RETURN e.id, _distance;
---- 1
1

#MATCH (n:dataset) WHERE n.id > 800000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 128, 100000000, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 850000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 250, 100000000, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 900000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 250, 100000000, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 950000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 128, 100000000, false) RETURN Id(_node), _distance;
#
#MATCH (n:dataset) WHERE n.id > 800000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 320, 32, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 850000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 330, 32, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 900000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 300, 32, false) RETURN Id(_node), _distance;
#MATCH (n:dataset) WHERE n.id > 950000 CALL ANN_SEARCH(n.embedding, [0.0117,0.0115,0.0087,0.01,0.0785,0.1,0.0784,0.053,0.0524,0.0819,0.0658,0.058,0.0159,0.017,0.0461,0.0242,0.0084,0.0064,0.0072,0.0102,0.0304,0.0679,0.0589,0.0571,0.0333,0.0786,0.0892,0.0423,0.0138,0.0133,0.029,0.0219,0.009,0.0122,0.0107,0.0108,0.0266,0.0385,0.0571,0.052,0.0355,0.0488,0.0692,0.0531,0.0144,0.0143,0.0149,0.025,0.0171,0.0161,0.0106,0.0324,0.0271,0.0458,0.0531,0.0624,0.0316,0.0608,0.0661,0.0813,0.0186,0.0227,0.0116,0.0337,0.0247,0.0118,0.0107,0.0639,0.0395,0.0403,0.0525,0.0958,0.0551,0.0676,0.0858,0.1749,0.0244,0.0281,0.0087,0.0512,0.0149,0.0086,0.0124,0.0356,0.0328,0.0387,0.0463,0.0489,0.0492,0.0641,0.0705,0.1164,0.0206,0.0162,0.0125,0.0402,0.0135,0.0113,0.0074,0.0118,0.033,0.0298,0.0365,0.042,0.0441,0.0519,0.0659,0.0527,0.0139,0.0162,0.0151,0.0224,0.0118,0.0088,0.0078,0.0109,0.0373,0.0705,0.0628,0.0391,0.0242,0.0558,0.0721,0.0448,0.0168,0.0134,0.0331,0.0208,0.0041,0.009,0.0165,0.0117,0.0962,0.1359,0.1215,0.088,0.0639,0.1174,0.097,0.0703,0.0126,0.0219,0.0746,0.0422,0.0037,0.0084,0.01,0.0132,0.032,0.0613,0.0751,0.0914,0.0429,0.0641,0.0747,0.0466,0.0087,0.0286,0.0515,0.0279,0.0073,0.0149,0.0225,0.0182,0.0181,0.0176,0.0862,0.064,0.0275,0.029,0.0558,0.0605,0.0114,0.0145,0.0207,0.0285,0.0208,0.0191,0.012,0.045,0.0234,0.0231,0.0533,0.0818,0.0397,0.0243,0.0389,0.1082,0.0221,0.0303,0.016,0.0534,0.0271,0.0189,0.0164,0.0881,0.0437,0.017,0.0282,0.139,0.0601,0.0391,0.0371,0.2031,0.0362,0.0341,0.0119,0.0745,0.0167,0.0053,0.0104,0.0456,0.0222,0.0201,0.0156,0.0458,0.0431,0.0402,0.0444,0.1346,0.0206,0.0192,0.015,0.0468,0.0103,0.0066,0.012,0.0179,0.0185,0.0195,0.044,0.0329,0.0298,0.0706,0.0955,0.0581,0.0097,0.0157,0.0319,0.0406,0.0074,0.0098,0.0103,0.0116,0.0407,0.083,0.0675,0.0356,0.0352,0.0849,0.074,0.0575,0.008,0.0105,0.0502,0.0379,0.0099,0.0213,0.0365,0.0247,0.0481,0.0781,0.0942,0.084,0.0417,0.0525,0.0729,0.0664,0.0101,0.0231,0.0868,0.0646,0.0338,0.0216,0.019,0.037,0.0274,0.0446,0.0435,0.1009,0.0525,0.0677,0.0575,0.0464,0.0227,0.0417,0.0475,0.024,0.0608,0.0334,0.0368,0.0763,0.0533,0.0219,0.0608,0.1125,0.0674,0.0218,0.0527,0.1312,0.0589,0.0331,0.0216,0.0653,0.0221,0.0174,0.0307,0.0303,0.0273,0.0294,0.0628,0.0338,0.0401,0.0437,0.059,0.0761,0.0286,0.0189,0.0418,0.0696,0.008,0.0079,0.0095,0.0111,0.0818,0.1053,0.087,0.0531,0.0518,0.0886,0.0751,0.0689,0.0158,0.0182,0.0516,0.0286,0.0062,0.0048,0.0068,0.0097,0.0337,0.0694,0.0721,0.0618,0.0365,0.0824,0.1105,0.0488,0.0139,0.0127,0.0314,0.0209,0.0103,0.0085,0.01,0.0086,0.0292,0.0371,0.0693,0.0521,0.0312,0.0465,0.0836,0.0486,0.0141,0.0119,0.0146,0.0228,0.016,0.0123,0.0101,0.0303,0.0274,0.0497,0.0706,0.0674,0.03,0.0573,0.0547,0.0882,0.0157,0.0201,0.0119,0.0353,0.0225,0.0112,0.0097,0.06,0.0373,0.0441,0.0594,0.0887,0.0494,0.066,0.0827,0.184,0.023,0.0241,0.0098,0.0501,0.0139,0.0064,0.0112,0.0338,0.0315,0.0393,0.0474,0.0409,0.0426,0.066,0.0732,0.125,0.0224,0.0155,0.0121,0.0373,0.0112,0.0063,0.0075,0.0112,0.032,0.0283,0.048,0.0412,0.0419,0.0583,0.0784,0.0516,0.0135,0.0142,0.0169,0.0195,0.0097,0.0057,0.0059,0.008,0.0382,0.0748,0.0619,0.0505,0.0271,0.0609,0.0845,0.0551,0.0158,0.012,0.0369,0.0213,0.0062,0.0144,0.0228,0.0113,0.104,0.1485,0.1449,0.1063,0.0659,0.1302,0.1167,0.0963,0.0152,0.0256,0.0822,0.0454,0.0047,0.0056,0.011,0.0101,0.035,0.0665,0.0954,0.1171,0.0459,0.0704,0.0955,0.0715,0.0097,0.029,0.0574,0.0251,0.0085,0.0102,0.02,0.0148,0.0248,0.0185,0.0928,0.0701,0.03,0.0338,0.0749,0.0749,0.0149,0.0174,0.021,0.0332,0.0182,0.0122,0.0083,0.0419,0.0252,0.024,0.0531,0.0762,0.0489,0.0247,0.033,0.1258,0.0175,0.0256,0.0131,0.0524,0.0261,0.0149,0.0157,0.0861,0.0434,0.0242,0.0362,0.1396,0.0565,0.0427,0.0431,0.2136,0.0345,0.0251,0.0143,0.0757,0.0146,0.006,0.0093,0.0411,0.0251,0.0187,0.031,0.047,0.0351,0.053,0.0541,0.1344,0.0167,0.0176,0.0149,0.0439,0.0092,0.0055,0.0136,0.0184,0.0186,0.0233,0.0678,0.0405,0.0248,0.0789,0.1125,0.0682,0.009,0.0144,0.0338,0.0389,0.0066,0.0129,0.0116,0.0091,0.0416,0.0913,0.0806,0.0461,0.0373,0.0956,0.0782,0.0602,0.0092,0.0132,0.0552,0.0419,0.0095,0.0188,0.0403,0.0282,0.0528,0.0827,0.1135,0.1069,0.0432,0.0556,0.0898,0.0818,0.0119,0.029,0.1051,0.0709,0.0328,0.0158,0.0191,0.0363,0.028,0.0451,0.0487,0.1089,0.0558,0.0726,0.0727,0.0525,0.0207,0.046,0.0584,0.0255,0.0552,0.0263,0.0332,0.0733,0.0475,0.0252,0.0662,0.112,0.0622,0.0339,0.066,0.1363,0.0512,0.0276,0.0249,0.0683,0.0199,0.0159,0.0293,0.0286,0.0281,0.0352,0.0785,0.0371,0.039,0.0509,0.0765,0.0821,0.025,0.0152,0.0471,0.0753,0.0077,0.0092,0.0085,0.0087,0.0895,0.1157,0.1134,0.0741,0.0529,0.1015,0.098,0.1066,0.0133,0.0174,0.0599,0.0287,0.0067,0.0081,0.0082,0.0077,0.0332,0.0759,0.0883,0.088,0.0408,0.1076,0.1387,0.0743,0.0108,0.0129,0.0383,0.0214,0.0063,0.0075,0.0116,0.0074,0.0303,0.039,0.083,0.0561,0.0311,0.0644,0.1124,0.0502,0.0117,0.0105,0.0166,0.0223,0.0134,0.0114,0.0124,0.0274,0.0259,0.0529,0.0872,0.0576,0.0298,0.0676,0.0937,0.0814,0.0133,0.0178,0.0112,0.0341,0.0208,0.0121,0.0124,0.0528,0.0295,0.0446,0.0989,0.0666,0.0437,0.076,0.1093,0.1461,0.0232,0.0193,0.0136,0.0484,0.012,0.0075,0.0122,0.0309,0.03,0.044,0.0796,0.0408,0.0343,0.0696,0.0906,0.1152,0.0183,0.0108,0.0177,0.0365,0.0102,0.0057,0.0079,0.0101,0.0322,0.0309,0.0716,0.0523,0.0341,0.0646,0.1177,0.0614,0.0117,0.0132,0.019,0.0203,0.0098,0.0066,0.0067,0.0076,0.0413,0.0847,0.0974,0.077,0.0297,0.0705,0.1156,0.0871,0.0121,0.0123,0.0413,0.0233,0.0061,0.0122,0.0228,0.011,0.1219,0.171,0.1641,0.1407,0.0748,0.1586,0.1563,0.1508,0.0171,0.0343,0.1044,0.0531,0.0052,0.0062,0.0121,0.0115,0.0393,0.0698,0.1048,0.1629,0.0452,0.0914,0.1193,0.1164,0.0072,0.034,0.0732,0.0309,0.0054,0.0085,0.0198,0.0139,0.0307,0.0216,0.1018,0.0796,0.0345,0.0454,0.0958,0.0869,0.0096,0.0189,0.0264,0.0361,0.0147,0.0117,0.0084,0.0344,0.0325,0.0327,0.055,0.0685,0.049,0.0302,0.0409,0.1359,0.0159,0.0162,0.0128,0.0539,0.0154,0.013,0.0152,0.0684,0.031,0.0289,0.0493,0.1177,0.0468,0.056,0.0674,0.2025,0.0269,0.0158,0.0184,0.0677,0.0133,0.0097,0.0096,0.0332,0.0235,0.0247,0.066,0.047,0.0223,0.0684,0.0817,0.122,0.0107,0.0142,0.0186,0.042,0.0092,0.0066,0.0155,0.0173,0.0241,0.0281,0.1046,0.071,0.0204,0.0969,0.1524,0.0947,0.0095,0.0133,0.0394,0.0391,0.007,0.0129,0.0136,0.0099,0.05,0.1057,0.0946,0.0848,0.043,0.1177,0.0907,0.0817,0.0088,0.0182,0.0642,0.0486,0.0117,0.0227,0.0547,0.0372,0.0646,0.0933,0.1581,0.1529,0.0495,0.0595,0.1293,0.1124,0.0113,0.0368,0.1317,0.0753,0.0268,0.013,0.0218,0.0346,0.0275,0.0453,0.0694,0.1228,0.053,0.0839,0.1111,0.0679,0.0214,0.0564,0.0766,0.0238,0.0396,0.0164,0.0232,0.0558,0.0389,0.0357,0.0815,0.1093,0.0478,0.067,0.1038,0.1442,0.0374,0.0213,0.0197,0.0601,0.0142,0.0173,0.0328,0.0207,0.03,0.0512,0.1142,0.0505,0.0337,0.0719,0.1242,0.1062,0.0234,0.0124,0.0603,0.0866], 100, 200, 8, false) RETURN Id(_node), _distance;
