-DATASET CSV vector-index

--

-CASE CREATE_VECTOR_INDEX

-STATEMENT MATCH (n:embeddings) RETURN count(n);
---- 1
10000
-STATEMENT CREATE VECTOR INDEX ON embeddings.embedding (samplingProbability=0.2, alpha=1.0);
---- ok
-STATEMENT UPDATE VECTOR INDEX ON embeddings.embedding;
---- ok
#-STATEMENT MATCH (n1:embeddings)-[e]->(n2:embeddings) RETURN ID(n1), ID(e), ID(n2) LIMIT 10000;
#---- 1
-STATEMENT CALL ANN_SEARCH(embeddings.embedding, [1.0,3.0,11.0,110.0,62.0,22.0,4.0,0.0,43.0,21.0,22.0,18.0,6.0,28.0,64.0,9.0,11.0,1.0,0.0,0.0,1.0,40.0,101.0,21.0,20.0,2.0,4.0,2.0,2.0,9.0,18.0,35.0,1.0,1.0,7.0,25.0,108.0,116.0,63.0,2.0,0.0,0.0,11.0,74.0,40.0,101.0,116.0,3.0,33.0,1.0,1.0,11.0,14.0,18.0,116.0,116.0,68.0,12.0,5.0,4.0,2.0,2.0,9.0,102.0,17.0,3.0,10.0,18.0,8.0,15.0,67.0,63.0,15.0,0.0,14.0,116.0,80.0,0.0,2.0,22.0,96.0,37.0,28.0,88.0,43.0,1.0,4.0,18.0,116.0,51.0,5.0,11.0,32.0,14.0,8.0,23.0,44.0,17.0,12.0,9.0,0.0,0.0,19.0,37.0,85.0,18.0,16.0,104.0,22.0,6.0,2.0,26.0,12.0,58.0,67.0,82.0,25.0,12.0,2.0,2.0,25.0,18.0,8.0,2.0,19.0,42.0,48.0,11.0], 100, 100, false) RETURN Id(_node), _distance;
---- 1
1
