-DATASET CSV demo-db/csv

--

-CASE ExportDBWithDropColumn
-SKIP_WASM
-SKIP_IN_MEM
-STATEMENT CREATE NODE TABLE test(id int64, prop1 string, prop2 string, prop3 int64, primary key(id));
---- ok
-STATEMENT CREATE (t:test{id:1, prop1:"A", prop2:"B", prop3:10});
---- ok
-STATEMENT ALTER TABLE test DROP prop1;
---- ok
-STATEMENT EXPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_special/drop_column_test";
---- ok
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_special/drop_column_test"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_special/drop_column_test";
---- ok
-STATEMENT MATCH (t:test) RETURN t.id, t.prop2, t.prop3;
---- 1
1|B|10

-CASE ExportDBWithDropAndAddColumn
-SKIP_WASM
-SKIP_IN_MEM
-STATEMENT CREATE NODE TABLE test(id int64, prop1 string, prop2 string, prop3 int64, primary key(id));
---- ok
-STATEMENT CREATE (t:test{id:1, prop1:"A", prop2:"B", prop3:10});
---- ok
-STATEMENT ALTER TABLE test DROP prop1;
---- ok
-STATEMENT ALTER TABLE test ADD prop4 string default "default_value";
---- ok
-STATEMENT EXPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_special/drop_add_column_test";
---- ok
#SPLIT
-IMPORT_DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_special/drop_add_column_test"
-STATEMENT IMPORT DATABASE "${KUZU_EXPORT_DB_DIRECTORY}_special/drop_add_column_test";
---- ok
-STATEMENT MATCH (t:test) RETURN t.id, t.prop2, t.prop3, t.prop4;
---- 1
1|B|10|default_value
