-SKIP
-DATASET CSV embedding/embeddings/googlegemini/

--

-CASE CreateEmbeddingGoogleGemini

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/embedding/build/libembedding.kuzu_extension"
---- ok

-STATEMENT MATCH (e:embedding) RETURN array_cosine_similarity(e.embedding, create_embedding(e.text, 'google-gemini', 'gemini-embedding-exp-03-07')) >= 0.9 AS similarity;
---- 6
True
True
True
True
True
True

-CASE SemanticDistanceCheck

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/embedding/build/libembedding.kuzu_extension"
---- ok

-LOG Similar Text 1
-STATEMENT WITH create_embedding('Who is the author of 1984?', 'google-gemini', 'gemini-embedding-exp-03-07') AS t1, create_embedding('Who wrote the novel 1984?', 'google-gemini', 'gemini-embedding-exp-03-07') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
True

-LOG Similar Text 2
-STATEMENT WITH create_embedding('What is the capital of France?', 'google-gemini', 'gemini-embedding-exp-03-07') AS t1, create_embedding('Which city is the capital of France?', 'google-gemini', 'gemini-embedding-exp-03-07') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
True

-LOG Dissimilar Text 1
-STATEMENT WITH create_embedding('How to train a dog', 'google-gemini', 'gemini-embedding-exp-03-07') AS t1, create_embedding('What is the capital of France', 'google-gemini', 'gemini-embedding-exp-03-07') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
False

-LOG Dissimilar Text 2
-STATEMENT WITH create_embedding('How do Unix file permissions work?', 'google-gemini', 'gemini-embedding-exp-03-07') AS t1, create_embedding('History of the Roman Empire', 'google-gemini', 'gemini-embedding-exp-03-07') AS t2 RETURN array_cosine_similarity(t1, t2) >= 0.8;
---- 1
False

# TODO(TANVIR)I have not been able to validate this result. I am on the free tier of
# Google Gemini and rate limits do not let this test run to completion. This should
# be validated when CI is setup.
-CASE UseWithVectorExtension
-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/embedding/build/libembedding.kuzu_extension"
---- ok

-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/vector/build/libvector.kuzu_extension"
---- ok

-STATEMENT CREATE NODE TABLE Book(id SERIAL PRIMARY KEY, title STRING, title_embedding FLOAT[3072], published_year INT64);
---- ok

-STATEMENT CREATE NODE TABLE Publisher(name STRING PRIMARY KEY);
---- ok

-STATEMENT CREATE REL TABLE PublishedBy(FROM Book TO Publisher);
---- ok

-STATEMENT CREATE (b:Book {title: 'The Quantum World', published_year: 2004});
---- ok

-STATEMENT CREATE (b:Book {title: 'Chronicles of the Universe', published_year: 2022});
---- ok

-STATEMENT CREATE (b:Book {title: 'Learning Machines', published_year: 2019});
---- ok

-STATEMENT CREATE (b:Book {title: 'Echoes of the Past', published_year: 2010});
---- ok

-STATEMENT CREATE (b:Book {title: 'The Dragon Call', published_year: 2015});
---- ok

-STATEMENT CREATE (p:Publisher {name: "Harvard University Press"});
---- ok

-STATEMENT CREATE (p:Publisher {name: "Independent Publisher"});
---- ok

-STATEMENT CREATE (p:Publisher {name: "Pearson"});
---- ok

-STATEMENT CREATE (p:Publisher {name: "McGraw-Hill Ryerson"});
---- ok

-STATEMENT CREATE (p:Publisher {name: "O'Reilly"});
---- ok

-STATEMENT MATCH (b:Book {title: 'The Quantum World'}) MATCH (p:Publisher {name: 'Harvard University Press'}) CREATE (b)-[:PublishedBy]->(p);
---- ok

-STATEMENT MATCH (b:Book {title: 'Chronicles of the Universe'}) MATCH (p:Publisher {name: 'Independent Publisher'}) CREATE (b)-[:PublishedBy]->(p);
---- ok

-STATEMENT MATCH (b:Book {title: 'Learning Machines'}) MATCH (p:Publisher {name: 'Pearson'}) CREATE (b)-[:PublishedBy]->(p);
---- ok

-STATEMENT MATCH (b:Book {title: 'Echoes of the Past'}) MATCH (p:Publisher {name: 'McGraw-Hill Ryerson'}) CREATE (b)-[:PublishedBy]->(p);
---- ok

-STATEMENT MATCH (b:Book {title: 'The Dragon Call'}) MATCH (p:Publisher {name: "O'Reilly"}) CREATE (b)-[:PublishedBy]->(p);
---- ok

-STATEMENT MATCH (b:Book) WITH b, create_embedding(b.title, 'google-gemini', 'gemini-embedding-exp-03-07') AS emb SET b.title_embedding = emb;
---- ok

-STATEMENT CALL CREATE_VECTOR_INDEX('Book', 'title_vec_index', 'title_embedding');
---- ok

-STATEMENT CALL QUERY_VECTOR_INDEX('Book', 'title_vec_index', create_embedding('quantum machine learning', 'google-gemini', 'gemini-embedding-exp-03-07'), 2) RETURN node.title ORDER BY distance;
-CHECK_ORDER
---- 2
Learning Machines
The Quantum World
