-NAME MultiLabelOneHopTest1
-QUERY MATCH (a:person)-[e:knows|:marries]->(b:person) RETURN COUNT(*)
---- 1
17

-NAME MultiLabelOneHopTest2
-QUERY MATCH (a:person)-[e:knows|:marries|:studyAt|:workAt|:meets|:mixed]->(b:person) RETURN COUNT(*)
---- 1
31

-NAME MultiLabelOneHopTest3
-QUERY MATCH (a:person)-[e:knows|:marries|:studyAt|:workAt|:meets|:mixed]->(b:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
9

-NAME MultiLabelTwoHopTest
-QUERY MATCH (a:person)-[e:knows|:mixed]->(b:person)-[:knows|:mixed]->(c:organisation) RETURN COUNT(*)
---- 1
11
