-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchMultiLabel

-LOG UnLabelTest
-STATEMENT MATCH () RETURN COUNT(*)
---- 1
14

-LOG MultiLabelNodeTest
-STATEMENT MATCH (a:organisation:person) RETURN COUNT(*)
---- 1
11

-LOG MultiLabelNodeTest
-STATEMENT MATCH (a:organisation:person) MATCH (a:movies) RETURN COUNT(*)
---- 1
14

-LOG MultiLabelCrossProductTest
-STATEMENT MATCH (a:person), (b:person), (c:person:movies) RETURN COUNT(*)
-ENUMERATE
---- 1
704

-LOG UnLabelTest1
-STATEMENT MATCH ()-[]->() RETURN COUNT(*)
---- 1
30

-LOG UnLabelTest2
-STATEMENT MATCH (a)-[:knows|:studyAt]->(b)-[:knows|:studyAt]->(c) RETURN COUNT(*)
---- 1
43

-LOG MultiLabelOneHopTest1
-STATEMENT MATCH (a:person)-[e:knows|:marries]->(b:person) RETURN COUNT(*)
---- 1
17

-LOG MultiLabelOneHopTest2
-STATEMENT MATCH (a:person)-[e:knows|:marries|:studyAt|:workAt|:meets]->(b:person) RETURN COUNT(*)
---- 1
24

-LOG MultiLabelOneHopTest3
-STATEMENT MATCH (a:person)-[e:knows|:marries|:studyAt|:workAt|:meets]->(b:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
6

-LOG MultiLabelOneHopTest4
-STATEMENT MATCH (a:person)-[:studyAt|:knows]->(b:person:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
17

-LOG MultiLabelNodePruning
-STATEMENT MATCH (a:person)-[:knows]->(b)<-[:studyAt]-(c) RETURN COUNT(*)
---- error
Binder exception: Cannot find a label for node b that connects to all of its neighbour relationships.
