-NAME node1
-QUERY MATCH (a:person) RETURN COUNT(*)
---- 1
8

-NAME node2
-QUERY MATCH (a:organisation) RETURN COUNT(*)
---- 1
3

-NAME node3
-QUERY MATCH (a:organisation:person) RETURN COUNT(*)
---- 1
11

-NAME nodeCrossProductTest
-QUERY MATCH (a:person), (b:person), (c:person:movies) RETURN COUNT(*)
-ENUMERATE
---- 1
704
