-NAME node1
-QUERY UNWIND [[1], [2], [3], [4]] AS x RETURN x
---- 1
[[1],[2],[3],[4]]

-NAME node2
-QUERY MATCH (a:organisation) RETURN COUNT(*)
---- 1
3
