-NAME OneHopKnowsTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN COUNT(*)
-ENUMERATE
---- 1
14

-NAME OneHopStudyAtTest
-QUERY MATCH (a:person)-[e1:studyAt]->(b:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
3

-NAME OneHopWorkAtTest
-QUERY MATCH (a:person)-[e1:workAt]->(b:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
3
