-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchOneHop

-DEBUG_LOG OneHopKnowsTest
-QUERY MATCH (a:person)-[e:knows]->(b:person) RETURN COUNT(*)
-ENUMERATE
---- 1
14

-DEBUG_LOG OneHopStudyAtTest
-QUERY MATCH (a:person)-[e1:studyAt]->(b:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
3

-DEBUG_LOG OneHopWorkAtTest
-QUERY MATCH (a:person)-[e1:workAt]->(b:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
3

-DEBUG_LOG OneHopCrossProductTest
-QUERY MATCH (a:person)-[:knows]->(b:person), (c:person)-[:knows]->(d:person) RETURN COUNT(*)
-ENUMERATE
---- 1
196
