-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchThreeHop

-NAME ThreeHopTwoKnowsOneWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:workAt]->(d:organisation) RETURN COUNT(*)
---- 1
18

-NAME OpenWedgeKnowsTest3
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:knows]->(c:person),(a)-[e3:knows]->(d:person) RETURN COUNT(*)
---- 1
116

-NAME ThreeHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:knows]->(d:person) RETURN COUNT(*)
-ENUMERATE
---- 1
108

-NAME ThreeHopTwoKnowsOneStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person)-[e3:studyAt]->(d:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
18

-NAME OpenWedgeKnowsTest4
-QUERY MATCH (b:person)-[e1:knows]->(a:person)<-[e2:knows]-(c:person),(a)<-[e3:knows]-(d:person) RETURN COUNT(*)
-ENUMERATE
---- 1
110
