-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchTwoHop

-DEBUG_LOG TwoHopKnowsStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 1
7

-DEBUG_LOG TwoHopKnowsWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 1
6

-DEBUG_LOG OpenWedgeKnowsTest1
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:knows]->(c:person) RETURN COUNT(*)
---- 1
40

-DEBUG_LOG OpenWedgeWorkAtTest1
-QUERY MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 1
3

-DEBUG_LOG OpenWedgeStudyAtTest
-QUERY MATCH (b:organisation)<-[e1:studyAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 1
3

-DEBUG_LOG TwoHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) RETURN COUNT(*)
-ENUMERATE
---- 1
36

-DEBUG_LOG OpenWedgeKnowsStudyAtTest
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
6

-DEBUG_LOG OpenWedgeKnowsWorkAtTest
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
8

-DEBUG_LOG OpenWedgeKnowsTest2
-QUERY MATCH (b:person)-[e1:knows]->(a:person)<-[e2:knows]-(c:person) RETURN COUNT(*)
-ENUMERATE
---- 1
38

-DEBUG_LOG OpenWedgeWorkAtTest2
-QUERY MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
0
