-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchTwoHop

-LOG TwoHopKnowsStudyAtTest
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 1
7

-LOG TwoHopKnowsWorkAtTest
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 1
6

-LOG OpenWedgeKnowsTest1
-STATEMENT MATCH (b:person)<-[e1:knows]-(a:person)-[e2:knows]->(c:person) RETURN COUNT(*)
---- 1
40

-LOG OpenWedgeWorkAtTest1
-STATEMENT MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 1
3

-LOG OpenWedgeStudyAtTest
-STATEMENT MATCH (b:organisation)<-[e1:studyAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 1
3

-LOG TwoHopKnowsTest
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) RETURN COUNT(*)
-ENUMERATE
---- 1
36

-LOG OpenWedgeKnowsStudyAtTest
-STATEMENT MATCH (b:person)<-[e1:knows]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
6

-LOG OpenWedgeKnowsWorkAtTest
-STATEMENT MATCH (b:person)<-[e1:knows]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
8

-LOG OpenWedgeKnowsTest2
-STATEMENT MATCH (b:person)-[e1:knows]->(a:person)<-[e2:knows]-(c:person) RETURN COUNT(*)
-ENUMERATE
---- 1
38

-LOG OpenWedgeWorkAtTest2
-STATEMENT MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
0
