-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchTwoHop

-NAME TwoHopKnowsStudyAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 1
7

-NAME TwoHopKnowsWorkAtTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 1
6

-NAME OpenWedgeKnowsTest1
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:knows]->(c:person) RETURN COUNT(*)
---- 1
40

-NAME OpenWedgeWorkAtTest1
-QUERY MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
---- 1
3

-NAME OpenWedgeStudyAtTest
-QUERY MATCH (b:organisation)<-[e1:studyAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
---- 1
3

-NAME TwoHopKnowsTest
-QUERY MATCH (a:person)-[e1:knows]->(b:person)-[e2:knows]->(c:person) RETURN COUNT(*)
-ENUMERATE
---- 1
36

-NAME OpenWedgeKnowsStudyAtTest
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
6

-NAME OpenWedgeKnowsWorkAtTest
-QUERY MATCH (b:person)<-[e1:knows]-(a:person)-[e2:workAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
8

-NAME OpenWedgeKnowsTest2
-QUERY MATCH (b:person)-[e1:knows]->(a:person)<-[e2:knows]-(c:person) RETURN COUNT(*)
-ENUMERATE
---- 1
38

-NAME OpenWedgeWorkAtTest2
-QUERY MATCH (b:organisation)<-[e1:workAt]-(a:person)-[e2:studyAt]->(c:organisation) RETURN COUNT(*)
-ENUMERATE
---- 1
0
