-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchUndirected

-LOG UndirKnows1
-STATEMENT MATCH (a:person)-[:knows]-(b:person) WHERE b.fName = "Bob" RETURN a.fName;
-ENUMERATE
---- 6
Alice
Carol
Dan
Alice
Carol
Dan

-LOG UndirKnows2
-STATEMENT MATCH (a:person)-[:knows]-(b:person)-[:knows]-(c:person) WHERE a.gender = 1 AND b.gender = 2 AND c.fName = "Bob" RETURN a.fName, b.fName;
-ENUMERATE
---- 8
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan

-LOG UndirMultiLabel1
-STATEMENT MATCH (a:person:organisation)-[:meets|:marries|:workAt]-(b:person:organisation) RETURN COUNT(*);
-ENUMERATE
---- 1
26

-LOG UndirMultiLabel2
-STATEMENT MATCH (a:person)-[:studyAt|:meets]-(b:person:organisation) RETURN COUNT(*);
-ENUMERATE
---- 1
17

-LOG UndirMultiLabel3
-STATEMENT MATCH (a:person)-[:meets|:marries|:knows]-(b:person)-[:knows|:meets]-(c:person) WHERE c.fName = "Farooq" AND a.fName <> "Farooq" RETURN a.fName, b.fName;
-ENUMERATE
---- 13
Carol|Elizabeth
Alice|Carol
Bob|Carol
Dan|Carol
Elizabeth|Carol
Greg|Carol
Greg|Elizabeth
Carol|Elizabeth
Alice|Carol
Bob|Carol
Dan|Carol
Elizabeth|Carol
Dan|Carol

-LOG UndirUnlabelled
-STATEMENT MATCH (a:person)-[]-() RETURN COUNT(*);
-ENUMERATE
---- 1
54

-LOG UndirLabelPruning
-STATEMENT MATCH (a:person)-[:knows|:studyAt|:workAt]-(b:person) RETURN COUNT(*);
---- 1
28

-LOG UndirPattern
-STATEMENT MATCH ()-[:studyAt]-(a)-[:meets]-()-[:workAt]-() RETURN a.fName;
-ENUMERATE
---- 2
Farooq
Bob

-STATEMENT MATCH (a:person)-[:workAt]-(b:organisation) RETURN a.ID, b.ID;
-ENUMERATE
---- 3
3|4
5|6
7|6
