-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchUndirected

-DEBUG_LOG UndirKnows1
-STATEMENT MATCH (a:person)-[:knows]-(b:person) WHERE b.fName = "Bob" RETURN a.fName;
-ENUMERATE
---- 6
Alice
Carol
Dan
Alice
Carol
Dan

-DEBUG_LOG UndirKnows2
-STATEMENT MATCH (a:person)-[:knows]-(b:person)-[:knows]-(c:person) WHERE a.gender = 1 AND b.gender = 2 AND c.fName = "Bob" RETURN a.fName, b.fName;
-ENUMERATE
---- 8
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan

-DEBUG_LOG UndirMultiLabel1
-STATEMENT MATCH (a:person:organisation)-[:meets|:marries|:workAt]-(b:person:organisation) RETURN COUNT(*);
-ENUMERATE
---- 1
26

-DEBUG_LOG UndirMultiLabel2
-STATEMENT MATCH (a:person)-[:studyAt|:meets]-(b:person:organisation) RETURN COUNT(*);
-ENUMERATE
---- 1
20

-DEBUG_LOG UndirMultiLabel3
-STATEMENT MATCH (a:person)-[:meets|:marries|:knows]-(b:person)-[:knows|:meets]-(c:person) WHERE c.fName = "Farooq" AND a.fName <> "Farooq" RETURN a.fName, b.fName;
-ENUMERATE
---- 13
Carol|Elizabeth
Alice|Carol
Bob|Carol
Dan|Carol
Elizabeth|Carol
Greg|Carol
Greg|Elizabeth
Carol|Elizabeth
Alice|Carol
Bob|Carol
Dan|Carol
Elizabeth|Carol
Dan|Carol

-DEBUG_LOG UndirUnlabelled
-STATEMENT MATCH (a:person)-[]-() RETURN COUNT(*);
-ENUMERATE
---- 1
60

-DEBUG_LOG UndirPattern
-STATEMENT MATCH ()-[:studyAt]-(a)-[:meets]-()-[:workAt]-() RETURN a.fName;
-ENUMERATE
---- 2
Farooq
Bob
