-GROUP TinySnbReadTest
-DATASET CSV tinysnb

--

-CASE MatchUndirected

-NAME UndirKnows1
-QUERY MATCH (a:person)-[:knows]-(b:person) WHERE b.fName = "Bob" RETURN a.fName;
-ENUMERATE
---- 6
Alice
Carol
Dan
Alice
Carol
Dan

-NAME UndirKnows2
-QUERY MATCH (a:person)-[:knows]-(b:person)-[:knows]-(c:person) WHERE a.gender = 1 AND b.gender = 2 AND c.fName = "Bob" RETURN a.fName, b.fName;
-ENUMERATE
---- 8
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan
Alice|Dan
Carol|Dan

-NAME UndirMultiLabel1
-QUERY MATCH (a:person:organisation)-[:meets|:marries|:workAt]-(b:person:organisation) RETURN COUNT(*);
-ENUMERATE
---- 1
26

-NAME UndirMultiLabel2
-QUERY MATCH (a:person)-[:studyAt|:meets]-(b:person:organisation) RETURN COUNT(*);
-ENUMERATE
---- 1
20

-NAME UndirMultiLabel3
-QUERY MATCH (a:person)-[:meets|:marries|:knows]-(b:person)-[:knows|:meets]-(c:person) WHERE c.fName = "Farooq" AND a.fName <> "Farooq" RETURN a.fName, b.fName;
-ENUMERATE
---- 13
Carol|Elizabeth
Alice|Carol
Bob|Carol
Dan|Carol
Elizabeth|Carol
Greg|Carol
Greg|Elizabeth
Carol|Elizabeth
Alice|Carol
Bob|Carol
Dan|Carol
Elizabeth|Carol
Dan|Carol

-NAME UndirUnlabelled
-QUERY MATCH (a:person)-[]-() RETURN COUNT(*);
-ENUMERATE
---- 1
60

-NAME UndirPattern
-QUERY MATCH ()-[:studyAt]-(a)-[:meets]-()-[:workAt]-() RETURN a.fName;
-ENUMERATE
---- 2
Farooq
Bob
