-GROUP TensorListTest
-DATASET CSV tensor-list

--

-CASE TensorListTest

-LOG SimpleReturnTensorList
-STATEMENT MATCH (t:tensor) RETURN t.*
-PARALLELISM 8
-ENUMERATE
---- 6
0|[True,False]|[[0.100000,0.200000],[0.300000,0.400000]]|[[[1,2],[3,4]],[[5,6],[7,8]]]|1
3|[True,False]|[[0.100000,0.200000],[0.300000,0.400000]]|[[[3,4],[5,6]],[[7,8],[9,10]]]|2
4|[False,True]|[[0.400000,0.800000],[0.700000,0.600000]]|[[[5,6],[7,8]],[[9,10],[11,12]]]|
5|[True,True]|[[0.400000,0.900000],[0.500000,0.200000]]|[[[7,8],[9,10]],[[11,12],[13,14]]]|
6|[False,True]|[[0.200000,0.400000],[0.500000,0.100000]]|[[[9,10],[11,12]],[[13,14],[15,16]]]|5
8|[False,True]|[[0.600000,0.400000],[0.600000,0.100000]]|[[[11,12],[13,14]],[[15,16],[17,18]]]|6
