-DATASET CSV tinysnb

--

-CASE PersonNodesEyeSightFilteredTest1WithALPExceptions
-STATEMENT CREATE (a:person {fname: 'Ali', ID: 88, eyeSight: 5.1})
---- ok
-STATEMENT CREATE (a:person {fname: 'Alic', ID: 77, eyeSight: 123456789.123})
---- ok
-STATEMENT CHECKPOINT;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID = 88 DELETE a;
---- ok
-STATEMENT MATCH (a:person) WHERE a.eyeSight >= 6 RETURN a.ID, a.eyeSight
---- 1
77|123456789.123000

-CASE ZoneMapUpdateThenQueryWithoutCheckpoint
-LOG Comparison
-STATEMENT CALL enable_zone_map=true;
---- ok
-STATEMENT MATCH (a:person) WHERE a.ID=0 SET a.age=40 + 50
---- ok
-STATEMENT MATCH (a:person) WHERE a.age > 85 RETURN a.ID, a.age
---- 1
0|90
-STATEMENT MATCH (a:person) WHERE a.age > 95 RETURN a.ID, a.age
---- 0
-STATEMENT CREATE (a:person {id: 100, age: 100, isStudent: true})
---- ok
-STATEMENT MATCH (a:person) WHERE a.age > 95 RETURN a.ID, a.age
---- 1
100|100

-LOG NullCheckBool
-STATEMENT MATCH (a:person) WHERE a.ID=0 SET a.isStudent=null
---- ok
-STATEMENT MATCH (a:person) RETURN COUNT(*)
---- 1
9
-STATEMENT MATCH (a:person) WHERE a.isStudent IS NULL RETURN a.ID, a.fName, a.gender, a.isWorker, a.age
---- 1
0|Alice|1|False|90
-STATEMENT MATCH (a:person) WHERE a.isStudent IS NOT NULL RETURN COUNT(*)
---- 1
8
-RELOADDB
-STATEMENT MATCH (a:person) WHERE a.isStudent IS NULL RETURN COUNT(*)
---- 1
1
-STATEMENT MATCH (a:person) WHERE a.isStudent IS NOT NULL RETURN COUNT(*)
---- 1
8
-STATEMENT MATCH (a:person) WHERE a.ID=0 SET a.isStudent=true
---- ok
-STATEMENT MATCH (a:person) WHERE a.isStudent IS NULL RETURN COUNT(*)
---- 1
0
-STATEMENT MATCH (a:person) WHERE a.isStudent IS NOT NULL RETURN COUNT(*)
---- 1
9

-LOG NullCheckStruct
-STATEMENT MATCH (a:organisation) WHERE a.state IS NULL RETURN COUNT(*)
---- 1
0
-STATEMENT MATCH (a:organisation) WHERE a.state IS NOT NULL RETURN COUNT(*)
---- 1
3
-STATEMENT MATCH (a:organisation) WHERE a.ID=4 SET a.state=null
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.state IS NULL RETURN COUNT(*)
---- 1
1
-STATEMENT MATCH (a:organisation) WHERE a.state IS NOT NULL RETURN COUNT(*)
---- 1
2
-RELOADDB
-STATEMENT MATCH (a:organisation) WHERE a.state IS NULL RETURN COUNT(*)
---- 1
1
-STATEMENT MATCH (a:organisation) WHERE a.state IS NOT NULL RETURN COUNT(*)
---- 1
2
-STATEMENT MATCH (a:organisation) WHERE a.ID=4 SET a.state={revenue: CAST(1, "INT16"), location: ["aaa"], stock: {price: [1], volumn: 1}}
---- ok
-STATEMENT MATCH (a:organisation) WHERE a.state IS NULL RETURN COUNT(*)
---- 1
0
-STATEMENT MATCH (a:organisation) WHERE a.state IS NOT NULL RETURN COUNT(*)
---- 1
3

-CASE FilterNode

-LOG PersonNodesAgeFilteredTest1
-STATEMENT MATCH (a:person) WHERE a.age <= 25 RETURN COUNT(*)
---- 1
3

-LOG PersonNodesAgeFilteredTest2
-STATEMENT MATCH (a:person) WHERE a.age < 25 RETURN COUNT(*)
---- 1
2

-LOG PersonNodesAgeFilteredTest3
-STATEMENT MATCH (a:person) WHERE a.age >= 25 RETURN COUNT(*)
---- 1
6

-LOG PersonNodesAgeFilteredTest4
-STATEMENT MATCH (a:person) WHERE a.age > 25 RETURN COUNT(*)
---- 1
5

-LOG PersonNodesAgeFilteredTest5
-STATEMENT MATCH (a:person {age:25}) RETURN COUNT(*)
---- 1
1

-LOG PersonNodesAgeFilteredTest6
-STATEMENT MATCH (a:person) WHERE a.age <> 25 RETURN COUNT(*)
---- 1
7

-LOG PersonNodesAgeFilteredTest7
-STATEMENT MATCH (a:person) WHERE a.age IS NULL RETURN COUNT(*)
---- 1
0

-LOG PersonNodesAgeFilteredTest8
-STATEMENT MATCH (a:person) WHERE a.age IS NOT NULL RETURN COUNT(*)
---- 1
8

-LOG SingletonKnowsFilteredTest
-STATEMENT MATCH (a:person) WHERE a.gender * 2.1 = 2.1 * a.gender RETURN COUNT(*)
---- 1
8

-LOG PersonNodesIsStudentFilteredTest
-STATEMENT MATCH (a:person) WHERE a.isStudent RETURN COUNT(*)
---- 1
3

-LOG PersonNodesIsWorkerFilteredTest
-STATEMENT MATCH (a:person {isWorker:true}) RETURN COUNT(*)
---- 1
4

-LOG PersonNodesIsWorkerFilteredTest1
-STATEMENT MATCH (a:person) WHERE a.isWorker AND a.isStudent RETURN COUNT(*)
---- 1
0

-LOG PersonNodesIsWorkerFilteredTest2
-STATEMENT MATCH (a:person) WHERE a.isWorker OR a.isStudent RETURN COUNT(*)
---- 1
7

-LOG PersonNodesIsWorkerFilteredTest3
-STATEMENT MATCH (a:person) WHERE a.isWorker XOR a.isStudent RETURN COUNT(*)
---- 1
7

-LOG PersonNodesIsWorkerFilteredTest4
-STATEMENT MATCH (a:person) WHERE NOT a.isWorker RETURN COUNT(*)
---- 1
4

-LOG OrganisationNodesMarkFilteredTest
-STATEMENT MATCH (a:organisation) WHERE a.mark >= 3.7 RETURN COUNT(*)
---- 1
3

-LOG PersonNodesGenderFilteredTest1
-STATEMENT MATCH (a:person) WHERE (a.gender/2 <= 0.5) RETURN COUNT(*)
---- 1
3

-LOG PersonNodesGenderFilteredTest2
-STATEMENT MATCH (a:person) WHERE (a.gender*3.5 = 7.0) RETURN COUNT(*)
---- 1
5

-LOG PersonNodesFNameFilteredTest1
-STATEMENT MATCH (a:person) WHERE a.fName = 'Farooq' RETURN COUNT(*)
---- 1
1

-LOG PersonNodesFNameFilteredTest2
-STATEMENT MATCH (a:person) WHERE a.fName <> 'Farooq' RETURN COUNT(*)
---- 1
7

-LOG PersonNodesFNameFilteredTest3
-STATEMENT MATCH (a:person) WHERE a.fName < 'Carom' RETURN COUNT(*)
---- 1
3

-LOG PersonNodesFNameFilteredTest4
-STATEMENT MATCH (a:person) WHERE a.fName >= 'Eliz' RETURN COUNT(*)
---- 1
4

-LOG FilterNullTest1
-STATEMENT MATCH (a:person) WHERE a.age <= null RETURN COUNT(*)
---- 1
0

-LOG FilterNullTest2
-STATEMENT MATCH (a:person) WHERE a.age + null <= 200 RETURN COUNT(*)
---- 1
0

-LOG FilterNullTest3
-STATEMENT MATCH (a:person) WHERE a.isStudent OR null RETURN COUNT(*)
---- 1
3

-LOG nodeCrossProduct
-STATEMENT MATCH (a:person), (b:person {ID:a.ID}) WHERE a.ID < 4 RETURN COUNT(*)
---- 1
3

-LOG nodeCrossProduct
-STATEMENT MATCH (a:person {ID:1000}), (b:person) RETURN COUNT(*)
---- 1
0
