-DATASET CSV tinysnb

--

-CASE FilterOneHop

-LOG OneHopKnowsFilteredTest3
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE (a.gender/2 <= 0.5) AND (b.gender*3.5 = 7.0) RETURN COUNT(*)
---- 1
6

-LOG TwoHopKnowsIDLessThanTest
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) < id(b) RETURN COUNT(*)
---- 1
8

-LOG OneHopKnowsFilteredTest
-STATEMENT MATCH (a:person {gender:1})-[e:knows]->(b:person{gender:2}) RETURN COUNT(*)
---- 1
6

-LOG OneHopKnowsFilteredTest2
-STATEMENT MATCH (a:person)-[e:knows]->(b:person) WHERE a.age > 22 RETURN COUNT(*)
---- 1
9

-LOG OneHopOrgCodeFilter
-STATEMENT MATCH (a:person)-[e1:studyAt]->(b:organisation) WHERE b.orgCode > 100 RETURN COUNT(*)
---- 1
3

-LOG OneHopKnowsIDGreaterThanTest
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE id(a) > id(b) RETURN COUNT(*)
---- 1
6

-LOG OneHopCrossProduct
-STATEMENT MATCH (a:person {age:30}), (c:person)-[:knows]->(d:person{fName:'Greg'}) RETURN a.ID, c.ID
---- 1
2|7

-LOG EdgeFilter
-STATEMENT MATCH (a:person)-[e1:knows {date:date('1905-12-12')}]->(b:person) RETURN a.ID, b.ID
---- 2
7|8
7|9

-LOG Zonemap
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.date > date('2024-01-01') RETURN e1
---- 0

-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.date < date('1900-01-01') RETURN e1
---- 0

-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime < timestamp('1900-08-25 19:07:22') RETURN e1
---- 0

-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime > timestamp('2024-01-01 19:07:22') RETURN e1.meetTime
---- 1
2025-01-01 11:22:33.52

-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime > timestamp('2025-01-01 11:22:33.53') RETURN e1.meetTime
---- 0

-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.validInterval > cast('200 year', 'interval') RETURN e1
---- 0

-CASE ZonemapWithUpdatesNoCheckpoint
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE a.ID = 0 AND b.ID = 2 SET e1.meetTime = timestamp('2025-02-01 11:22:33.53')
---- ok
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime > timestamp('2025-01-01 11:22:33.53') RETURN a.ID, b.ID, e1.meetTime
---- 1
0|2|2025-02-01 11:22:33.53
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime > timestamp('2026-01-01 11:22:33.53') AND a.ID = 2 RETURN a.ID, b.ID, e1.meetTime
---- 0
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = 2 AND b.ID = 7 CREATE (a)-[e:knows {meetTime:timestamp('2026-02-01 11:22:33.53')}]->(b);
---- ok
-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) WHERE e1.meetTime > timestamp('2026-01-01 11:22:33.53') AND a.ID = 2 RETURN a.ID, b.ID, e1.meetTime
---- 1
2|7|2026-02-01 11:22:33.53
